[
  {
    "route": "/blog",
    "title": "",
    "image": "",
    "tags": [],
    "description": "",
    "content": "",
    "date": "2024-09-23T13:35:30.230Z",
    "children": [
      "/blog/debug-a-smartcontract-in-hardhat",
      "/blog/zoom-out-the-ethereums-storage-layout",
      "/blog/chuyen-cat-toc",
      "/blog/wrapped-viction",
      "/blog/cheatsheet-digital-signature-in-web3",
      "/blog/contract-factory-the-solidity-pattern-and-facts",
      "/blog/data-availability-de-lam-gi",
      "/blog/a-tidy-role-model-in-scrum",
      "/blog/how-to-export-abi-in-hardhat",
      "/blog/the-elements-of-style",
      "/blog/common-pitfalls-for-web3-founders",
      "/blog/account-abstraction-in-nutshell",
      "/blog/bai-toan-nha-ty-phu",
      "/blog/nho-lam-la-hai",
      "/blog/chuyen-messi-roi-barca",
      "/blog/canh-dieu-thang-6",
      "/blog/dai-so-dai-cuong"
    ]
  },
  {
    "route": "/blog/debug-a-smartcontract-in-hardhat",
    "title": "Debug a Smartcontract in Hardhat Mien PV",
    "image": "/_next/static/media/solidity-errors.2936f652.jpg",
    "tags": [
      "evm",
      "hardhat",
      "solidity"
    ],
    "description": "To inspect a variable's value, the functions like console.log, or print, or cout are widely used in debugging. However, the original design of solidity have no enviroment to print out the logs, then developers used to find difficulty to understand their program's logic and errors.",
    "content": "Debug a Smartcontract in Hardhat Mien PV To inspect a variable's value, the functions like console.log, or print, or cout are widely used in debugging. However, the original design of solidity have no enviroment to print out the logs, then developers used to find difficulty to understand their program's logic and errors. console.log is one of the selling points in Hardhat. That's why people love Hardhat. Today, we will learn how to do it in Hardhat, which is an excellent framework for smartcontract development. Explanation. The line import 'hardhat/console.sol'; is to import a Solidity library named console. There exists a function name log in console so that clarifies the syntax of console.log. However, we cannot use it, console.log, to print a bytes variable. Instead, we must use console.logBytes. Note that the package is only helpful on localnet. If you're considering to debug your contracts on testnet, or even mainnet, I highly recommend to use emit Event, which you can find here.",
    "date": "2024-08-30T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/zoom-out-the-ethereums-storage-layout",
    "title": "Zoom out the Ethereum's Storage Layout",
    "image": "/_next/static/media/contracts-storage-layout.e5152a83.jpg",
    "tags": [
      "evm",
      "layer2"
    ],
    "description": "While I was learning the process of verification in Optimism, the question \"How the state in calldata looks like?\" just kept buzzing in my head. So this article will solve all the mysterious stuff behind the fancy words of \"Merkle Trie\" or \"Merkle Patricia Trie\" once and for all 😤.",
    "content": "Zoom out the Ethereum's Storage Layout While I was learning the process of verification in Optimism, the question \"How the state in calldata looks like?\" just kept buzzing in my head. So this article will solve all the mysterious stuff behind the fancy words of \"Merkle Trie\" or \"Merkle Patricia Trie\" once and for all 😤. Contract storage All statically-sized variables are laid out contiguously on storage slots. Each storage slot has its own index, which runs from $0$ to $2^{256}-1$, and points to a big-endian 32-bytes storage. Multiple statically-sized variables (except struct and array) could stored in a slot if they all fit in. However, struct and array always take new slots and their elements are follow the aforementioned rules. In case of contract inheritance, it will follow C3 linearization. Dynamically-sized variables including mapping and dynamic array use a Keccak-256 hash to find the starting position. With an array at position p, the slot p-th will store the number of elements in the array and the array data will locate at keccak256(p). With a mapping at position p, the slot p-th will be empty and the data of key k will locate at keccak256(k|p) , where | is concatenation. For example, The slot of data[4][9] will start at: $$ \\begin{aligned} &x = \\textcolor{red}{keccak256(}\\ & \\quad uint256(9) | \\textcolor{green}{keccak256(}\\ & \\qquad uint256(4) | uint256(1)\\ & \\quad \\textcolor{green}{)}\\ &\\textcolor{red}{)} \\end{aligned} $$ Additionally, the data of data[4][9].a is locate at $x$ and the data of data[4][9].b is locate at $x+1$. All these knowledges is not really interesting. The thing we must notice is that the contract storage is a strip of 32-byte length slots. The $key$ is a 32-byte integer and the $value$ is a RLP-encoded 32-byte integer. Contract's Storage Layout Account State The account state consists of $nonce$, $balance$, $storageRoot$, and $codeHash$. Focusing on $storageRoot$, it stores the root hash of Merkle Patricia Trie (MPT). We know that for a pair of $(key,value)$, the $key$ represents the path and the $value$ is the leaf content in MPT. Mapping the knowledge into the Contract Storage, a storage slot p with value is encoded to a pair of $(keccak256(p), RLP(value))$ and added to the MPT. Account State World State Every Account State will be hold by an 20-byte-length address. It will form an account $$ \\begin{aligned} &(\\ &\\quad keccak256(addr),\\ &\\quad RLP(\\ &\\qquad nonce,\\ &\\qquad balance,\\ &\\qquad storageRoot,\\ &\\qquad codeHash\\ &\\quad)\\ &) \\end{aligned} $$ All accounts in the world will be organized into an MPT and yield out a $stateRoot$. World State There are 2 more tries namely Transaction Trie, and Transaction Receipt Trie, which I believe they follow the same strategy as the World State Trie. Block Header Push the World State along with other data into a block header. Block Header Back to Optimism Instead of executing transactions onchain and relying on the Layer 1's throughput, Optimism just does it offchain then submits the logs onto the Layer 1 (i.e. Ethereum) as a proof of execution and validation to significantly reduce the cost. The logs are states that stored in onchain transactions' calldata. The submitted states includes: Output Root. It is a 32-byte string of $keccak256(versionByte | payload)$ where $versionByte$ is a 32-byte simple string of the L2 Output Commitment version, and $payload$ is $$ \\begin{aligned} payload =& ; stateRoot\\ |& ; withdrawalStorageRoot\\ |& ; latestBlockHash \\end{aligned} $$ Batch. It is a concatenation of $(batchVersion|content)$ where $$ \\begin{aligned} &content = RLP(\\ & \\quad parentHash,\\ & \\quad epochNumber,\\ & \\quad epochHash,\\ & \\quad timestamp,\\ & \\quad transactionList\\ &) \\end{aligned} $$",
    "date": "2024-08-21T17:00:00.000Z",
    "children": [
      "/blog/zoom-out-the-ethereums-storage-layout/giai-ma-bo-cuc-du-lieu-cua-ethereum"
    ]
  },
  {
    "route": "/blog/zoom-out-the-ethereums-storage-layout/giai-ma-bo-cuc-du-lieu-cua-ethereum",
    "title": "Giải mã bố cục dữ liệu của Ethereum",
    "image": "/_next/static/media/contracts-storage-layout.e5152a83.jpg",
    "tags": [
      "evm",
      "layer2",
      "🇻🇳"
    ],
    "description": "Khi đang tìm hiểu về quá trình kiểm tra dữ liệu của Optimism, trong tôi luôn có một câu hỏi rằng \"Trạng thái được lưu trong calldata trông như thế nào?\". Vì vậy, tôi đã quyết định giải quyết tất cả điều bí ẩn đằng sau những từ ngữ hoa mỹ như \"Merkle Trie\" hoặc \"Merkle Patricia Trie\" trong bài viết này một lần và mãi mãi.",
    "content": "Giải mã bố cục dữ liệu của Ethereum Khi đang tìm hiểu về quá trình kiểm tra dữ liệu của Optimism, trong tôi luôn có một câu hỏi rằng \"Trạng thái được lưu trong calldata trông như thế nào?\". Vì vậy, tôi đã quyết định giải quyết tất cả điều bí ẩn đằng sau những từ ngữ hoa mỹ như \"Merkle Trie\" hoặc \"Merkle Patricia Trie\" trong bài viết này một lần và mãi mãi. Bộ nhớ của Contract Tất cả các biến với độ dài cố định sẽ được trải ra liên tiếp nhau trên storage slots[^1]. Mỗi storage slot sẽ có số thứ tự chạy từ $0$ đến $2^{256}-1$ và đồng thời trỏ đến một vùng nhớ 32 bytes. Nhiều biến với độ dài cố định (trừ struct và array) có thể được lưu trên cùng một storage slot miễn là tổng độ dài vừa đủ trong một ô nhớ. Tuy nhiên, struct và array sẽ luôn chiếm một storage slot mới trong khi các phần tử của chúng vẫn sẽ tuân theo quy luật ban đầu. Trong trường hợp các contract kết thừa nhau, các vị trí ô nhớ sẽ tuân theo luật C3 linearization. Các biến có độ dài biến động bao gồm mapping và array độ dài không xác định sẽ sử dụng Keccak-256 để tìm ra vị trí ô nhớ bắt đầu. Với một array ở vị trí p, storage slot thứ p sẽ lưu giá trị số lượng phần tử trong mảng và dữ liệu mảng thì sẽ được lưu ở vị trí keccak256(p). Với một mapping ở vị trí p, storage slot thứ p sẽ không lưu gì cả và dữ liệu của khoá k sẽ đặt ở vị trí keccak256(k|p), trong đó | là hàm nối mảng. Lấy ví dụ, Storage slot của data[4][9] sẽ bắt đầu tại: $$ \\begin{aligned} &x = \\textcolor{red}{keccak256(}\\ & \\quad uint256(9) | \\textcolor{green}{keccak256(}\\ & \\qquad uint256(4) | uint256(1)\\ & \\quad \\textcolor{green}{)}\\ &\\textcolor{red}{)} \\end{aligned} $$ Ngoài ra, dữ liệu của data[4][9].a sẽ đặt tại $x$ và dữ liệu của data[4][9].b sẽ đặt tại $x+1$. Tất cả những kiến thức trên thực sự không cần quá để tâm. Điều chúng ta cần lưu ý ở đây là dữ liệu của contract được hình thành dưới dạng một dải các ô nhớ 32 bytes. Trong đó, $key$ sẽ là một số nguyên 32 bytes và $value$ sẽ mà một số nguyên 32 bytes với Mã hoá RLP. Contract's Storage Layout Account State Một Account State[^1] bao gồm $nonce$, $balance$, $storageRoot$, và $codeHash$. Tập trung vào $storageRoot$, nó chính là giá trị hash gốc của Cây Merkle Patricia (MPT). Như chúng ta biết rằng với một cặp $(key,value)$, $key$ sẽ đại diện cho đường dẫn đến node lá và $value$ sẽ chính là nội dung của node lá. Kết hợp hiểu biết này với Bộ nhớ của Contract, một storage slot vị thứ p với giá trị value sẽ được mã hoá thành cặp $(keccak256(p), RLP(value))$ trước khi thêm vào cây MPT. Account State World State Một Account State sẽ được giữ bởi một địa chỉ dài 20 bytes. Điều đó sẽ cho ra một tài khoản dưới dạng: $$ \\begin{aligned} &(\\ &\\quad keccak256(addr),\\ &\\quad RLP(\\ &\\qquad nonce,\\ &\\qquad balance,\\ &\\qquad storageRoot,\\ &\\qquad codeHash\\ &\\quad)\\ &) \\end{aligned} $$ Tất cả các tài khoản trên thế giới sẽ được tổ chức vào trong một cây MPT và cuối cùng cho ra một $stateRoot$. World State Ngoài ra, còn có thêm 2 cây nữa là Transaction Trie, và Transaction Receipt Trie, mà tôi tin rằng chúng được cấu tạo với mô hình tường tự như World State Trie. Block Header Đưa giá trị của World State cùng với một số giá trị khác vào trong một block header[^1]. Block Header Back to Optimism Thay vì thực thi giao dịch trực tiếp[^2] trên Layer 1[^1] và phụ thuộc vào tốc độ của nó, Optimism lại thực thi các giao dịch này gián tiếp[^3] đồng thời chỉ gửi các ghi chú lên Layer 1 (cụ thể là Ethereum) như là một bằng chứng cho quá trình thực thi và xác nhận để giảm thiểu đáng kể các chi phí thực thi. Các ghi chú này cụ thể là các trạng thái được lưu trong calldata của những giao dịch trực tiếp. Các trạng thái được lưu: Output Root.[^1] Nó là một chuỗi 32 bytes với giá trị là $keccak256(versionByte | payload)$. Trong đó, $versionByte$ sẽ là một chuỗi 32 bytes đơn giản thể hiện phiên bản của L2 Output Commitment, và $payload$ là $$ \\begin{aligned} payload =& ; stateRoot\\ |& ; withdrawalStorageRoot\\ |& ; latestBlockHash \\end{aligned} $$ Batch.[^1] Nó là kết quả của phép nối mảng $(batchVersion|content)$ với $$ \\begin{aligned} &content = RLP(\\ & \\quad parentHash,\\ & \\quad epochNumber,\\ & \\quad epochHash,\\ & \\quad timestamp,\\ & \\quad transactionList\\ &) \\end{aligned} $$ [^1]: Từ này sẽ được giữ nguyên gốc như là một danh từ thay vì dịch ra nghĩa Tiếng Việt. [^2]: trực tiếp = onchain. [^3]: gián tiếp = offchain.",
    "date": "2024-08-21T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/chuyen-cat-toc",
    "title": "Chuyện cắt tóc",
    "image": "/_next/static/media/cat-toc-dao.7d6edb23.jpg",
    "tags": [
      "tản văn",
      "🇻🇳"
    ],
    "description": "Tôi có cậu em vẫn hay rửa xe cho tôi. Cu cậu rửa xe cẩn thận vả lại khá có duyên nên tôi vẫn thường ghé, một phần để rửa xe, phần còn lại để trò chuyện.",
    "content": "Chuyện cắt tóc Tôi có cậu em vẫn hay rửa xe cho tôi. Cu cậu rửa xe cẩn thận vả lại khá có duyên nên tôi vẫn thường ghé, một phần để rửa xe, phần còn lại để trò chuyện. Mới tháng trước, cu cậu có nói \"Anh à, chắc em thôi không rửa xe nữa!\". Tôi cũng hơi ngạc nhiên nhưng cũng hỏi tiếp câu chuyện. Nhè ra cu cậu lâu nay học nghề cắt tóc vào các tối trong tuần, nay cứng tay cứng chân nên muốn mở tiệm riêng. Vừa được đổi đời tự doanh, nhưng theo cậu thì cái quan trọng hơn là nghề rửa xe không có tính nghệ thuật, mà ai thiếu nghệ thuật thì người đó coi như sống với chỉ một nửa linh hồn. Cuộc đời cần nghệ thuật và nghệ thuật giúp làm đẹp cho đời. Cắt một cái đầu đẹp thì vẫn nghệ hơn so với rửa một cái xe sạch, cũng vì vậy mà nghiệp cắt tóc sẽ duyên hơn với cu cậu. Tôi nghe ù ù cạc cạc nên cũng ợm ờm cho xuôi và hứa sẽ ghé ủng hộ ông chủ. Dạo này trời nóng, tóc dài quá đâm ra bất tiện. Nhớ lời hứa với cu cậu tôi cũng thôi ghé tiệm cắt tóc và xem cậu em làm ăn sao rồi. Tiệm mới, nói chung không đông, chỉ có tôi với cu cậu là vừa đủ hai vế của kẻ bán người mua. Ngồi lên ghế, tháo kính cận cho cu cậu xử. Thường thì cắt tóc tiệm cũ họ vẫn hay yêu cầu tôi đeo kính vào kiểm tra có vừa ý không rồi mới cắt tiếp phần khác. Riêng tiệm này, ông chủ chắc giỏi và hiểu khách nên không thấy hỏi. Phần tôi tôn trọng ông chủ nên cũng không yêu cầu. Tầm nửa tiếng thì cũng xong. Ông chủ lau chùi cổ vai, phủi bớt tóc con còn vướng trên áo rồi hỏi ý kiến khách. Tôi không biết trả lời sao vì còn đang lờ mờ hiểu ra cái ý nghệ thuật mà cậu từng nhắc đến lúc còn rửa xe. Gửi tiền rồi dắt xe ra về. Trên đường, tôi đồng ý với bản thân có lẽ vì rửa xe lâu quá mà nghệ thuật trong cậu nó chết hẳn rồi, không cứu được. Cắt tóc dạo xưa",
    "date": "2024-08-18T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/wrapped-viction",
    "title": "Wrapped Native Token",
    "image": "/_next/static/media/wrapped-token.f1fd6ffc.png",
    "tags": [
      "evm",
      "hardhat",
      "solidity"
    ],
    "description": "I have played around the Viction ecosystem (an EVM-compatible layer 1) and figured out they have no wrapped token (i.e. WVIC) on thier own blockchain. Interestedly, I used many wrapped tokens like WETH, WSOL but nener wonder how was it implemented? So I decide to build one on Viction.",
    "content": "Wrapped Native Token I have played around the Viction ecosystem (an EVM-compatible layer 1) and figured out they have no wrapped token (i.e. WVIC) on thier own blockchain. Interestedly, I used many wrapped tokens like WETH, WSOL but nener wonder how was it implemented? So I decide to build one on Viction. A wrapped token illustration from Tangem Wallet Definition Wrapped Tokens is usually to denote a new token that pegged 1:1 to the original token but with a different technical interface to serve some specific purpose. The can deposit 1 original token to get 1 wrapped token. Otherwise, they will send back the wrapped token to withdraw thier original token. On some platforms, you might pay a fraction of fee. So technically, it won't be 1:1. For example, Uniswap is designed to work with ERC20 but ETH. In order to let ETH be traded on Uniswap, they have to wrap the ETH to an ERC20-based ETH and named it WETH. Another example, people will wrap BTC on Solana to allow BTC being used as a colleteral on Solana-based lending platforms. You can obviously see that 1 ETH = 1 WETH and 1 BTC = 1 solBTC. WVIC Wrap VICTION will follow VRC20 (aka. ERC20) standard. When people send VIC to the WVIC contract (with or without msg.data), the contract will mint the same amount WVIC to the sender. To unwrap and withdraw VIC, people call burn. For convenience, instead of rewriting the ERC20 contracts, we will use the @openzeppelin/contracts. You can refer the full WVIC contract at tuphan-dn/wvic. Explanation The fallback and receive functions are payable functions, which means they allow people to send VIC directly to the contract and both will be trigged. The difference between them is receive will trigged iff. the transaction transferring VIC to the contract doesn't include msg.data. The fallback will be called if the receive is not defined or invoked (that why it's called fallback). In both functions, we will call _mint to release the exact amount of WVIC to the sender. We also define a burn function so that the contract can subtract the amount of WVIC and return the same number of VIC to the sender. Facts You cannot burn your allowance. If someone approve x WVIC to you, you cannot burn it directly. To do it, you may call transferFrom to your wallet to possess the tokens first before you can burn it. You can define fallback only and remove receive. The fallback function is invoked in both case of transferring transaction with or without msg.data. However, to avoid compiler warning, I did define both fallback and receive. Pegged tokens $\\neq$ Wrapped tokens.",
    "date": "2024-08-16T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/cheatsheet-digital-signature-in-web3",
    "title": "Cheatsheet: Digital Signature in Web3",
    "image": "/_next/static/media/dsa.bb2d17f7.png",
    "tags": [
      "cryptography",
      "math"
    ],
    "description": "Digital signature algorithms are used to ensure the authenticity and integrity of digital messages or documents. Three popular digital signature algorithms are ECDSA, EdDSA, and BLS.",
    "content": "Cheatsheet: Digital Signature in Web3 Digital signature algorithms are used to ensure the authenticity and integrity of digital messages or documents. Three popular digital signature algorithms are ECDSA, EdDSA, and BLS. Digital Signature from Zoho WorkDrive ECDSA is a widely used digital signature algorithm based on elliptic curve cryptography and widely adopted in well-known blockchains namely Bitcoin and Ethereum. Schnorr Signature (EdDSA) is another digital signature algorithm also based on elliptic curve. It is designed to be faster and more secure than ECDSA. Furthermore, Schnorr signature is more friendly to multi-party computing than ECDSA. BLS is a digital signature algorithm that uses bilinear pairings to achieve a more efficient and compact signature, which originally targets to zero-knowledge domains. ECDSA Key Generation For an $EC$ of order $n$ with a generator $G$, we can randomize a $Priv$. Based on the discrete logarithm on $EC$, $Pub = Priv*G$. Sign Randomize $r$ and open $R_x=[rG]_x$. With a hash function $H$, open the signature: $$ s = r^{-1}(H(m)+R_xPriv) $$ Verify Collect $(R_x,s)$ and verify the equation: $$ R_x \\overset{?}{=} [s^{-1}(H(m)G+R_xPub)]_x $$ Schnorr (EdDSA) Key Generation For an $EC$ of order $n$ with a generator $G$, we can randomize a $Priv$. Based on the discrete logarithm on $EC$, $Pub = Priv*G$. Sign Randomize $r$ and open $R=rG$. With a hash function $H$, open the signature: $$ s = r + H(R,Pub,m)Priv $$ Verify Collect $(R,s)$ and verify the equation: $$ R \\overset{?}{=} sG - H(R,Pub,m)Pub $$ BLS Key Generation For an $EC$ of $(\\mathbb{G},G)$, and a bilinear pairing function $e: \\mathbb{G} \\times \\mathbb{G} \\rightarrow \\mathbb{G}_T$, we can randomize the $Priv$. Based on the discrete logarithm on $\\mathbb{G}$, $Pub = Priv*G$. Sign With a hash-to-the-curve function $H$, open the signature: $$ s=PrivH(m) $$ Verify Collect $(s,m)$ and verify the equation: $$ e(s,G) \\overset{?}{=} e(Pub,H(m)) $$",
    "date": "2024-08-12T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/contract-factory-the-solidity-pattern-and-facts",
    "title": "Contract Factory: The Solidity Pattern and Facts",
    "image": "",
    "tags": [
      "evm",
      "solidity"
    ],
    "description": "You are a developer, your boss asks you to deploy ERC20 token contract so many times and you're sick of it 🤮. Here is the factory pattern in Solidity to help you deploy contracts by a function call.",
    "content": "Contract Factory: The Solidity Pattern and Facts You are a developer, your boss asks you to deploy ERC20 token contract so many times and you're sick of it 🤮. Here is the factory pattern in Solidity to help you deploy contracts by a function call. Context In this article, we will try to write a Factory.sol contract for the Counter.sol contract below. With normal behaviors, you may deploy this contract manually by a Hardhat script, or Remix. However, let's deploy it through a factory. The factory The factory will store the code of the Counter.sol contract so that we can call a function, deploy for example, to redeploy the code over time. Facts Contract Address That's quite easy, right! Actually, you will realize the problem that \"How can we get the new contract's address?\" Then my preferred method is using event. The event is realtime and permenantly stored in the blockchain history so you can trace it back whenever you want. msg.sender In many contract, we usually assign the contract's owner to msg.sender. However, you must be carefully consider it, because when you deploy the Counter.sol through the Factory.sol, msg.sender will be the facroty contract's address. msg.sender IS NOT THE TRANSACTION SIGNER. IT IS THE FACTORY CONTRACT'S ADDRESS WHEN YOU USE THE FACTORY PATTERN. To fix it, you can migrate msg.sender to tx.origin, which will be the transaction's signer.",
    "date": "2024-08-10T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/data-availability-de-lam-gi",
    "title": "Khả dụng dữ liệu (Data Availability) để làm gì?",
    "image": "/_next/static/media/data-availability.41741e91.png",
    "tags": [
      "evm",
      "layer2",
      "🇻🇳"
    ],
    "description": "Đối với hầu hết các blockchains, các nodes sẽ kiểm tra khả dụng dữ liệu bằng cách tải toàn bộ dữ liệu giao dịch trong một block. Với dữ liệu tải được, những nodes này có thể kiểm tra tính khả dụng cho block đó. Một vài nodes có thể sử dụng phương pháp lấy mẫu, nó sẽ chọn ngẫu nhiên các block để kiểm tra thay vì toàn bộ.",
    "content": "Khả dụng dữ liệu (Data Availability) để làm gì? Đối với hầu hết các blockchains, các nodes sẽ kiểm tra khả dụng dữ liệu bằng cách tải toàn bộ dữ liệu giao dịch trong một block. Với dữ liệu tải được, những nodes này có thể kiểm tra tính khả dụng cho block đó. Một vài nodes có thể sử dụng phương pháp lấy mẫu, nó sẽ chọn ngẫu nhiên các block để kiểm tra thay vì toàn bộ. Data Availability from Celestia. Vấn đề của các blockchain nguyên khối (monolithic) Hiện tại PoW Ethereum, Bitcoin là các blockchain với kiến trúc nguyên khối. Tất cả công việc như thuật toán đồng thuận, kiểm tra khả dụng dữ liệu, thực thi giao dịch, vân vân, sẽ được triển khai trên một lớp (layer) duy nhất. Mỗi node sẽ làm một bản sao về dữ liệu của một node khác. Vì vậy, nó làm gia tăng gánh nặng khi tất cả các nodes phải thực hiện liên tục các công việc trùng lặp như tải dữ liệu, kiểm tra dữ liệu, lưu dữ liệu, phản hồi dữ liệu. Kết quả là tiêu tốn băng thông, làm giảm hiệu suất toàn mạng. Ngoài ra, dữ liệu cho mỗi nodes sẽ tích luỹ rất lớn theo thời gian. Để xử lý, cấu hình phần cứng thường được yêu cầu ở mức cao. Điều này ngăn chặn khả năng tham gia của nhiều thành phần \"yếu thế\" ví dụ như máy tính cá nhân, thiết bị di động, thiết bị nhúng, và từ đó vô tình dẫn đến một sự tập trung có tính kỹ thuật. Ý tưởng về khả dụng dữ liệu Năm 2022, Ethereum chuyển từ Proof-of-Work sang Proof-of-Stake. Lúc này các nodes trên Ethereum chia quá trình vận hành thành hai lớp: lớp thực thi (Execution Layer) và lớp đồng thuận (Consensus Layer). Trong đó, lớp thực thi sẽ thực hiện các thao tác về chọn lựa và khởi tạo dữ liệu block. Các block này sẽ được chấp thuận bởi lớp đồng thuận - là lớp đặt cọc ETH để có quyền tham gia đồng thuận và duy trì tính bền vững của toàn mạng. Kiến trúc này gợi mở một hướng tiếp cận mới về khả năng mở rộng (Scalability) của blockchain. Các khái niệm về kiến trúc modular blockchain bắt đầu bùng nổ và trong đó, khả dụng dữ liệu là một thành tố quan trọng. Blockchain yêu cầu 4 thành tố chính: Thực thi (Execution), Giao ước (Settlement), Đồng thuận (Consensus), và Khả dụng dữ liệu (Data Availability). Khả dụng dữ liệu hoạt động ra sao? Một ví dụ tiêu biểu về cách hoạt động của khả dụng dữ liệu là trong Rollup - Ethereum Layer 2[^1]. Rollup sẽ xử lý các giao dịch trên Layer 2 và đóng gói lại thành những lô giao dịch. Các lô này sẽ được gửi và xác nhận trên mạng chính Ethereum. Về cơ bản, sau khi được Ethereum xác nhận, thì các giao dịch này được xem là hợp lệ và không cần lưu lại. Tuy nhiên, nếu ai đó chứng minh rằng các giao dịch trên Layer 2 và Ethereum không khớp với nhau, kẻ đóng block sai sẽ phải chịu phạt và người phát hiện sẽ được thưởng. Ở đây, ta thấy rằng các dữ liệu của Layer 2 mặc dù là offchain[^2] nhưng vẫn phải khả dụng đối với các thành phần trong mạng để có thể kiểm tra tính đúng đắn của các blocks. Lớp khả dụng dữ liệu chính lúc này sẽ tham gia vào hệ thống nhằm lưu trữ toàn bộ các dữ liệu của Layer 2. Mọi người đều có thể trích xuất dữ liệu từ lớp này để kiểm tra trạng thái toàn mạng. [^1]: Người viết xin giữ nguyên khái niệm này vì chưa tìm được từ tương ứng trong Tiếng Việt. [^2]: Không khả dụng trên mạng Ethereum. https://ethereum2077.substack.com/p/data-availability-in-ethereum-rollups Ai sẽ sẵn sàng chạy lớp khả dụng dữ liệu? Một cách ngắn gọn, mọi người sẽ chạy các node DA nếu họ thấy lợi nhuận. Ví dụ, các Sequencer[^3] sẽ nhận $OP trên mạng Optimism, hoặc $ARB trên mạng Arbitrum. [^3]: Node tổ chức các giao dịch hợp lệ thành lô và lưu trữ toàn bộ lịch sử giao dịch của Layer 2.",
    "date": "2024-08-05T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/a-tidy-role-model-in-scrum",
    "title": "A tidy role model in Scrum",
    "image": "/_next/static/media/scrum-process.eb7fd353.jpg",
    "tags": [
      "agile",
      "mba"
    ],
    "description": "Scrum is an agile method for software development. In this article, we focus on the roles and its scopes in a small team. Vietnamese is available below.",
    "content": "A tidy role model in Scrum Scrum is an agile method for software development. In this article, we focus on the roles and its scopes in a small team. Vietnamese is available below. Scrum Process Product Owner (PO) They can be users, developers, or anyone with ideas to improve the product. They must create an issue ticket to explain the features completely. In a project, we may need one PO. Project Management (PM) Some documents mention them as ScrumMasters They're mastered and able to run the Scrum structure. In addition, they also train new developers to be familiar with Scrum and help them to experience it. In a project, we need one PM. Developers It's a broad concept and SHOULD NOT limit it to just a group of people coding. The developer means coders, designers, marketers, advisors, etc. whoever can consume issue tickets. In a project, we need multiple developers. The great story The PO will generate issue tickets throughout the whole project life. They don't have to follow any iteration but the issue ticket meaning: Title: <Do> <something> Description: As a <user, developer>, I <do> <something> to <occur> <something>. Biweekly, the PM convert the drafts to complete issues by defining the due date, priority, repository, and label at the iteration's beginning on Wednesday. Developers will take and assign themselves to the issues. Developers will estimate the point (we can gamify it by the planning poker) and create a dedicated branch for each issue. Move it to In Process, In Review, and Done accordingly.",
    "date": "2024-07-29T17:00:00.000Z",
    "children": [
      "/blog/a-tidy-role-model-in-scrum/khung-nhan-su-don-gian-cho-scrum"
    ]
  },
  {
    "route": "/blog/a-tidy-role-model-in-scrum/khung-nhan-su-don-gian-cho-scrum",
    "title": "Khung nhân sự cơ bản cho Scrum",
    "image": "/_next/static/media/scrum-process.eb7fd353.jpg",
    "tags": [
      "agile",
      "mba",
      "🇻🇳"
    ],
    "description": "Scrum là một phương pháp agile trong phát triển phần mềm. Trong bài viết này, chúng ta sẽ tập trung vào khung nhân sự và phạm vi hoạt động của các nhân sự đó trong một nhóm nhỏ.",
    "content": "Khung nhân sự cơ bản cho Scrum Scrum là một phương pháp agile trong phát triển phần mềm. Trong bài viết này, chúng ta sẽ tập trung vào khung nhân sự và phạm vi hoạt động của các nhân sự đó trong một nhóm nhỏ. Các chức danh nhân sự được xem như danh từ, vì thế tác giả sẽ không dịch các chức danh này sang từ Tiếng Việt tương ứng. Scrum Process Product Owner (PO) Họ có thể là khách hàng, nhà phát triển, hay bất kỳ ai sở hữu những ý tưởng cải thiện sản phẩm. Họ phải tạo ra được các thẻ nhiệm vụ tương ứng để giải thích tính năng một cách hoàn chỉnh. Trong một dự án, chúng ta có thể có một PO. Project Management (PM) Một vài tài liệu cũng gọi PM là ScrumMaster. Họ buộc phải thành thục và có khả năng vận hành một cấu trúc Scrum. Ngoài ra, họ cũng phải huấn luyện các nhà phát triển mới để quen và làm việc được với Scrum. Trong một dự án, chúng ta cần một PM. Developers Đây là một khái niệm tương đối rộng và không nên giới hạn chỉ cho nhóm lập trình viên. Developer có nghĩa là lập trình viên, nhà thiết kế, chuyên viên tiếp thị, cố vấn viên, và là bất kỳ ai có thể xử lý các thẻ nhiệm vụ. Trong một dự án, chúng ta cần nhiều Developer. Câu chuyện lớn PO sẽ liên tục tạo ra các thẻ nhiệm vụ trong suốt vòng đời của dự án. Họ sẽ không cần tuân theo bất kỳ chu kỳ làm việc nhóm nào mà chỉ cần quan tâm đến ngữ nghĩa của thẻ nhiệm vụ: Tiêu đề: <Do> <something> Mô tả: As a <user, developer>, I <do> <something> to <occur> <something>. Mỗi 2 tuần, PM sẽ hoàn chỉnh các thẻ nhiệm vụ bằng cách định nghĩa các trường như due date, priority, repository, và label vào thứ tư tuần đầu tiên. Developers sẽ là người nhận các thẻ nhiệm vụ và tự gán tên mình vào thẻ đó. Developers sẽ ước chừng số điểm (Chúng ta có thể chơi \"planning poker\" để vui hơn) và tạo một nhánh làm việc riêng cho mỗi thẻ nhiệm vụ. Di chuyển thẻ vào cột In Process, In Review, và Done tương ứng với tiến độ làm việc.",
    "date": "2024-07-29T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/how-to-export-abi-in-hardhat",
    "title": "How to export ABI in Hardhat?",
    "image": "",
    "tags": [
      "evm",
      "hardhat"
    ],
    "description": "This Typescript tutorial is to export the contract ABI by hardhat-abi-exporter in hardhat.config.ts. As the result, you will got an abi folder that contains your ABI.",
    "content": "How to export ABI in Hardhat? This Typescript tutorial is to export the contract ABI by hardhat-abi-exporter in hardhat.config.ts. As the result, you will got an abi folder that contains your ABI. Installation hardhat.config.ts For example, the Counter.sol contract: In the only option, you must write your contracts' name there. The : and $ are regex patterns for the compiler to match your contracts' name. The result On every compilation, the abi generator will rerun automatically. The abi/Counter.json: Under the Hood Let's say we modify the contract file Counter.sol Then the compiler will generate 2 artifacts Counter.sol:FirstCounter and Counter.sol:SecondCounter. From that, you can optionally generate your desired contract ABI. For example, only: [':FirstCounter$'], or only: [':SecondCounter$'], or even both contracts only: [':FirstCounter$', ':SecondCounter$'].",
    "date": "2024-07-21T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/the-elements-of-style",
    "title": "The Elements of Style",
    "image": "",
    "tags": [
      "book",
      "mba"
    ],
    "description": "William Strunk",
    "content": "The Elements of Style William Strunk Foreword The first writer I watched at work was my stepfather, E. B. White. Each Tuesday morning, he would close his study door and sit down to write the “Notes and Comment” page for The New Yorker. The task was familiar to him — he was required to file a few hundred words of editorial or personal commentary on some topic in or out of the news that week — but the sounds of his typewriter from his room came in hesitant bursts, with long silences in between. Hours went by. Summoned at last for lunch, he was silent and preoccupied, and soon excused himself to get back to the job. When the copy went off at last, in the afternoon RFD pouch — we were in Maine, a day’s mail away from New York — he rarely seemed satisfied. “It isn’t good enough,” he said sometimes. “I wish it were better.” Writing is hard, even for authors who do it all the time. Less frequent practitioners — the job applicant; the business executive with an annual report to get out; the high school senior with a Faulkner assignment; the graduate-school student with her thesis proposal; the writer of a letter of condolence — often get stuck in an awkward passage or find a muddle on their screens, and then blame themselves. What should be easy and flowing looks tangled or feeble or overblown — not what was meant at all. What’s wrong with me, each one thinks. Why can’t I get this right? It was this recurring question, put to himself, that must have inspired White to revive and add to a textbook by an English professor of his, Will Strunk Jr., that he had first read in college, and to get it published. The result, this quiet book, has been in print for forty years, and has offered more than ten million writers a helping hand. White knew that a compendium of specific tips — about singular and plural verbs, parentheses, the “that” — “which” scuffle, and many others — could clear up a recalcitrant sentence or subclause when quickly reconsulted, and that the larger principles needed to be kept in plain sight, like a wall sampler. How simple they look, set down here in White’s last chapter: “Write in a way that comes naturally,” “Revise and rewrite,” “Do not explain too much,” and the rest; above all, the cleansing, clarion “Be clear.” How often I have turned to them, in the book or in my mind, while trying to start or unblock or revise some piece of my own writing! They help — they really do. They work. They are the way. E. B. White’s prose is celebrated for its ease and clarity — just think of Charlotte’s Web — but maintaining this standard required endless attention. When the new issue of The New Yorker turned up in Maine, I sometimes saw him reading his “Comment” piece over to himself, with only a slightly different expression than the one he’d worn on the day it went off. Well, O.K., he seemed to be saying. At least I got the elements right. This edition has been modestly updated, with word processors and air conditioners making their first appearance among White’s references, and with a light redistribution of genders to permit a feminine pronoun or female farmer to take their places among the males who once innocently served him. Sylvia Plath has knocked Keats out of the box, and I notice that “America” has become “this country” in a sample text, to forestall a subsequent and possibly demeaning “she” in the same paragraph. What is not here is anything about E-mail — the rules-free, lower-case flow that cheerfully keeps us in touch these days. E-mail is conversation, and it may be replacing the sweet and endless talking we once sustained (and tucked away) within the informal letter. But we are all writers and readers as well as communicators, with the need at times to please and satisfy ourselves (as White put it) with the clear and almost perfect thought. Roger Angell Introduction At the close of the first World War, when I was a student at Cornell, I took a course called English 8. My professor was William Strunk Jr. A textbook required for the course was a slim volume called The Elements of Style, whose author was the professor himself. The year was 1919. The book was known on the campus in those days as “the little book,” with the stress on the word “little.” It had been privately printed by the author. I passed the course, graduated from the university, and forgot the book but not the professor. Some thirty-eight years later, the book bobbed up again in my life when Macmillan commissioned me to revise it for the college market and the general trade. Meantime, Professor Strunk had died. The Elements of Style, when I reexamined it in 1957, seemed to me to contain rich deposits of gold. It was Will Strunk’s parvum opus, his attempt to cut the vast tangle of English rhetoric down to size and write its rules and principles on the head of a pin. Will himself had hung the tag “little” on the book; he referred to it sardonically and with secret pride as “the little book,” always giving the word “little” a special twist, as though he were putting a spin on a ball. In its original form, it was a forty-three page summation of the case for cleanliness, accuracy, and brevity in the use of English. Today, fifty-two years later, its vigor is unimpaired, and for sheer pith I think it probably sets a record that is not likely to be broken. Even after I got through tampering with it, it was still a tiny thing, a barely tarnished gem. Seven rules of usage, eleven principles of composition, a few matters of form, and a list of words and expressions commonly misused — that was the sum and substance of Professor Strunk’s work. Somewhat audaciously, and in an attempt to give my publisher his money’s worth, I added a chapter called “An Approach to Style,” setting forth my own prejudices, my notions of error, my articles of faith. This chapter (Chapter V) is addressed particularly to those who feel that English prose composition is not only a necessary skill but a sensible pursuit as well — a way to spend one’s days. I think Professor Strunk would not object to that. A second edition of the book was published in 1972. I have now completed a third revision. Chapter IV has been refurbished with words and expressions of a recent vintage; four rules of usage have been added to Chapter I. Fresh examples have been added to some of the rules and principles, amplification has reared its head in a few places in the text where I felt an assault could successfully be made on the bastions of its brevity, and in general the book has received a thorough overhaul — to correct errors, delete bewhiskered entries, and enliven the argument. Professor Strunk was a positive man. His book contains rules of grammar phrased as direct orders. In the main I have not tried to soften his commands, or modify his pronouncements, or remove the special objects of his scorn. I have tried, instead, to preserve the flavor of his discontent while slightly enlarging the scope of the discussion. The Elements of Style does not pretend to survey the whole field. Rather it proposes to give in brief space the principal requirements of plain English style. It concentrates on fundamentals: the rules of usage and principles of composition most commonly violated. The reader will soon discover that these rules and principles are in the form of sharp commands, Sergeant Strunk snapping orders to his platoon. “Do not join independent clauses with a comma.” (Rule 5.) “Do not break sentences in two.” (Rule 6.) “Use the active voice.” (Rule 14.) “Omit needless words.” (Rule 17.) “Avoid a succession of loose sentences.” (Rule 18.) “In summaries, keep to one tense.” (Rule 21.) Each rule or principle is followed by a short hortatory essay, and usually the exhortation is followed by, or interlarded with, examples in parallel columns — the true vs. the false, the right vs. the wrong, the timid vs. the bold, the ragged vs. the trim. From every line there peers out at me the puckish face of my professor, his short hair parted neatly in the middle and combed down over his forehead, his eyes blinking incessantly behind steel-rimmed spectacles as though he had just emerged into strong light, his lips nibbling each other like nervous horses, his smile shuttling to and fro under a carefully edged mustache. “Omit needless words!” cries the author on page 23, and into that imperative Will Strunk really put his heart and soul. In the days when I was sitting in his class, he omitted so many needless words, and omitted them so forcibly and with such eagerness and obvious relish, that he often seemed in the position of having shortchanged himself — a man left with nothing more to say yet with time to fill, a radio prophet who had out-distanced the clock. Will Strunk got out of this predicament by a simple trick: he uttered every sentence three times. When he delivered his oration on brevity to the class, he leaned forward over his desk, grasped his coat lapels in his hands, and, in a husky, conspiratorial voice, said, “Rule Seventeen. Omit needless words! Omit needless words! Omit needless words!” He was a memorable man, friendly and funny. Under the remembered sting of his kindly lash, I have been trying to omit needless words since 1919, and although there are still many words that cry for omission and the huge task will never be accomplished, it is exciting to me to reread the masterly Strunkian elaboration of this noble theme. It goes: Vigorous writing is concise. A sentence should contain no unnecessary words, a paragraph no unnecessary sentences, for the same reason that a drawing should have no unnecessary lines and a machine no unnecessary parts. This requires not that the writer make all sentences short or avoid all detail and treat subjects only in outline, but that every word tell. There you have a short, valuable essay on the nature and beauty of brevity — fifty-nine words that could change the world. Having recovered from his adventure in prolixity (fifty-nine words were a lot of words in the tight world of William Strunk Jr.), the professor proceeds to give a few quick lessons in pruning. Students learn to cut the dead-wood from “this is a subject that,” reducing it to “this subject,” a saving of three words. They learn to trim “used for fuel purposes” down to “used for fuel.” They learn that they are being chatterboxes when they say “the question as to whether” and that they should just say “whether” — a saving of four words out of a possible five. The professor devotes a special paragraph to the vile expression the fact that, a phrase that causes him to quiver with revulsion. The expression, he says, should be “revised out of every sentence in which it occurs.” But a shadow of gloom seems to hang over the page, and you feel that he knows how hopeless his cause is. I suppose I have written the fact that a thousand times in the heat of composition, revised it out maybe five hundred times in the cool aftermath. To be batting only .500 this late in the season, to fail half the time to connect with this fat pitch, saddens me, for it seems a betrayal of the man who showed me how to swing at it and made the swinging seem worthwhile. I treasure The Elements of Style for its sharp advice, but I treasure it even more for the audacity and self-confidence of its author. Will knew where he stood. He was so sure of where he stood, and made his position so clear and so plausible, that his peculiar stance has continued to invigorate me — and, I am sure, thousands of other ex-students — during the years that have intervened since our first encounter. He had a number of likes and dislikes that were almost as whimsical as the choice of a necktie, yet he made them seem utterly convincing. He disliked the word forceful and advised us to use forcible instead. He felt that the word clever was greatly overused: “It is best restricted to ingenuity displayed in small matters.” He despised the expression student body, which he termed gruesome, and made a special trip downtown to the Alumni News office one day to protest the expression and suggest that studentry be substituted — a coinage of his own, which he felt was similar to citizenry. I am told that the News editor was so charmed by the visit, if not by the word, that he ordered the student body buried, never to rise again. Studentry has taken its place. It’s not much of an improvement, but it does sound less cadaverous, and it made Will Strunk quite happy. Some years ago, when the heir to the throne of England was a child, I noticed a headline in the Times about Bonnie Prince Charlie: “CHARLES’ TONSILS OUT.” Immediately Rule 1 leapt to mind. Form the possessive singular of nouns by adding ‘s. Follow this rule whatever the final consonant. Thus write, Charles’s friendBurns’s poemsthe witch’s malice Clearly, Will Strunk had foreseen, as far back as 1918, the dangerous tonsillectomy of a prince, in which the surgeon removes the tonsils and the Times copy desk removes the final s. He started his book with it. I commend Rule 1 to the Times, and I trust that Charles’s throat, not Charles’ throat, is in fine shape today. Style rules of this sort are, of course, somewhat a matter of individual preference, and even the established rules of grammar are open to challenge. Professor Strunk, although one of the most inflexible and choosy of men, was quick to acknowledge the fallacy of inflexibility and the danger of doctrine. “It is an old observation,” he wrote, “that the best writers sometimes disregard the rules of rhetoric. When they do so, however, the reader will usually find in the sentence some compensating merit, attained at the cost of the violation. Unless he is certain of doing as well, he will probably do best to follow the rules.” It is encouraging to see how perfectly a book, even a dusty rule book, perpetuates and extends the spirit of a man. Will Strunk loved the clear, the brief, the bold, and his book is clear, brief, bold. Boldness is perhaps its chief distinguishing mark. On page 26, explaining one of his parallels, he says, “The lefthand version gives the impression that the writer is undecided or timid, apparently unable or afraid to choose one form of expression and hold to it.” And his original Rule 11 was “Make definite assertions.” That was Will all over. He scorned the vague, the tame, the colorless, the irresolute. He felt it was worse to be irresolute than to be wrong. I remember a day in class when he leaned far forward, in his characteristic pose — the pose of a man about to impart a secret — and croaked, “If you don’t know how to pronounce a word, say it loud! If you don’t know how to pronounce a word, say it loud!” This comical piece of advice struck me as sound at the time, and I still respect it. Why compound ignorance with inaudibility? Why run and hide? All through The Elements of Style one finds evidences of the author’s deep sympathy for the reader. Will felt that the reader was in serious trouble most of the time, floundering in a swamp, and that it was the duty of anyone attempting to write English to drain this swamp quickly and get the reader up on dry ground, or at least to throw a rope. In revising the text, I have tried to hold steadily in mind this belief of his, this concern for the bewildered reader. In the English classes of today, “the little book” is surrounded by longer, lower textbooks — books with permissive steering and automatic transitions. Perhaps the book has become something of a curiosity. To me, it still seems to maintain its original poise, standing, in a drafty time, erect, resolute, and assured. I still find the Strunkian wisdom a comfort, the Strunkian humor a delight, and the Strunkian attitude toward right-and- wrong a blessing undisguised. E. B. White",
    "date": "2024-07-12T17:00:00.000Z",
    "children": [
      "/blog/the-elements-of-style/glossary",
      "/blog/the-elements-of-style/afterword",
      "/blog/the-elements-of-style/chapter-5-an-approach-to-style-with-a-list-of-reminders",
      "/blog/the-elements-of-style/chapter-4-words-and-expressions-commonly-misused",
      "/blog/the-elements-of-style/chapter-3-a-few-matters-of-form",
      "/blog/the-elements-of-style/chapter-2-elementary-principles-of-composition",
      "/blog/the-elements-of-style/chapter-1-elementary-rules-of-usage"
    ]
  },
  {
    "route": "/blog/the-elements-of-style/glossary",
    "title": "Glossary",
    "image": "",
    "tags": [
      "book",
      "mba"
    ],
    "description": "adjectival modifier A word, phrase, or clause that acts as an adjective in qualifying the meaning of a noun or pronoun, Your country; a turn-of-the-century style; people who are always late.",
    "content": "Glossary adjectival modifier A word, phrase, or clause that acts as an adjective in qualifying the meaning of a noun or pronoun, Your country; a turn-of-the-century style; people who are always late. adjective A word that modifies, quantifies, or otherwise describes a noun or pronoun. Drizzly November; midnight dreary; only requirement. adverb A word that modifies or otherwise qualifies a verb, an adjective, or another adverb. Gestures gracefully; exceptionally quiet engine. adverbial phrase A phrase that functions as an adverb. (See phrase.) Landon laughs with abandon. agreement The correspondence of a verb with its subject in person and number (Karen goes to Cal Tech; her sisters go to UCLA), and of a pronoun with its antecedent in person, number, and gender (As soon as Karen finished the exam, she picked up her books and left the room). antecedent The noun to which a pronoun refers. A pronoun and its antecedent must agree in person, number, and gender. Michael and his teammates moved off campus. appositive A noun or noun phrase that renames or adds identifying information to a noun it immediately follows. His brother, an accountant with Arthur Andersen, was recently promoted. articles The words a, an, and the, which signal or introduce nouns. The definite article the refers to a particular item: the report. The indefinite articles a and an refer to a general item or one not already mentioned: an apple. auxiliary verb A verb that combines with the main verb to show differences in tense, person, and voice. The most common auxiliaries are forms of be, do, and have. I am going; we did not go; they have gone. (See also modal auxiliaries. ) case The form of a noun or pronoun that reflects its grammatical function in a sentence as subject (they), object (them), or possessor (their). She gave her employees a raise that pleased them greatly. clause A group of related words that contains a subject and predicate. Moths swarm around a burning candle. While she was taking the test, Karen muttered to herself. colloquialism A word or expression appropriate to informal conversation but not usually suitable for academic or business writing. They wanted to get even (instead of they wanted to retaliate). complement A word or phrase (especially a noun or adjective) that completes the predicate. Subject complements complete linking verbs and rename or describe the subject: Martha is my neighbor. She seems shy. Object complements complete transitive verbs by describing or renaming the direct object: They found the play exciting. Robert considers Mary a wonderful wife. compound sentence Two or more independent clauses joined by a coordinating conjunction, a correlative conjunction, or a semicolon. Caesar conquered Gaul, but Alexander the Great conquered the world. compound subject Two or more simple subjects joined by a coordinating or correlative conjunction. Hemingway and Fitzgerald had little in common. conjunction A word that joins words, phrases, clauses, or sentences. The coordinating conjunctions, and, but, or, nor, yet, so, for, join grammatically equivalent elements. Correlative conjunctions ( both, and; either, or; neither, nor) join the same kinds of elements. contraction A shortened form of a word or group of words: can’t for cannot; they’re for they are. correlative expression See conjunction. dependent clause A group of words that includes a subject and verb but is subordinate to an independent clause in a sentence. Dependent clauses begin with either a subordinating conjunction, such as if, because, since, or a relative pronoun, such as who, which, that. When it gets dark, we’ll find a restaurant that has music. direct object A noun or pronoun that receives the action of a transitive verb. Pearson publishes books. gerund The -ing form of a verb that functions as a noun: Hiking is good exercise. She was praised for her playing. indefinite pronoun A pronoun that refers to an unspecified person (anybody) or thing (something). independent clause A group of words with a subject and verb that can stand alone as a sentence. Raccoons steal food. indirect object A noun or pronoun that indicates to whom or for whom, to what or for what the action of a transitive verb is performed. I asked her a question. Ed gave the door a kick. infinitive/split infinitive In the present tense, a verb phrase consisting of to followed by the base form of the verb (to write). A split infinitive occurs when one or more words separate to and the verb (to boldly go). intransitive verb A verb that does not take a direct object. His nerve failed. linking verb A verb that joins the subject of a sentence to its complement. Professor Chapman is a philosophy teacher. They were ecstatic. loose sentence A sentence that begins with the main idea and then attaches modifiers, qualifiers, and additional details: He was determined to succeed, with or without the promotion he was hoping for and in spite of the difficulties he was confronting at every turn. main clause An independent clause, which can stand alone as a grammatically complete sentence. Grammarians quibble. modal auxiliaries Any of the verbs that combine with the main verb to express necessity (must), obligation (should), permission (may), probability (might), possibility (could), ability (can), or tentativeness (would). Mary might wash the car. modifier A word or phrase that qualifies, describes, or limits the meaning of a word, phrase, or clause. Frayed ribbon, dancing flowers, worldly wisdom. nominative pronoun A pronoun that functions as a subject or a subject complement: I, we, you, he, she, it, they, who. nonrestrictive modifier A phrase or clause that does not limit or restrict the essential meaning of the element it modifies. My youngest niece, who lives in Ann Arbor, is a magazine editor. noun A word that names a person, place, thing, or idea. Most nouns have a plural form and a possessive form. Carol; the park; the cup; democracy. number A feature of nouns, pronouns, and a few verbs, referring to singular or plural. A subject and its corresponding verb must be consistent in number; a pronoun should agree in number with its antecedent. A solo flute plays; two oboes join in. object The noun or pronoun that completes a prepositional phrase or the meaning of a transitive verb. (See also direct object, indirect object, and preposition.) Frost offered his audience a poetic performance they would likely never forget. participial phrase A present or past participle with accompanying modifiers, objects, or complements. The buzzards, circling with sinister determination, squawked loudly. participle A verbal that functions as an adjective. Present participles end in -ing (brimming); past participles typically end in -d or -ed (injured) or -en (broken) but may appear in other forms (brought, been, gone). periodic sentence A sentence that expresses the main idea at the end. With or without their parents’ consent, and whether or not they receive the assignment relocation they requested, they are determined to get married. phrase A group of related words that functions as a unit but lacks a subject, a verb, or both. Without the resources to continue. possessive The case of nouns and pronouns that indicates ownership or possession (Harold’s, ours, mine). predicate The verb and its related words in a clause or sentence. The predicate expresses what the subject does, experiences, or is. Birds fly. The partygoers celebrated wildly for a long time. preposition A word that relates its object (a noun, pronoun, or -ing verb form) to another word in the sentence. She is the leader of our group. We opened the door by picking the lock. She went out the window. prepositional phrase A group of words consisting of a preposition, its object, and any of the object’s modifiers. Georgia on my mind. principal verb The predicating verb in a main clause or sentence. pronominal possessive Possessive pronouns such as hers, its, and theirs. proper noun The name of a particular person (Frank Sinatra), place (Boston), or thing (Moby Dick). Proper nouns are capitalized. Common nouns name classes of people (singers), places (cities), or things (books) and are not capitalized. relative clause A clause introduced by a relative pronoun, such as who, which, that, or by a relative adverb, such as where, when, why. relative pronoun A pronoun that connects a dependent clause to a main clause in a sentence: who, whom, whose, which, that, what, whoever, whomever, whichever, and whatever. restrictive term, element, clause A phrase or clause that limits the essential meaning of the sentence element it modifies or identifies. Professional athletes who perform exceptionally should earn stratospheric salaries. Since there are no commas before and after the italicized clause, the italicized clause is restrictive and suggests that only those athletes who perform exceptionally are entitled to such salaries. If commas were added before who and after exceptionally, the clause would be nonrestrictive and would suggest that all professional athletes should receive stratospheric salaries. sentence fragment A group of words that is not grammatically a complete sentence but is punctuated as one: Because it mattered greatly. subject The noun or pronoun that indicates what a sentence is about, and which the principal verb of a sentence elaborates. The new Steven Spielberg movie is a box office hit. subordinate clause A clause dependent on the main clause in a sentence. After we finish our work, we will go out for dinner. syntax The order or arrangement of words in a sentence. Syntax may exhibit parallelism (I came, I saw, I conquered), inversion ( Whose woods these are I think I know), or other formal characteristics. tense The time of a verb’s action or state of being, such as past, present, or future. Saw, see, will see. transition A word or group of words that aids coherence in writing by showing the connections between ideas. William Carlos Williams was influenced by the poetry of Walt Whitman. Moreover, Williams’s emphasis on the present and the immediacy of the ordinary represented a rejection of the poetic stance and style of his contemporary T. S. Eliot. In addition, Williams’s poetry .... transitive verb A verb that requires a direct object to complete its meaning: They washed their new car. An intransitive verb does not require an object to complete its meaning: The audience laughed. Many verbs can be both: The wind blew furiously. My car blew a gasket. verb A word or group of words that expresses the action or indicates the state of being of the subject. Verbs activate sentences. verbal A verb form that functions in a sentence as a noun, an adjective, or an adverb rather than as a principal verb. Thinking can be fun. An embroidered handkerchief. (See also gerund, infinitive, and participle.) voice The attribute of a verb that indicates whether its subject is active (Janet played the guitar) or passive (The guitar was played by Janet).",
    "date": "2024-07-17T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/the-elements-of-style/afterword",
    "title": "Afterword",
    "image": "",
    "tags": [
      "book",
      "mba"
    ],
    "description": "Will Strunk and E. B. White were unique collaborators. Unlike Gilbert and Sullivan, or Woodward and Bernstein, they worked separately and decades apart.",
    "content": "Afterword Will Strunk and E. B. White were unique collaborators. Unlike Gilbert and Sullivan, or Woodward and Bernstein, they worked separately and decades apart. We have no way of knowing whether Professor Strunk took particular notice of Elwyn Brooks White, a student of his at Cornell University in 1919. Neither teacher nor pupil could have realized that their names would be linked as they now are. Nor could they have imagined that thirty-eight years after they met, White would take this little gem of a textbook that Strunk had written for his students, polish it, expand it, and transform it into a classic. E. B. White shared Strunk’s sympathy for the reader. To Strunk’s do’s and don’ts he added passages about the power of words and the clear expression of thoughts and feelings. To the nuts and bolts of grammar he added a rhetorical dimension. The editors of this edition have followed in White’s footsteps, once again providing fresh examples and modernizing usage where appropriate. The Elements of Style is still a little book, small enough and important enough to carry in your pocket, as I carry mine. It has helped me to write better. I believe it can do the same for you. Charles Osgood",
    "date": "2024-07-16T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/the-elements-of-style/chapter-5-an-approach-to-style-with-a-list-of-reminders",
    "title": "Chapter 5 — An Approach to Style (With a List of Reminders)",
    "image": "",
    "tags": [
      "book",
      "mba"
    ],
    "description": "Up to this point, the book has been concerned with what is correct, or acceptable, in the use of English. In this final chapter, we approach style in its broader meaning: style in the sense of what is distinguished and distinguishing. Here we leave solid ground. Who can confidently say what ignites a certain combination of words, causing them to explode in the mind? Who knows why certain notes in music are capable of stirring the listener deeply, though the same notes slightly rearranged are impotent? These are high mysteries, and this chapter is a mystery story, thinly disguised. There is no satisfactory explanation of style, no infallible guide to good writing, no assurance that a person who thinks clearly will be able to write clearly, no key that unlocks the door, no inflexible rule by which writers may shape their course. Writers will often find themselves steering by stars that are disturbingly in motion.",
    "content": "Chapter 5 — An Approach to Style (With a List of Reminders) Up to this point, the book has been concerned with what is correct, or acceptable, in the use of English. In this final chapter, we approach style in its broader meaning: style in the sense of what is distinguished and distinguishing. Here we leave solid ground. Who can confidently say what ignites a certain combination of words, causing them to explode in the mind? Who knows why certain notes in music are capable of stirring the listener deeply, though the same notes slightly rearranged are impotent? These are high mysteries, and this chapter is a mystery story, thinly disguised. There is no satisfactory explanation of style, no infallible guide to good writing, no assurance that a person who thinks clearly will be able to write clearly, no key that unlocks the door, no inflexible rule by which writers may shape their course. Writers will often find themselves steering by stars that are disturbingly in motion. The preceding chapters contain instructions drawn from established English usage; this one contains advice drawn from a writer’s experience of writing. Since the book is a rule book, these cautionary remarks, these subtly dangerous hints, are presented in the form of rules, but they are, in essence, mere gentle reminders: they state what most of us know and at times forget. Style is an increment in writing. When we speak of Fitzgerald’s style, we don’t mean his command of the relative pronoun, we mean the sound his words make on paper. All writers, by the way they use the language, reveal something of their spirits, their habits, their capacities, and their biases. This is inevitable as well as enjoyable. All writing is communication; creative writing is communication through revelation — it is the Self escaping into the open. No writer long remains incognito. If you doubt that style is something of a mystery, try rewriting a familiar sentence and see what happens. Any much-quoted sentence will do. Suppose we take “These are the times that try men’s souls.” Here we have eight short, easy words, forming a simple declarative sentence. The sentence contains no flashy ingredient such as “Damn the torpedoes!” and the words, as you see, are ordinary. Yet in that arrangement, they have shown great durability; the sentence is into its third century. Now compare a few variations: Times like these try men’s souls.How trying it is to live in these times!These are trying times for men’s souls.Soulwise, these are trying times. It seems unlikely that Thomas Paine could have made his sentiment stick if he had couched it in any of these forms. But why not? No fault of grammar can be detected in them, and in every case the meaning is clear. Each version is correct, and each, for some reason that we can’t readily put our finger on, is marked for oblivion. We could, of course, talk about “rhythm” and “cadence,” but the talk would be vague and unconvincing. We could declare soulwise to be a silly word, inappropriate to the occasion; but even that won’t do — it does not answer the main question. Are we even sure soulwise is silly? If otherwise is a serviceable word, what’s the matter with soulwise? Here is another sentence, this one by a later Tom. It is not a famous sentence, although its author (Thomas Wolfe) is well known. “Quick are the mouths of earth, and quick the teeth that fed upon this loveliness.” The sentence would not take a prize for clarity, and rhetorically it is at the opposite pole from “These are the times.” Try it in a different form, without the inversions: The mouths of earth are quick, and the teeth that fed upon this loveliness are quick, too. The author’s meaning is still intact, but not his overpowering emotion. What was poetical and sensuous has become prosy and wooden; instead of the secret sounds of beauty, we are left with the simple crunch of mastication. (Whether Mr. Wolfe was guilty of overwriting is, of course, another question — one that is not pertinent here.) With some writers, style not only reveals the spirit of the man but reveals his identity, as surely as would his fingerprints. Here, following, are two brief passages from the works of two American novelists. The subject in each case is languor. In both, the words used are ordinary, and there is nothing eccentric about the construction. He did not still feel weak, he was merely luxuriating in that supremely gutful lassitude of convalescence in which time, hurry, doing, did not exist, the accumulating seconds and minutes and hours to which in its well state the body is slave both waking and sleeping, now reversed and time now the lip-server and mendicant to the body’s pleasure instead of the body thrall to time’s headlong course.Manuel drank his brandy. He felt sleepy himself. It was too hot to go out into the town. Besides there was nothing to do. He wanted to see Zurito. He would go to sleep while he waited. Anyone acquainted with Faulkner and Hemingway will have recognized them in these passages and perceived which was which. How different are their languors! Or take two American poets, stopping at evening. One stops by woods, the other by laughing flesh. My little horse must think it queerTo stop without a farmhouse nearBetween the woods and frozen lakeThe darkest evening of the year.I have perceived that to be with those I like is enough,To stop in company with the rest at evening is enough,To be surrounded by beautiful, curious, breathing,laughing flesh is enough... Because of the characteristic styles, there is little question about identity here, and if the situations were reversed, with Whitman stopping by woods and Frost by laughing flesh (not one of his regularly scheduled stops), the reader would know who was who. Young writers often suppose that style is a garnish for the meat of prose, a sauce by which a dull dish is made palatable. Style has no such separate entity; it is nondetachable, unfilterable. The beginner should approach style warily, realizing that it is an expression of self, and should turn resolutely away from all devices that are popularly believed to indicate style — all mannerisms, tricks, adornments. The approach to style is by way of plainness, simplicity, orderliness, sincerity. Writing is, for most, laborious and slow. The mind travels faster than the pen; consequently, writing becomes a question of learning to make occasional wing shots, bringing down the bird of thought as it flashes by. A writer is a gunner, sometimes waiting in the blind for something to come in, sometimes roaming the countryside hoping to scare something up. Like other gunners, the writer must cultivate patience, working many covers to bring down one partridge. Here, following, are some suggestions and cautionary hints that may help the beginner find the way to a satisfactory style. 1. Place yourself in the background. Write in a way that draws the reader’s attention to the sense and substance of the writing, rather than to the mood and temper of the author. If the writing is solid and good, the mood and temper of the writer will eventually be revealed and not at the expense of the work. Therefore, the first piece of advice is this: to achieve style, begin by affecting none — that is, place yourself in the background. A careful and honest writer does not need to worry about style. As you become proficient in the use of language, your style will emerge, because you yourself will emerge, and when this happens you will find it increasingly easy to break through the barriers that separate you from other minds, other hearts — which is, of course, the purpose of writing, as well as its principal reward. Fortunately, the act of composition, or creation, disciplines the mind; writing is one way to go about thinking, and the practice and habit of writing not only drain the mind but supply it, too. 2. Write in a way that comes naturally. Write in a way that comes easily and naturally to you, using words and phrases that come readily to hand. But do not assume that because you have acted naturally your product is without flaw. The use of language begins with imitation. The infant imitates the sounds made by its parents; the child imitates first the spoken language, then the stuff of books. The imitative life continues long after the writer is secure in the language, for it is almost impossible to avoid imitating what one admires. Never imitate consciously, but do not worry about being an imitator; take pains instead to admire what is good. Then when you write in a way that comes naturally, you will echo the halloos that bear repeating. 3. Work from a suitable design. Before beginning to compose something, gauge the nature and extent of the enterprise and work from a suitable design. (See Chapter II, Rule 12.) Design informs even the simplest structure, whether of brick and steel or of prose. You raise a pup tent from one sort of vision, a cathedral from another. This does not mean that you must sit with a blueprint always in front of you, merely that you had best anticipate what you are getting into. To compose a laundry list, you can work directly from the pile of soiled garments, ticking them off one by one. But to write a biography, you will need at least a rough scheme; you cannot plunge in blindly and start ticking off fact after fact about your subject, lest you miss the forest for the trees and there be no end to your labors. Sometimes, of course, impulse and emotion are more compelling than design. If you are deeply troubled and are composing a letter appealing for mercy or for love, you had best not attempt to organize your emotions; the prose will have a better chance if the emotions are left in disarray — which you’ll probably have to do anyway, since feelings do not usually lend themselves to rearrangement. But even the kind of writing that is essentially adventurous and impetuous will on examination be found to have a secret plan: Columbus didn’t just sail, he sailed west, and the New World took shape from this simple and, we now think, sensible design. 4. Write with nouns and verbs. Write with nouns and verbs, not with adjectives and adverbs. The adjective hasn’t been built that can pull a weak or inaccurate noun out of a tight place. This is not to disparage adjectives and adverbs; they are indispensable parts of speech. Occasionally they surprise us with their power, as in Up the airy mountain,Down the rushy glen,We daren’t go a-huntingFor fear of little men... The nouns mountain and glen are accurate enough, but had the mountain not become airy, the glen rushy, William Ailing-ham might never have got off the ground with his poem. In general, however, it is nouns and verbs, not their assistants, that give good writing its toughness and color. 5. Revise and rewrite. Revising is part of writing. Few writers are so expert that they can produce what they are after on the first try. Quite often you will discover, on examining the completed work, that there are serious flaws in the arrangement of the material, calling for transpositions. When this is the case, a word processor can save you time and labor as you rearrange the manuscript. You can select material on your screen and move it to a more appropriate spot, or, if you cannot find the right spot, you can move the material to the end of the manuscript until you decide whether to delete it. Some writers find that working with a printed copy of the manuscript helps them to visualize the process of change; others prefer to revise entirely on screen. Above all, do not be afraid to experiment with what you have written. Save both the original and the revised versions; you can always use the computer to restore the manuscript to its original condition, should that course seem best. Remember, it is no sign of weakness or defeat that your manuscript ends up in need of major surgery. This is a common occurrence in all writing, and among the best writers. 6. Do not overwrite. Rich, ornate prose is hard to digest, generally unwholesome, and sometimes nauseating. If the sickly-sweet word, the overblown phrase are your natural form of expression, as is sometimes the case, you will have to compensate for it by a show of vigor, and by writing something as meritorious as the Song of Songs, which is Solomon’s. When writing with a computer, you must guard against wordiness. The click and flow of a word processor can be seductive, and you may find yourself adding a few unnecessary words or even a whole passage just to experience the pleasure of running your fingers over the keyboard and watching your words appear on the screen. It is always a good idea to reread your writing later and ruthlessly delete the excess. 7. Do not overstate. When you overstate, readers will be instantly on guard, and everything that has preceded your overstatement as well as everything that follows it will be suspect in their minds because they have lost confidence in your judgment or your poise. Overstatement is one of the common faults. A single overstatement, wherever or however it occurs, diminishes the whole, and a single carefree superlative has the power to destroy, for readers, the object of your enthusiasm. 8. Avoid the use of qualifiers. Rather, very, little, pretty — these are the leeches that infest the pond of prose, sucking the blood of words. The constant use of the adjective little (except to indicate size) is particularly debilitating; we should all try to do a little better, we should all be very watchful of this rule, for it is a rather important one, and we are pretty sure to violate it now and then. 9. Do not affect a breezy manner. The volume of writing is enormous, these days, and much of it has a sort of windiness about it, almost as though the author were in a state of euphoria. “Spontaneous me,” sang Whitman, and, in his innocence, let loose the hordes of uninspired scribblers who would one day confuse spontaneity with genius. The breezy style is often the work of an egocentric, the person who imagines that everything that comes to mind is of general interest and that uninhibited prose creates high spirits and carries the day. Open any alumni magazine, turn to the class notes, and you are quite likely to encounter old Spontaneous Me at work — an aging collegian who writes something like this: Well, guys, here I am again dishing the dirt about your disorderly classmates, after passing a weekend in the Big Apple trying to catch the Columbia hoops tilt and then a cab-ride from hell through the West Side casbah. And speaking of news, howzabout tossing a few primo items this way? This is an extreme example, but the same wind blows, at lesser velocities, across vast expanses of journalistic prose. The author in this case has managed in two sentences to commit most of the unpardonable sins: he obviously has nothing to say, he is showing off and directing the attention of the reader to himself, he is using slang with neither provocation nor ingenuity, he adopts a patronizing air by throwing in the word primo, he is humorless (though full of fun), dull, and empty. He has not done his work. Compare his opening remarks with the following — a plunge directly into the news: Clyde Crawford, who stroked the varsity shell in 1958, is swinging an oar again after a lapse of forty years. Clyde resigned last spring as executive sales manager of the Indiana Flotex Company and is now a gondolier in Venice. This, although conventional, is compact, informative, unpretentious. The writer has dug up an item of news and presented it in a straightforward manner. What the first writer tried to accomplish by cutting rhetorical capers and by breeziness, the second writer managed to achieve by good reporting, by keeping a tight rein on his material, and by staying out of the act. 10. Use orthodox spelling. In ordinary composition, use orthodox spelling. Do not write nite for night, thru for through, pleez for please, unless you plan to introduce a complete system of simplified spelling and are prepared to take the consequences. In the original edition of The Elements of Style, there was a chapter on spelling. In it, the author had this to say: The spelling of English words is not fixed and invariable, nor does it depend on any other authority than general agreement. At the present day there is practically unanimous agreement as to the spelling of most words.... At any given moment, however, a relatively small number of words may be spelled in more than one way. Gradually, as a rule, one of these forms comes to be generally preferred, and the less customary form comes to look obsolete and is discarded. From time to time new forms, mostly simplifications, are introduced by innovators, and either win their place or die of neglect.The practical objection to unaccepted and oversimplified spellings is the disfavor with which they are received by the reader. They distract his attention and exhaust his patience. He reads the form though automatically, without thought of its needless complexity; he reads the abbreviation tho and mentally supplies the missing letters, at the cost of a fraction of his attention. The writer has defeated his own purpose. The language manages somehow to keep pace with events. A word that has taken hold in our century is thru-way; it was born of necessity and is apparently here to stay. In combination with way, thru is more serviceable than through; it is a high-speed word for readers who are going sixty-five. Throughway would be too long to fit on a road sign, too slow to serve the speeding eye. It is conceivable that because of our thruways, through will eventually become thru — after many more thousands of miles of travel. 11. Do not explain too much. It is seldom advisable to tell all. Be sparing, for instance, in the use of adverbs after “he said,” “she replied,” and the like: “he said consolingly”; “she replied grumblingly.” Let the conversation itself disclose the speaker’s manner or condition. Dialogue heavily weighted with adverbs after the attributive verb is cluttery and annoying. Inexperienced writers not only overwork their adverbs but load their attributives with explanatory verbs: “he consoled,” “she congratulated.” They do this, apparently, in the belief that the word said is always in need of support, or because they have been told to do it by experts in the art of bad writing. 12. Do not construct awkward adverbs. Adverbs are easy to build. Take an adjective or a participle, add -ly, and behold! you have an adverb. But you’d probably be better off without it. Do not write tangledly. The word itself is a tangle. Do not even write tiredly. Nobody says tangledly and not many people say tiredly. Words that are not used orally are seldom the ones to put on paper. He climbed tiredly to bed. »»»»» He climbed wearily to bed.The lamp cord lay tangledly beneath her chair. »»»»» The lamp cord lay in tangles beneath her chair. Do not dress words up by adding -ly to them, as though putting a hat on a horse. overly »»»»» overmuchly »»»»» muchthusly »»»»» thus 13. Make sure the reader knows who is speaking. Dialogue is a total loss unless you indicate who the speaker is. In long dialogue passages containing no attributives, the reader may become lost and be compelled to go back and reread in order to puzzle the thing out. Obscurity is an imposition on the reader, to say nothing of its damage to the work. In dialogue, make sure that your attributives do not awkwardly interrupt a spoken sentence. Place them where the break would come naturally in speech — that is, where the speaker would pause for emphasis, or take a breath. The best test for locating an attributive is to speak the sentence aloud. “Now, my boy, we shall see,” he said, “how well you have learned your lesson.” »»»»» “Now, my boy,” he said, “we shall see how well you have learned your lesson.”“What’s more, they would never,” she added, “consent to the plan.” »»»»» “What’s more,” she added, “they would never consent to the plan.” 14. Avoid fancy words. Avoid the elaborate, the pretentious, the coy, and the cute. Do not be tempted by a twenty-dollar word when there is a ten-center handy, ready and able. Anglo-Saxon is a livelier tongue than Latin, so use Anglo-Saxon words. In this, as in so many matters pertaining to style, one’s ear must be one’s guide: gut is a lustier noun than intestine, but the two words are not interchangeable, because gut is often inappropriate, being too coarse for the context. Never call a stomach a tummy without good reason. If you admire fancy words, if every sky is beauteous, every blonde curvaceous, every intelligent child prodigious, if you are tickled by discombobulate, you will have a bad time with Reminder 14. What is wrong, you ask, with beauteous? No one knows, for sure. There is nothing wrong, really, with any word — all are good, but some are better than others. A matter of ear, a matter of reading the books that sharpen the ear. The line between the fancy and the plain, between the atrocious and the felicitous, is sometimes alarmingly fine. The opening phrase of the Gettysburg address is close to the line, at least by our standards today, and Mr. Lincoln, knowingly or unknowingly, was flirting with disaster when he wrote “Four score and seven years ago.” The President could have got into his sentence with plain “Eighty-seven” — a saving of two words and less of a strain on the listeners’ powers of multiplication. But Lincoln’s ear must have told him to go ahead with four score and seven. By doing so, he achieved cadence while skirting the edge of fanciness. Suppose he had blundered over the line and written, “In the year of our Lord seventeen hundred and seventy-six.” His speech would have sustained a heavy blow. Or suppose he had settled for “Eighty-seven.” In that case he would have got into his introductory sentence too quickly; the timing would have been bad. The question of ear is vital. Only the writer whose ear is reliable is in a position to use bad grammar deliberately; this writer knows for sure when a colloquialism is better than formal phrasing and is able to sustain the work at a level of good taste. So cock your ear. Years ago, students were warned not to end a sentence with a preposition; time, of course, has softened that rigid decree. Not only is the preposition acceptable at the end, sometimes it is more effective in that spot than anywhere else. “A claw hammer, not an ax, was the tool he murdered her with.” This is preferable to “A claw hammer, not an ax, was the tool with which he murdered her.” Why? Because it sounds more violent, more like murder. A matter of ear. And would you write “The worst tennis player around here is I” or “The worst tennis player around here is me”? The first is good grammar, the second is good judgment — although the me might not do in all contexts. The split infinitive is another trick of rhetoric in which the ear must be quicker than the handbook. Some infinitives seem to improve on being split, just as a stick of round stovewood does. “I cannot bring myself to really like the fellow.” The sentence is relaxed, the meaning is clear, the violation is harmless and scarcely perceptible. Put the other way, the sentence becomes stiff, needlessly formal. A matter of ear. There are times when the ear not only guides us through difficult situations but also saves us from minor or major embarrassments of prose. The ear, for example, must decide when to omit that from a sentence, when to retain it. “She knew she could do it” is preferable to “She knew that she could do it” — simpler and just as clear. But in many cases the that is needed. “He felt that his big nose, which was sunburned, made him look ridiculous.” Omit the that and you have “He felt his big nose....” 15. Do not use dialect unless your ear is good. Do not attempt to use dialect unless you are a devoted student of the tongue you hope to reproduce. If you use dialect, be consistent. The reader will become impatient or confused upon finding two or more versions of the same word or expression. In dialect it is necessary to spell phonetically, or at least ingeniously, to capture unusual inflections. Take, for example, the word once. It often appears in dialect writing as oncet, but oncet looks as though it should be pronounced “onset.” A better spelling would be wunst. But if you write it oncet once, write it that way throughout. The best dialect writers, by and large, are economical of their talents; they use the minimum, not the maximum, of deviation from the norm, thus sparing their readers as well as convincing them. 16. Be clear. Clarity is not the prize in writing, nor is it always the principal mark of a good style. There are occasions when obscurity serves a literary yearning, if not a literary purpose, and there are writers whose mien is more overcast than clear. But since writing is communication, clarity can only be a virtue. And although there is no substitute for merit in writing, clarity comes closest to being one. Even to a writer who is being intentionally obscure or wild of tongue we can say, “Be obscure clearly! Be wild of tongue in a way we can understand!” Even to writers of market letters, telling us (but not telling us) which securities are promising, we can say, “Be cagey plainly! Be elliptical in a straightforward fashion!” Clarity, clarity, clarity. When you become hopelessly mired in a sentence, it is best to start fresh; do not try to fight your way through against the terrible odds of syntax. Usually what is wrong is that the construction has become too involved at some point; the sentence needs to be broken apart and replaced by two or more shorter sentences. Muddiness is not merely a disturber of prose, it is also a destroyer of life, of hope: death on the highway caused by a badly worded road sign, heartbreak among lovers caused by a misplaced phrase in a well-intentioned letter, anguish of a traveler expecting to be met at a railroad station and not being met because of a slipshod telegram. Think of the tragedies that are rooted in ambiguity, and be clear! When you say something, make sure you have said it. The chances of your having said it are only fair. 17. Do not inject opinion. Unless there is a good reason for its being there, do not inject opinion into a piece of writing. We all have opinions about almost everything, and the temptation to toss them in is great. To air one’s views gratuitously, however, is to imply that the demand for them is brisk, which may not be the case, and which, in any event, may not be relevant to the discussion. Opinions scattered indiscriminately about leave the mark of egotism on a work. Similarly, to air one’s views at an improper time may be in bad taste. If you have received a letter inviting you to speak at the dedication of a new cat hospital, and you hate cats, your reply, declining the invitation, does not necessarily have to cover the full range of your emotions. You must make it clear that you will not attend, but you do not have to let fly at cats. The writer of the letter asked a civil question; attack cats, then, only if you can do so with good humor, good taste, and in such a way that your answer will be courteous as well as responsive. Since you are out of sympathy with cats, you may quite properly give this as a reason for not appearing at the dedicatory ceremonies of a cat hospital. But bear in mind that your opinion of cats was not sought, only your services as a speaker. Try to keep things straight. 18. Use figures of speech sparingly. The simile is a common device and a useful one, but similes coming in rapid fire, one right on top of another, are more distracting than illuminating. Readers need time to catch their breath; they can’t be expected to compare everything with something else, and no relief in sight. When you use metaphor, do not mix it up. That is, don’t start by calling something a swordfish and end by calling it an hourglass. 19. Do not take shortcuts at the cost of clarity. Do not use initials for the names of organizations or movements unless you are certain the initials will be readily understood. Write things out. Not everyone knows that MADD means Mothers Against Drunk Driving, and even if everyone did, there are babies being born every minute who will someday encounter the name for the first time. They deserve to see the words, not simply the initials. A good rule is to start your article by writing out names in full, and then, later, when your readers have got their bearings, to shorten them. Many shortcuts are self-defeating; they waste the reader’s time instead of conserving it. There are all sorts of rhetorical stratagems and devices that attract writers who hope to be pithy, but most of them are simply bothersome. The longest way round is usually the shortest way home, and the one truly reliable shortcut in writing is to choose words that are strong and surefooted to carry readers on their way. 20. Avoid foreign languages. The writer will occasionally find it convenient or necessary to borrow from other languages. Some writers, however, from sheer exuberance or a desire to show off, sprinkle their work liberally with foreign expressions, with no regard for the reader’s comfort. It is a bad habit. Write in English. 21. Prefer the standard to the offbeat. Young writers will be drawn at every turn toward eccentricities in language. They will hear the beat of new vocabularies, the exciting rhythms of special segments of their society, each speaking a language of its own. All of us come under the spell of these unsettling drums; the problem for beginners is to listen to them, learn the words, feel the vibrations, and not be carried away. Youths invariably speak to other youths in a tongue of their own devising: they renovate the language with a wild vigor, as they would a basement apartment. By the time this paragraph sees print, psyched, nerd, ripoff, dude, geek, and funky will be the words of yesteryear, and we will be fielding more recent ones that have come bouncing into our speech — some of them into our dictionary as well. A new word is always up for survival. Many do survive. Others grow stale and disappear. Most are, at least in their infancy, more appropriate to conversation than to composition. Today, the language of advertising enjoys an enormous circulation. With its deliberate infractions of grammatical rules and its crossbreeding of the parts of speech, it profoundly influences the tongues and pens of children and adults. Your new kitchen range is so revolutionary it obsoletes all other ranges. Your counter top is beautiful because it is accessorized with gold-plated faucets. Your cigarette tastes good like a cigarette should. And, like the man says, you will want to try one. You will also, in all probability, want to try writing that way, using that language. You do so at your peril, for it is the language of mutilation. Advertisers are quite understandably interested in what they call “attention getting.” The man photographed must have lost an eye or grown a pink beard, or he must have three arms or be sitting wrong-end-to on a horse. This technique is proper in its place, which is the world of selling, but the young writer had best not adopt the device of mutilation in ordinary composition, whose purpose is to engage, not paralyze, the readers senses. Buy the gold-plated faucets if you will, but do not accessorize your prose. To use the language well, do not begin by hacking it to bits; accept the whole body of it, cherish its classic form, its variety, and its richness. Another segment of society that has constructed a language of its own is business. People in business say that toner cartridges are in short supply, that they have updated the next shipment of these cartridges, and that they will finalize their recommendations at the next meeting of the board. They are speaking a language familiar and dear to them. Its portentous nouns and verbs invest ordinary events with high adventure; executives walk among toner cartridges, caparisoned like knights. We should tolerate them — every person of spirit wants to ride a white horse. The only question is whether business vocabulary is helpful to ordinary prose. Usually, the same ideas can be expressed less formidably, if one makes the effort. A good many of the special words of business seem designed more to express the user’s dreams than to express a precise meaning. Not all such words, of course, can be dismissed summarily; indeed, no word in the language can be dismissed offhand by anyone who has a healthy curiosity. Update isn’t a bad word; in the right setting it is useful. In the wrong setting, though, it is destructive, and the trouble with adopting coinages too quickly is that they will bedevil one by insinuating themselves where they do not belong. This may sound like rhetorical snobbery, or plain stuffiness; but you will discover, in the course of your work, that the setting of a word is just as restrictive as the setting of a jewel. The general rule here is to prefer the standard. Finalize, for instance, is not standard; it is special, and it is a peculiarly fuzzy and silly word. Does it mean “terminate,” or does it mean “put into final form”? One can’t be sure, really, what it means, and one gets the impression that the person using it doesn’t know, either, and doesn’t want to know. The special vocabularies of the law, of the military, of government are familiar to most of us. Even the world of criticism has a modest pouch of private words (luminous, taut), whose only virtue is that they are exceptionally nimble and can escape from the garden of meaning over the wall. Of these critical words, Wolcott Gibbs once wrote, “... they are detached from the language and inflated like little balloons.” The young writer should learn to spot them — words that at first glance seem freighted with delicious meaning but that soon burst in air, leaving nothing but a memory of bright sound. The language is perpetually in flux: it is a living stream, shifting, changing, receiving new strength from a thousand tributaries, losing old forms in the backwaters of time. To suggest that a young writer not swim in the main stream of this turbulence would be foolish indeed, and such is not the intent of these cautionary remarks. The intent is to suggest that in choosing between the formal and the informal, the regular and the offbeat, the general and the special, the orthodox and the heretical, the beginner err on the side of conservatism, on the side of established usage. No idiom is taboo, no accent forbidden; there is simply a better chance of doing well if the writer holds a steady course, enters the stream of English quietly, and does not thrash about. “But,” you may ask, “what if it comes natural to me to experiment rather than conform? What if I am a pioneer, or even a genius?” Answer: then be one. But do not forget that what may seem like pioneering may be merely evasion, or laziness — the disinclination to submit to discipline. Writing good standard English is no cinch, and before you have managed it you will have encountered enough rough country to satisfy even the most adventurous spirit. Style takes its final shape more from attitudes of mind than from principles of composition, for, as an elderly practitioner once remarked, “Writing is an act of faith, not a trick of grammar.” This moral observation would have no place in a rule book were it not that style is the writer, and therefore what you are, rather than what you know, will at last determine your style. If you write, you must believe — in the truth and worth of the scrawl, in the ability of the reader to receive and decode the message. No one can write decently who is distrustful of the reader’s intelligence, or whose attitude is patronizing. Many references have been made in this book to “the reader,” who has been much in the news. It is now necessary to warn you that your concern for the reader must be pure: you must sympathize with the reader’s plight (most readers are in trouble about half the time) but never seek to know the reader’s wants. Your whole duty as a writer is to please and satisfy yourself, and the true writer always plays to an audience of one. Start sniffing the air, or glancing at the Trend Machine, and you are as good as dead, although you may make a nice living. Full of belief, sustained and elevated by the power of purpose, armed with the rules of grammar, you are ready for exposure. At this point, you may well pattern yourself on the fully exposed cow of Robert Louis Stevenson’s rhyme. This friendly and commendable animal, you may recall, was “blown by all the winds that pass /And wet with all the showers.” And so must you as a young writer be. In our modern idiom, we would say that you must get wet all over. Mr. Stevenson, working in a plainer style, said it with felicity, and suddenly one cow, out of so many, received the gift of immortality. Like the steadfast writer, she is at home in the wind and the rain; and, thanks to one moment of felicity, she will live on and on and on.",
    "date": "2024-07-15T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/the-elements-of-style/chapter-4-words-and-expressions-commonly-misused",
    "title": "Chapter 4 — Words and Expressions Commonly Misused",
    "image": "",
    "tags": [
      "book",
      "mba"
    ],
    "description": "Many of the words and expressions listed here are not so much bad English as bad style, the commonplaces of careless writing. As illustrated under Feature, the proper correction is likely to be not the replacement of one word or set of words by another but the replacement of vague generality by definite statement.",
    "content": "Chapter 4 — Words and Expressions Commonly Misused Many of the words and expressions listed here are not so much bad English as bad style, the commonplaces of careless writing. As illustrated under Feature, the proper correction is likely to be not the replacement of one word or set of words by another but the replacement of vague generality by definite statement. The shape of our language is not rigid; in questions of usage we have no lawgiver whose word is final. Students whose curiosity is aroused by the interpretations that follow, or whose doubts are raised, will wish to pursue their investigations further. Books useful in such pursuits are Merriam Webster’s Collegiate Dictionary, Tenth Edition; The American Heritage Dictionary of the English Language, Third Edition; Webster’s Third New International Dictionary; The New Fowler’s Modern English Usage, Third Edition, edited by R. W. Burchfield; Modern American Usage: A Guide by Wilson Follett and Erik Wensberg; and The Careful Writer by Theodore M. Bernstein. Aggravate. Irritate. The first means “to add to” an already troublesome or vexing matter or condition. The second means “to vex” or “to annoy” or “to chafe.” All right. Idiomatic in familiar speech as a detached phrase in the sense “Agreed,” or “Go ahead,” or “O.K.” Properly written as two words — all right. Allude. Do not confuse with elude. You allude to a book; you elude a pursuer. Note, too, that allude is not synonymous with refer. An allusion is an indirect mention, a reference is a specific one. Allusion. Easily confused with illusion. The first means “an indirect reference”; the second means “an unreal image” or “a false impression.” Alternate. Alternative. The words are not always interchangeable as nouns or adjectives. The first means every other one in a series; the second, one of two possibilities. As the other one of a series of two, an alternate may stand for “a substitute,” but an alternative, although used in a similar sense, connotes a matter of choice that is never present with alternate. As the flooded road left them no alternative, they took the alternate route. Among. Between. When more than two things or persons are involved, among is usually called for: “The money was divided among the four players.” When, however, more than two are involved but each is considered individually, between is preferred: “an agreement between the six heirs.” And / or. A device, or shortcut, that damages a sentence and often leads to confusion or ambiguity. First of all, would an honor system successfully cut down on the amount of stealing and/or cheating? »»»»» First of all, would an honor system reduce the incidence of stealing or cheating or both? Anticipate. Use expect in the sense of simple expectation. I anticipated that he would look older. »»»»» I expected that he would look older.My brother anticipated the upturn in the market. »»»»» My brother expected the upturn in the market. In the second example, the word anticipated is ambiguous. It could mean simply that the brother believed the upturn would occur, or it could mean that he acted in advance of the expected upturn — by buying stock, perhaps. Anybody. In the sense of “any person,” not to be written as two words. Any body means “any corpse,” or “any human form,” or “any group.” The rule holds equally for everybody, nobody, and somebody. Anyone. In the sense of “anybody,” written as one word. Any one means “any single person” or “any single thing.” As good or better than. Expressions of this type should be corrected by rearranging the sentences. My opinion is as good or better than his. »»»»» My opinion is as good as his, or better (if not better). As to whether. Whether is sufficient. As yet. Yet nearly always is as good, if not better. No agreement has been reached as yet. »»»»» No agreement has yet been reached. The chief exception is at the beginning of a sentence, where yet means something different. Yet (or despite everything) he has not succeeded.As yet (or so far) he has not succeeded. Being. Not appropriate after regard ... as. He is regarded as being the best dancer in the club »»»»» He is regarded as the best dancer in the club. But. Unnecessary after doubt and help. I have no doubt but that »»»»» I have no doubt thatHe could not help but see that »»»»» He could not help seeing that The too-frequent use of but as a conjunction leads to the fault discussed under Rule 18. A loose sentence formed with but can usually be converted into a periodic sentence formed with although. Particularly awkward is one but closely following another, thus making a contrast to a contrast, or a reservation to a reservation. This is easily corrected by rearrangement. Our country had vast resources but seemed almost wholly unprepared for war. But within a year it had created an army of four million. »»»»» Our country seemed almost wholly unprepared for war, but it had vast resources. Within a year it had created an army of four million. Can. Means “am (is, are) able.” Not to be used as a substitute for may. Care less. The dismissive “I couldn’t care less” is often used with the shortened “not” mistakenly (and mysteriously) omitted: “I could care less.” The error destroys the meaning of the sentence and is careless indeed. Case. Often unnecessary. In many cases, the rooms lacked air conditioning. »»»»» Many of the rooms lacked air conditioning.It has rarely been the case that any mistake has been made. »»»»» Few mistakes have been made. Certainly. Used indiscriminately by some speakers, much as others use very, in an attempt to intensify any and every statement. A mannerism of this kind, bad in speech, is even worse in writing. Character. Often simply redundant, used from a mere habit of wordiness. acts of a hostile character »»»»» hostile acts Claim. (verb). With object-noun, means “lay claim to.” May be used with a dependent clause if this sense is clearly intended: “She claimed that she was the sole heir.” (But even here claimed to be would be better.) Not to be used as a substitute for declare, maintain, or charge. He claimed he knew how. »»»»» He declared he knew how. Clever. Note that the word means one thing when applied to people, another when applied to horses. A clever horse is a good-natured one, not an ingenious one. Compare. To compare to is to point out or imply resemblances between objects regarded as essentially of a different order; to compare with is mainly to point out differences between objects regarded as essentially of the same order. Thus, life has been compared to a pilgrimage, to a drama, to a battle; Congress may be compared with the British Parliament. Paris has been compared to ancient Athens; it may be compared with modern London. Comprise. Literally, “embrace”: A zoo comprises mammals, reptiles, and birds (because it “embraces,” or “includes,” them). But animals do not comprise (“embrace”) a zoo — they constitute a zoo. Consider. Not followed by as when it means “believe to be.” I consider him as competent. »»»»» I consider him competent. When considered means “examined” or “discussed,” it is followed by as: The lecturer considered Eisenhower first as soldier and second as administrator. Contact. As a transitive verb, the word is vague and self-important. Do not contact people; get in touch with them, look them up, phone them, find them, or meet them. Cope. An intransitive verb used with with. In formal writing, one doesn’t “cope,” one “copes with” something or somebody. I knew they’d cope. (jocular) »»»»» I knew they would cope with the situation. Currently. In the sense of now with a verb in the present tense, currently is usually redundant; emphasis is better achieved through a more precise reference to time. We are currently reviewing your application. »»»»» We are at this moment reviewing your application. Data. Like strata, phenomena, and media, data is a plural and is best used with a plural verb. The word, however, is slowly gaining acceptance as a singular. The data is misleading. »»»»» These data are misleading. Different than. Here logic supports established usage: one thing differs from another, hence, different from. Or, other than, unlike. Disinterested. Means “impartial.” Do not confuse it with uninterested, which means “not interested in.” Let a disinterested person judge our dispute, (an impartial person)This man is obviously uninterested in our dispute, (couldn’t care less) Divided into. Not to be misused for composed of. The line is sometimes difficult to draw; doubtless plays are divided into acts, but poems are composed of stanzas. An apple, halved, is divided into sections, but an apple is composed of seeds, flesh, and skin. Due to. Loosely used for through, because of, or owing to, in adverbial phrases. He lost the first game due to carelessness. »»»»» He lost the first game because of carelessness. In correct use, synonymous with attributable to: “The accident was due to bad weather”; “losses due to preventable fires.” Each and every one. Pitchman’s jargon. Avoid, except in dialogue. It should be a lesson to each and every one of us. »»»»» It should be a lesson to every one of us (to us all). Effect. As a noun, means “result”; as a verb, means “to bring about,” “to accomplish” (not to be confused with affect, which means “to influence”). As a noun, often loosely used in perfunctory writing about fashions, music, painting, and other arts: “a Southwestern effect”; “effects in pale green”; “very delicate effects”; “subtle effects”; “a charming effect was produced.” The writer who has a definite meaning to express will not take refuge in such vagueness. Enormity. Use only in the sense of “monstrous wickedness.” Misleading, if not wrong, when used to express bigness. Enthuse. An annoying verb growing out of the noun enthusiasm. Not recommended. She was enthused about her new car. »»»»» She was enthusiastic about her new car.She enthused about her new car. »»»»» She talked enthusiastically (expressed enthusiasm) about her new car. Etc. Literally, “and other things”; sometimes loosely used to mean “and other persons.” The phrase is equivalent to and the rest, and so forth, and hence is not to be used if one of these would be insufficient — that is, if the reader would be left in doubt as to any important particulars. Least open to objection when it represents the last terms of a list already given almost in full, or immaterial words at the end of a quotation. At the end of a list introduced by such as, for example, or any similar expression, etc. is incorrect. In formal writing, etc. is a misfit. An item important enough to call for etc. is probably important enough to be named. Fact. Use this word only of matters capable of direct verification, not of matters of judgment. That a particular event happened on a given date and that lead melts at a certain temperature are facts. But such conclusions as that Napoleon was the greatest of modern generals or that the climate of California is delightful, however defensible they may be, are not properly called facts. Facility. Why must jails, hospitals, and schools suddenly become “facilities”? Parents complained bitterly about the fire hazard in the wooden facility. »»»»» Parents complained bitterly about the fire hazard in the wooden schoolhouse.He has been appointed warden of the new facility. »»»»» He has been appointed warden of the new prison. Factor. A hackneyed word; the expressions of which it is a part can usually be replaced by something more direct and idiomatic. Her superior training was the great factor in her winning the match. »»»»» She won the match by being better trained.Air power is becoming an increasingly important factor in deciding battles. »»»»» Air power is playing a larger and larger part in deciding battles. Farther. Further. The two words are commonly interchanged, but there is a distinction worth observing: farther serves best as a distance word, further as a time or quantity word. You chase a ball farther than the other fellow; you pursue a subject further. Feature. Another hackneyed word; like factor, it usually adds nothing to the sentence in which it occurs. A feature of the entertainment especially worthy of mention was the singing of Allison Jones. »»»»» (Better use the same number of words to tell what Allison Jones sang and how she sang it.) As a verb, in the sense of “offer as a special attraction,” it is to be avoided. Finalize. A pompous, ambiguous verb. (See Chapter V, Reminder 21.) Fix. Colloquial in America for arrange, prepare, mend. The usage is well established. But bear in mind that this verb is from figere: “to make firm,” “to place definitely.” These are the preferred meanings of the word. Flammable. An oddity, chiefly useful in saving lives. The common word meaning “combustible” is inflammable. But some people are thrown off by the in- and think inflammable means “not combustible.” For this reason, trucks carrying gasoline or explosives are now marked FLAMMABLE. Unless you are operating such a truck and hence are concerned with the safety of children and illiterates, use inflammable. Folk. A collective noun, equivalent to people. Use the singular form only. Folks, in the sense of “parents,” “family,” “those present,” is colloquial and too folksy for formal writing. Her folks arrived by the afternoon train. »»»»» Her father and mother arrived by the afternoon train. Fortuitous. Limited to what happens by chance. Not to be used for fortunate or lucky. Get. The colloquial have got for have should not be used in writing. The preferable form of the participle is got, not gotten. He has not got any sense. »»»»» He has no sense.They returned without having gotten any. »»»»» They returned without having got any. Gratuitous. Means “unearned,” or “unwarranted.” The insult seemed gratuitous, (undeserved) He is a man who. A common type of redundant expression; see Rule 17. He is a man who is very ambitious. »»»»» He is very ambitious.Vermont is a state that attracts visitors because of its winter sports. »»»»» Vermont attracts visitors because of its winter sports. Hopefully. This once-useful adverb meaning “with hope” has been distorted and is now widely used to mean “I hope” or “it is to be hoped.” Such use is not merely wrong, it is silly. To say, “Hopefully I’ll leave on the noon plane” is to talk nonsense. Do you mean you’ll leave on the noon plane in a hopeful frame of mind? Or do you mean you hope you’ll leave on the noon plane? Whichever you mean, you haven’t said it clearly. Although the word in its new, free-floating capacity may be pleasurable and even useful to many, it offends the ear of many others, who do not like to see words dulled or eroded, particularly when the erosion leads to ambiguity, softness, or nonsense. However. Avoid starting a sentence with however when the meaning is “nevertheless.” The word usually serves better when not in first position. The roads were almost impassable. However, we at last succeeded in reaching camp. »»»»» The roads were almost impassable. At last, however, we succeeded in reaching camp.When however comes first, it means “in whatever way” or “to whatever extent.”However you advise him, he will probably do as he thinks best.However discouraging the prospect, they never lost heart. Illusion. See allusion. Imply. Infer. Not interchangeable. Something implied is something suggested or indicated, though not expressed. Something inferred is something deduced from evidence at hand. Farming implies early rising.Since she was a farmer, we inferred that she got up early. Importantly. Avoid by rephrasing. More importantly, he paid for the damages. »»»»» What’s more, he paid for the damages.With the breeze freshening, he altered course to pass inside the island. More importantly, as things turned out, he tucked in a reef. »»»»» With the breeze freshening, he altered course to pass inside the island. More important, as things turned out, he tucked in a reef. In regard to. Often wrongly written in regards to. But as regards is correct, and means the same thing. In the last analysis. A bankrupt expression. Inside of. Inside. The of following inside is correct in the adverbial meaning “in less than.” In other meanings, of is unnecessary. Inside of five minutes I’ll be inside the bank. Insightful. The word is a suspicious overstatement for “perceptive.” If it is to be used at all, it should be used for instances of remarkably penetrating vision. Usually, it crops up merely to inflate the commonplace. That was an insightful remark you made. »»»»» That was a perceptive remark you made. In terms of. A piece of padding usually best omitted. The job was unattractive in terms of salary. »»»»» The salary made the job unattractive. Interesting. An unconvincing word; avoid it as a means of introduction. Instead of announcing that what you are about to tell is interesting, make it so. An interesting story is told of »»»»» (Tell the story without preamble.)In connection with the forthcoming visit of Mr. B. to America, it is interesting to recall that he »»»»» Mr. B., who will soon visit America Also to be avoided in introduction is the word funny. Nothing becomes funny by being labeled so. Irregardless. Should be regardless. The error results from failure to see the negative in -less and from a desire to get it in as a prefix, suggested by such words as irregular, irresponsible, and, perhaps especially, irrespective. -ize. Do not coin verbs by adding this tempting suffix. Many good and useful verbs do end in -ize: summarize, fraternize, harmonize, fertilize. But there is a growing list of abominations: containerize, prioritize, finalize, to name three. Be suspicious of -ize; let your ear and your eye guide you. Never tack -ize onto a noun to create a verb. Usually you will discover that a useful verb already exists. Why say “utilize” when there is the simple, unpretentious word use? Kind of. Except in familiar style, not to be used as a substitute for rather or something like. Restrict it to its literal sense: “Amber is a kind of fossil resin”; “I dislike that kind of publicity.” The same holds true for sort of. Lay. A transitive verb. Except in slang (“Let it lay”), do not misuse it for the intransitive verb lie. The hen, or the play, lays an egg; the llama lies down. The playwright went home and lay down. lie, lay, lain, lyinglay, laid, laid, laying Leave. Not to be misused for let. Leave it stand the way it is. »»»»» Let it stand the way it is.Leave go of that rope! »»»»» Let go of that rope! Less. Should not be misused for fewer. They had less workers than in the previous campaign. »»»»» They had fewer workers than in the previous campaign. Less refers to quantity, fewer to number. “His troubles are less than mine” means “His troubles are not so great as mine.” “His troubles are fewer than mine” means “His troubles are not so numerous as mine.” Like. Not to be used for the conjunction as. Like governs nouns and pronouns; before phrases and clauses the equivalent word is as. We spent the evening like in the old days. »»»»» We spent the evening as in the old days.Chloë smells good, like a baby should. »»»»» Chloë smells good, as a baby should. The use of like for as has its defenders; they argue that any usage that achieves currency becomes valid automatically. This, they say, is the way the language is formed. It is and it isn’t. An expression sometimes merely enjoys a vogue, much as an article of apparel does. Like has long been widely misused by the illiterate; lately it has been taken up by the knowing and the well- informed, who find it catchy, or liberating, and who use it as though they were slumming. If every word or device that achieved currency were immediately authenticated, simply on the ground of popularity, the language would be as chaotic as a ball game with no foul lines. For the student, perhaps the most useful thing to know about like is that most carefully edited publications regard its use before phrases and clauses as simple error. Line. Along these lines. Line in the sense of “course of procedure, conduct, thought” is allowable but has been so overworked, particularly in the phrase along these lines, that a writer who aims at freshness or originality had better discard it entirely. Mr. B. also spoke along the same lines. »»»»» Mr. B. also spoke to the same effect.She is studying along the line of French literature. »»»»» She is studying French literature. Literal. Literally. Often incorrectly used in support of exaggeration or violent metaphor. a literal flood of abuse »»»»» a flood of abuseliterally dead with fatigue »»»»» almost dead with fatigue Loan. A noun. As a verb, prefer lend. Lend me your ears.the loan of your ears Meaningful. A bankrupt adjective. Choose another, or rephrase. His was a meaningful contribution. »»»»» His contribution counted heavily. We are instituting many meaningful changes in the curriculum. »»»»» We are improving the curriculum in many ways. Memento. Often incorrectly written momento. Most. Not to be used for almost in formal composition. most everybody »»»»» almost everybody most all the time »»»»» almost all the time Nature. Often simply redundant, used like character. acts of a hostile nature »»»»» hostile acts Nature should be avoided in such vague expressions as “a lover of nature,” “poems about nature.” Unless more specific statements follow, the reader cannot tell whether the poems have to do with natural scenery, rural life, the sunset, the untracked wilderness, or the habits of squirrels. Nauseous. Nauseated. The first means “sickening to contemplate”; the second means “sick at the stomach.” Do not, therefore, say, “I feel nauseous,” unless you are sure you have that effect on others. Nice. A shaggy, all-purpose word, to be used sparingly in formal composition. “I had a nice time.” “It was nice weather.” “She was so nice to her mother.” The meanings are indistinct. Nice is most useful in the sense of “precise” or “delicate”: “a nice distinction.” Nor. Often used wrongly for or after negative expressions. He cannot eat nor sleep. »»»»» He cannot eat or sleep. / He can neither eat nor sleep. / He cannot eat nor can he sleep. Noun used as verb. Many nouns have lately been pressed into service as verbs. Not all are bad, but all are suspect. Be prepared for kisses when you gift your girlfriend with this merry scent. »»»»» Be prepared for kisses when you give your girlfriend this merry scent.The candidate hosted a dinner for fifty of her workers. »»»»» The candidate gave a dinner for fifty of her workers.The meeting was chaired by Mr. Oglethorp. »»»»» Mr. Oglethorp was chair of the meeting.She headquarters in Newark. »»»»» She has headquarters in Newark.The theater troupe debuted last fall. »»»»» The theatre troupe made its debut last fall. Offputting. Ongoing. Newfound adjectives, to be avoided because they are inexact and clumsy. Ongoing is a mix of “continuing” and “active” and is usually superfluous. He devoted all his spare time to the ongoing program for aid to the elderly. »»»»» He devoted all his spare time to the program for aid to the elderly. Offputting might mean “objectionable,” “disconcerting,” “distasteful.” Select instead a word whose meaning is clear. As a simple test, transform the participles to verbs. It is possible to upset something. But to offput? To ongo? One. In the sense of “a person,” not to be followed by his or her. One must watch his step. »»»»» One must watch one’s step. (You must watch your step.) One of the most. Avoid this feeble formula. “One of the most exciting developments of modern science is ...”; “Switzerland is one of the most beautiful countries of Europe.” There is nothing wrong with the grammar; the formula is simply threadbare. -oriented. A clumsy, pretentious device, much in vogue. Find a better way of indicating orientation or alignment or direction. It was a manufacturing-oriented company. »»»»» It was a company chiefly concerned with manufacturing.Many of the skits are situation-oriented. »»»»» Many of the skits rely on situation. Partially. Not always interchangeable with partly. Best used in the sense of “to a certain degree,” when speaking of a condition or state: “I’m partially resigned to it.” Partly carries the idea of a part as distinct from the whole — usually a physical object. The log was partially submerged. »»»»» The log was partly submerged.She was partially in and partially out. »»»»» She was partly in and partly out. / She was part in, part out. Participle for verbal noun. There was little prospect of the Senate accepting even this compromise. »»»»» There was little prospect of the Senate’s accepting even this compromise. In the lefthand column, accepting is a present participle; in the righthand column, it is a verbal noun (gerund). The construction shown in the lefthand column is occasionally found, and has its defenders. Yet it is easy to see that the second sentence has to do not with a prospect of the Senate but with a prospect of accepting. Any sentence in which the use of the possessive is awkward or impossible should of course be recast. In the event of a reconsideration of the whole matters becoming necessary »»»»» If it should become necessary to reconsider the whole matterThere was great dissatisfaction with the decision of the arbitrators being favorable to the company. »»»»» There was great dissatisfaction with the arbitrators’ decision in favor of the company. People. A word with many meanings. (The American Heritage Dictionary, Third Edition, gives nine.) The people is a political term, not to be confused with the public. From the people comes political support or opposition; from the public comes artistic appreciation or commercial patronage. The word people is best not used with words of number, in place of persons. If of “six people” five went away, how many people would be left? Answer: one people. Personalize. A pretentious word, often carrying bad advice. Do not personalize your prose; simply make it good and keep it clean. See Chapter V, Reminder 1. a highly personalized affair »»»»» a highly personal affairPersonalize your stationery. »»»»» Design a letterhead. Personally. Often unnecessary. Personally, I thought it was a good book. »»»»» I thought it a good book. Possess. Often used because to the writer it sounds more impressive than have or own. Such usage is not incorrect but is to be guarded against. She possessed great courage. »»»»» She had great courage (was very brave).He was the fortunate possessor of »»»»» He was lucky enough to own Presently. Has two meanings: “in a short while” and “currently.” Because of this ambiguity it is best restricted to the first meaning: “She’ll be here presently” (“soon,” or “in a short time”). Prestigious. Often an adjective of last resort. It’s in the dictionary, but that doesn’t mean you have to use it. Refer. See allude. Regretful. Sometimes carelessly used for regrettable: “The mixup was due to a regretful breakdown in communications.” Relate. Not to be used intransitively to suggest rapport. I relate well to Janet. »»»»» Janet and I see things the same way. / Janet and I have a lot in common. Respective. Respectively. These words may usually be omitted with advantage. Works of fiction are listed under the names of their respective authors. »»»»» Works of fiction are listed under the names of their authors.The mile run and the two-mile run were won by Jones and Cummings respectively. »»»»» The mile run was won by Jones, the two-mile run by Cummings. Secondly, thirdly, etc. Unless you are prepared to begin with firstly and defend it (which will be difficult), do not prettify numbers with -ly. Modern usage prefers second, third, and so on. Shall. Will. In formal writing, the future tense requires shall for the first person, will for the second and third. The formula to express the speaker’s belief regarding a future action or state is I shall; I will expresses determination or consent. A swimmer in distress cries, “I shall drown; no one will save me!” A suicide puts it the other way: “I will drown; no one shall save me!” In relaxed speech, however, the words shall and will are seldom used precisely; our ear guides us or fails to guide us, as the case may be, and we are quite likely to drown when we want to survive and survive when we want to drown. So. Avoid, in writing, the use of so as an intensifier: “so good”; “so warm”; “so delightful.” Sort of. See kind of. Split infinitive. There is precedent from the fourteenth century down for interposing an adverb between to and the infinitive it governs, but the construction should be avoided unless the writer wishes to place unusual stress on the adverb. to diligently inquire »»»»» to inquire diligently For another side to the split infinitive, see Chapter V, Reminder 14. State. Not to be used as a mere substitute for say, remark. Restrict it to the sense of “express fully or clearly”: “He refused to state his objections.” Student body. Nine times out of ten a needless and awkward expression, meaning no more than the simple word students. a member of the student body »»»»» a studentpopular with the student body »»»»» liked by the students Than. Any sentence with than (to express comparison) should be examined to make sure no essential words are missing. I’m probably closer to my mother than my father. (Ambiguous.) »»»»» I’m probably closer to my mother than to my father. / I’m probably closer to my mother than my father is.It looked more like a cormorant than a heron. »»»»» It looked more like a cormorant than like a heron. Thanking you in advance. This sounds as if the writer meant, “It will not be worth my while to write to you again.” In making your request, write “Will you please,” or “I shall be obliged.” Then, later, if you feel moved to do so, or if the circumstances call for it, write a letter of acknowledgment. That. Which. That is the defining, or restrictive, pronoun, which the nondefining, or nonrestrictive. (See Rule 3.) The lawn mower that is broken is in the garage. (Tells which one.)The lawn mower, which is broken, is in the garage. (Adds a fact about the only mower in question.) The use of which for that is common in written and spoken language (“Let us now go even unto Bethlehem, and see this thing which is come to pass.”). Occasionally which seems preferable to that, as in the sentence from the Bible. But it would be a convenience to all if these two pronouns were used with precision. Careful writers, watchful for small conveniences, go which-hunting, remove the defining whiches, and by so doing improve their work. The foreseeable future. A cliche, and a fuzzy one. How much of the future is foreseeable? Ten minutes? Ten years? Any of it? By whom is it foreseeable? Seers? Experts? Everybody? The truth. is.... The fact is.... A bad beginning for a sentence. If you feel you are possessed of the truth, or of the fact, simply state it. Do not give it advance billing. They. He or She. Do not use they when the antecedent is a distributive expression such as each, each one, everybody, every one, many a man. Use the singular pronoun. Every one of us knows they are fallible. »»»»» Every one of us knows he is fallible.Everyone in the community, whether they are a member of the Association or not, is invited to attend. »»»»» Everyone in the community, whether he is a member of the Association or not, is invited to attend. A similar fault is the use of the plural pronoun with the antecedent anybody, somebody, someone, the intention being either to avoid the awkward he or she or to avoid committing oneself to one or the other. Some bashful speakers even say, “A friend of mine told me that they....” The use of he as a pronoun for nouns embracing both genders is a simple, practical convention rooted in the beginnings of the English language. Currently, however, many writers find the use of the generic he or his to rename indefinite antecedents limiting or offensive. Substituting he or she in its place is the logical thing to do if it works. But it often doesn’t work, if only because repetition makes it sound boring or silly. Consider these strategies to avoid an awkward overuse of he or she or an unintentional emphasis on the masculine: Use the plural rather than the singular. The writer must address his readers’ concerns. »»»»» Writers must address their readers’ concerns. Eliminate the pronoun altogether. The writer must address his readers’ concerns. »»»»» The writer must address readers’ concerns. Substitute the second person for the third person. The writer must address his readers’ concerns. »»»»» As a writer, you must address your readers’ concerns. No one need fear to use he if common sense supports it. If you think she is a handy substitute for he, try it and see what happens. Alternatively, put all controversial nouns in the plural and avoid the choice of sex altogether, although you may find your prose sounding general and diffuse as a result. This. The pronoun this, referring to the complete sense of a preceding sentence or clause, can’t always carry the load and so may produce an imprecise statement. Visiting dignitaries watched yesterday as ground was broken for the new high-energy physics laboratory with a blowout safety wall. This is the first visible evidence of the university’s plans for modernization and expansion. »»»»» Visiting dignitaries watched yesterday as ground was broken for the new high-energy physics laboratory with a blowout safety wall. The ceremony afforded the first visible evidence of the university’s plans for modernization and expansion. In the lefthand example above, this does not immediately make clear what the first visible evidence is. Thrust. This showy noun, suggestive of power, hinting of sex, is the darling of executives, politicos, and speech-writers. Use it sparingly. Save it for specific application. Our reorganization plan has a tremendous thrust. »»»»» The piston has a five-inch thrust.The thrust of his letter was that he was working more hours than he’d bargained for. »»»»» The point he made in his letter was that he was working more hours than he’d bargained for. Tortuous. Torturous. A winding road is tortuous, a painful ordeal is torturous. Both words carry the idea of “twist,” the twist having been a form of torture. Transpire. Not to be used in the sense of “happen,” “come to pass.” Many writers so use it (usually when groping toward imagined elegance), but their usage finds little support in the Latin “breathe across or through.” It is correct, however, in the sense of “become known.” “Eventually, the grim account of his villainy transpired” (literally, “leaked through or out”). Try. Takes the infinitive: “try to mend it,” not “try and mend it.” Students of the language will argue that try and has won through and become idiom. Indeed it has, and it is relaxed and acceptable. But try to is precise, and when you are writing formal prose, try and write try to. Type. Not a synonym for kind of. The examples below are common vulgarisms. that type employee »»»»» that kind of employeeI dislike that type publicity. »»»»» I dislike that kind of publicity.small, home-type hotels »»»»» small, homelike hotelsa new type plane »»»»» a plane of a new design (new kind) Unique. Means “without like or equal.” Hence, there can be no degrees of uniqueness. It was the most unique coffee maker on the market. »»»»» It was a unique coffee maker.The balancing act was very unique. »»»»» The balancing act was unique.Of all the spiders, the one that lives in a bubble under water is the most unique. »»»»» Among spiders, the one that lives in a bubble under water is unique. Utilize. Prefer use. I utilized the facilities. »»»»» I used the toilet.He utilized the dishwasher. »»»»» He used the dishwasher. Verbal. Sometimes means “word for word” and in this sense may refer to something expressed in writing. Oral (from Latin os, “mouth”) limits the meaning to what is transmitted by speech. Oral agreement is more precise than verbal agreement. Very. Use this word sparingly. Where emphasis is necessary, use words strong in themselves. While. Avoid the indiscriminate use of this word for and, but, and although. Many writers use it frequently as a substitute for and or but, either from a mere desire to vary the connective or from doubt about which of the two connectives is more appropriate. In this use it is best replaced by a semicolon. The office and salesrooms are on the ground floor, while the rest of the building is used for manufacturing. »»»»» The office and salesrooms are on the ground floor; the rest of the building is used for manufacturing. Its use as a virtual equivalent of although is allowable in sentences where this leads to no ambiguity or absurdity. While I admire his energy, I wish it were employed in a better cause. This is entirely correct, as shown by the paraphrase I admire his energy; at the same time, I wish it were employed in a better cause. Compare: While the temperature reaches 90 or 95 degrees in the daytime, the nights are often chilly. The paraphrase shows why the use of while is incorrect: The temperature reaches 90 or 95 degrees in the daytime; at the same time the nights are often chilly. In general, the writer will do well to use while only with strict literalness, in the sense of “during the time that.” -wise. Not to be used indiscriminately as a pseudosuffix: taxwise, pricewise, marriagewise, prosewise, saltwater taffy-wise. Chiefly useful when it means “in the manner of: clockwise. There is not a noun in the language to which -wise cannot be added if the spirit moves one to add it. The sober writer will abstain from the use of this wild additive. Worth while. Overworked as a term of vague approval and (with not) of disapproval. Strictly applicable only to actions: “Is it worth while to telegraph?” His books are not worth while. »»»»» His books are not worth reading (are not worth one’s while to read; do not repay reading). The adjective worthwhile (one word) is acceptable but emaciated. Use a stronger word. a worthwhile project »»»»» a promising (useful, valuable, exciting) project Would. Commonly used to express habitual or repeated action. (“He would get up early and prepare his own breakfast before he went to work.”) But when the idea of habit or repetition is expressed, in such phrases as once a year, every day, each Sunday, the past tense, without would, is usually sufficient, and, from its brevity, more emphatic. Once a year he would visit the old mansion. »»»»» Once a year he visited the old mansion. In narrative writing, always indicate the transition from the general to the particular — that is, from sentences that merely state a general habit to those that express the action of a specific day or period. Failure to indicate the change will cause confusion. Townsend would get up early and prepare his own breakfast. If the day was cold, he filled the stove and had a warm fire burning before he left the house. On his way out to the garage, he noticed that there were footprints in the new-fallen snow on the porch. The reader is lost, having received no signal that Townsend has changed from a mere man of habit to a man who has seen a particular thing on a particular day. Townsend would get up early and prepare his own breakfast. If the day was cold, he filled the stove and had a warm fire burning before he left the house. One morning in January, on his way out to the garage, he noticed footprints in the new-fallen snow on the porch.",
    "date": "2024-07-15T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/the-elements-of-style/chapter-3-a-few-matters-of-form",
    "title": "Chapter 3 — A Few Matters of Form",
    "image": "",
    "tags": [
      "book",
      "mba"
    ],
    "description": "Colloquialisms. If you use a colloquialism or a slang word or phrase, simply use it; do not draw attention to it by enclosing it in quotation marks. To do so is to put on airs, as though you were inviting the reader to join you in a select society of those who know better.",
    "content": "Chapter 3 — A Few Matters of Form Colloquialisms. If you use a colloquialism or a slang word or phrase, simply use it; do not draw attention to it by enclosing it in quotation marks. To do so is to put on airs, as though you were inviting the reader to join you in a select society of those who know better. Exclamations. Do not attempt to emphasize simple statements by using a mark of exclamation. It was a wonderful show! »»»»» It was a wonderful show The exclamation mark is to be reserved for use after true exclamations or commands. What a wonderful show!Halt! Headings. If a manuscript is to be submitted for publication, leave plenty of space at the top of page 1. The editor will need this space to write directions to the compositor. Place the heading, or title, at least a fourth of the way down the page. Leave a blank line, or its equivalent in space, after the heading. On succeeding pages, begin near the top, but not so near as to give a crowded appearance. Omit the period after a title or heading. A question mark or an exclamation point may be used if the heading calls for it. Hyphen. When two or more words are combined to form a compound adjective, a hyphen is usually required. “He belonged to the leisure class and enjoyed leisure-class pursuits.” “She entered her boat in the round-the-island race.” o not use a hyphen between words that can better be written as one word: water-fowl, waterfowl. Common sense will aid you in the decision, but a dictionary is more reliable. The steady evolution of the language seems to favor union: two words eventually become one, usually after a period of hyphenation. bed chamber »»»»» bed-chamber »»»»» bedchamberwild life »»»»» wild-life »»»»» wildlifebell boy »»»»» bell-boy »»»»» bellboy The hyphen can play tricks on the unwary, as it did in Chattanooga when two newspapers merged — the News and the Free Press. Someone introduced a hyphen into the merger, and the paper became The Chattanooga News-Free Press, which sounds as though the paper were news-free, or devoid of news. Obviously, we ask too much of a hyphen when we ask it to cast its spell over words it does not adjoin. Margins. Keep righthand and lefthand margins roughly the same width. Exception: If a great deal of annotating or editing is anticipated, the lefthand margin should be roomy enough to accommodate this work. Numerals. Do not spell out dates or other serial numbers. Write them in figures or in Roman notation, as appropriate. August 9, 1988Part XIIRule 3352d Infantry Exception: When they occur in dialogue, most dates and numbers are best spelled out. “I arrived home on August ninth.”“In the year 1990, I turned twenty-one.”“Read Chapter Twelve.” Parentheses. A sentence containing an expression in parentheses is punctuated outside the last mark of parenthesis exactly as if the parenthetical expression were absent. The expression within the marks is punctuated as if it stood by itself, except that the final stop is omitted unless it is a question mark or an exclamation point. I went to her house yesterday (my third attempt to see her), but she had left town.He declares (and why should we doubt his good faith?) that he is now certain of success. (When a wholly detached expression or sentence is parenthesized, the final stop comes before the last mark of parenthesis.) Quotations. Formal quotations cited as documentary evidence are introduced by a colon and enclosed in quotation marks. The United States Coast Pilot has this to say of the place: “Bracy Cove, 0.5 mile eastward of Bear Island, is exposed to southeast winds, has a rocky and uneven bottom, and is unfit for anchorage.” A quotation grammatically in apposition or the direct object of a verb is preceded by a comma and enclosed in quotation marks. I am reminded of the advice of my neighbor, “Never worry about your heart till it stops beating.”Mark Twain says, “A classic is something that everybody wants to have read and nobody wants to read.” When a quotation is followed by an attributive phrase, the comma is enclosed within the quotation marks. “I can’t attend,” she said. Typographical usage dictates that the comma be inside the marks, though logically it often seems not to belong there. “The Fish,” “Poetry,” and “The Monkeys” are in Marianne Moore’s Selected Poems. When quotations of an entire line, or more, of either verse or prose are to be distinguished typographically from text matter, as are the quotations in this book, begin on a fresh line and indent. Quotation marks should not be used unless they appear in the original, as in dialogue. Wordsworth’s enthusiasm for the French Revolution was at first unbounded:Bliss was it in that dawn to be alive,But to be young was very heaven! Quotations introduced by that are indirect discourse and not enclosed in quotation marks. Keats declares that beauty is truth, truth beauty.Dickinson states that a coffin is a small domain. Proverbial expressions and familiar phrases of literary origin require no quotation marks. These are the times that try men’s souls.He lives far from the madding crowd. References. In scholarly work requiring exact references, abbreviate titles that occur frequently, giving the full forms in an alphabetical list at the end. As a general practice, give the references in parentheses or in footnotes, not in the body of the sentence. Omit the words act, scene, line, book, volume, page, except when referring to only one of them. Punctuate as indicated below. in the second scene of the third act »»»»» in III.ii (Better still, simply insert m.ii in parentheses at the proper place in the sentence.)After the killing of Polonius, Hamlet is placed under guard (IV.ii.14).2 Samuel i: 17-27Othello II.iii. 264-267, III.iii. 155-161 Syllabication. When a word must be divided at the end of a line, consult a dictionary to learn the syllables between which division should be made. The student will do well to examine the syllable division in a number of pages of any carefully printed book. Titles. For the titles of literary works, scholarly usage prefers italics with capitalized initials. The usage of editors and publishers varies, some using italics with capitalized initials, others using Roman with capitalized initials and with or without quotation marks. Use italics (indicated in manuscript by underscoring) except in writing for a periodical that follows a different practice. Omit initial A or The from titles when you place the possessive before them. A Tale of Two Cities; Dickens’s Tale of Two Cities.The Age of Innocence; Wharton’s Age of Innocence.",
    "date": "2024-07-15T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/the-elements-of-style/chapter-2-elementary-principles-of-composition",
    "title": "Chapter 2 — Elementary Principles of Composition",
    "image": "",
    "tags": [
      "book",
      "mba"
    ],
    "description": "A basic structural design underlies every kind of writing. Writers will in part follow this design, in part deviate from it, according to their skills, their needs, and the unexpected events that accompany the act of composition. Writing, to be effective, must follow closely the thoughts of the writer, but not necessarily in the order in which those thoughts occur. This calls for a scheme of procedure. In some cases, the best design is no design, as with a love letter, which is simply an outpouring, or with a casual essay, which is a ramble. But in most cases, planning must be a deliberate prelude to writing. The first principle of composition, therefore, is to foresee or determine the shape of what is to come and pursue that shape.",
    "content": "Chapter 2 — Elementary Principles of Composition 12. Choose a suitable design and hold to it. A basic structural design underlies every kind of writing. Writers will in part follow this design, in part deviate from it, according to their skills, their needs, and the unexpected events that accompany the act of composition. Writing, to be effective, must follow closely the thoughts of the writer, but not necessarily in the order in which those thoughts occur. This calls for a scheme of procedure. In some cases, the best design is no design, as with a love letter, which is simply an outpouring, or with a casual essay, which is a ramble. But in most cases, planning must be a deliberate prelude to writing. The first principle of composition, therefore, is to foresee or determine the shape of what is to come and pursue that shape. A sonnet is built on a fourteen-line frame, each line containing five feet. Hence, sonneteers know exactly where they are headed, although they may not know how to get there. Most forms of composition are less clearly defined, more flexible, but all have skeletons to which the writer will bring the flesh and the blood. The more clearly the writer perceives the shape, the better are the chances of success. 13. Make the paragraph the unit of composition: one paragraph to each topic. The paragraph is a convenient unit; it serves all forms of literary work. As long as it holds together, a paragraph may be of any length — a single, short sentence or a passage of great duration. If the subject on which you are writing is of slight extent, or if you intend to treat it briefly, there may be no need to divide it into topics. Thus, a brief description, a brief book review, a brief account of a single incident, a narrative merely outlining an action, the setting forth of a single idea — any one of these is best written in a single paragraph. After the paragraph has been written, examine it to see whether division will improve it. Ordinarily, however, a subject requires division into topics, each of which should be dealt with in a paragraph. The object of treating each topic in a paragraph by itself is, of course, to aid the reader. The beginning of each paragraph is a signal that a new step in the development of the subject has been reached. As a rule, single sentences should not be written or printed as paragraphs. An exception may be made of sentences of transition, indicating the relation between the parts of an exposition or argument In dialogue, each speech, even if only a single word, is usually a paragraph by itself; that is, a new paragraph begins with each change of speaker. The application of this rule when dialogue and narrative are combined is best learned from examples in well-edited works of fiction. Sometimes a writer, seeking to create an effect of rapid talk or for some other reason, will elect not to set off each speech in a separate paragraph and instead will run speeches together. The common practice, however, and the one that serves best in most instances, is to give each speech a paragraph of its own. As a rule, begin each paragraph either with a sentence that suggests the topic or with a sentence that helps the transition. If a paragraph forms part of a larger composition, its relation to what precedes, or its function as a part of the whole, may need to be expressed. This can sometimes be done by a mere word or phrase (again, therefore, for the same reason) in the first sentence. Sometimes, however, it is expedient to get into the topic slowly, by way of a sentence or two of introduction or transition. In narration and description, the paragraph sometimes begins with a concise, comprehensive statement serving to hold together the details that follow. The breeze served us admirably.The campaign opened with a series of reverses.The next ten or twelve pages were filled with a curious set of entries. But when this device, or any device, is too often used, it becomes a mannerism. More commonly, the opening sentence simply indicates by its subject the direction the paragraph is to take. At length I thought I might return toward the stockade.He picked up the heavy lamp from the table and began to explore.Another flight of steps, and they emerged on the roof. In animated narrative, the paragraphs are likely to be short and without any semblance of a topic sentence, the writer rushing headlong, event following event in rapid succession. The break between such paragraphs merely serves the purpose of a rhetorical pause, throwing into prominence some detail of the action. In general, remember that paragraphing calls for a good eye as well as a logical mind. Enormous blocks of print look formidable to readers, who are often reluctant to tackle them. Therefore, breaking long paragraphs in two, even if it is not necessary to do so for sense, meaning, or logical development, is often a visual help. But remember, too, that firing off many short paragraphs in quick succession can be distracting. Paragraph breaks used only for show read like the writing of commerce or of display advertising. Moderation and a sense of order should be the main considerations in paragraphing. 14. Use the active voice. The active voice is usually more direct and vigorous than the passive: I shall always remember my first visit to Boston. This is much better than My first visit to Boston will always be remembered by me. The latter sentence is less direct, less bold, and less concise. If the writer tries to make it more concise by omitting “by me,” My first visit to Boston will always be remembered, it becomes indefinite: is it the writer or some undisclosed person or the world at large that will always remember this visit? This rule does not, of course, mean that the writer should entirely discard the passive voice, which is frequently convenient and sometimes necessary. The dramatists of the Restoration are little esteemed today.Modern readers have little esteem for the dramatists of the Restoration. The first would be the preferred form in a paragraph on the dramatists of the Restoration, the second in a paragraph on the tastes of modern readers. The need to make a particular word the subject of the sentence will often, as in these examples, determine which voice is to be used. The habitual use of the active voice, however, makes for forcible writing. This is true not only in narrative concerned principally with action but in writing of any kind. Many a tame sentence of description or exposition can be made lively and emphatic by substituting a transitive in the active voice for some such perfunctory expression as there is or could be heard. There were a great number of dead leaves lying on the ground. »»»»» Dead leaves covered the ground.At dawn the crowing of a rooster could be heard. »»»»» The cock’s crow came with dawn.The reason he left college was that his health became impaired. »»»»» Failing health compelled him to leave college.It was not long before she was very sorry that she had said what she had. »»»»» She soon repented her words. Note, in the examples above, that when a sentence is made stronger, it usually becomes shorter. Thus, brevity is a by-product of vigor. 15. Put statements in positive form. Make definite assertions. Avoid tame, colorless, hesitating, noncommittal language. Use the word not as a means of denial or in antithesis, never as a means of evasion. He was not very often on time. »»»»» He usually came late.She did not think that studying Latin was a sensible way to use one’s time. »»»»» She thought the study of Latin a waste of time.The Taming of the Shrew is rather weak in spots. Shakespeare does not portray Katharine as a very admirable character, nor does Bianca remain long in memory as an important character in Shakespeare’s works. »»»»» The women in The Taming of the Shrew are unattractive. Katharine is disagreeable, Bianca insignificant. The last example, before correction, is indefinite as well as negative. The corrected version, consequently, is simply a guess at the writer’s intention. All three examples show the weakness inherent in the word not. Consciously or unconsciously, the reader is dissatisfied with being told only what is not; the reader wishes to be told what is. Hence, as a rule, it is better to express even a negative in positive form. not honest »»»»» dishonestnot important »»»»» triflingdid not remember »»»»» forgotdid not pay any attention to »»»»» ignoreddid not have much confidence in »»»»» distrusted Placing negative and positive in opposition makes for a stronger structure. Not charity, but simple justice.Not that I loved Caesar less, but that I loved Rome more.Ask not what your country can do for you — ask what you can do for your country. Negative words other than not are usually strong. Her loveliness I never knew / Until she smiled on me. Statements qualified with unnecessary auxiliaries or conditionals sound irresolute. If you would let us know the time of your arrival, we would be happy to arrange your transportation from the airport. »»»»» If you will let us know the time of your arrival, we shall be happy to arrange your transportation from the airport.Applicants can make a good impression by being neat and punctual. »»»»» Applicants will make a good impression if they are neat and punctual.Plath may be ranked among those modem poets who died young. »»»»» Plath was one of those modern poets who died young. If your every sentence admits a doubt, your writing will lack authority. Save the auxiliaries would, should, could, may, might, and can for situations involving real uncertainty. 16. Use definite, specific, concrete language. Prefer the specific to the general, the definite to the vague, the concrete to the abstract. A period of unfavorable weather set in. »»»»» It rained every day for a week.He showed satisfaction as he took possession of his well-earned reward. »»»»» He grinned as he pocketed the coin. If those who have studied the art of writing are in accord on any one point, it is this: the surest way to arouse and hold the readers attention is by being specific, definite, and concrete. The greatest writers — Homer, Dante, Shakespeare — are effective largely because they deal in particulars and report the details that matter. Their words call up pictures. Jean Stafford, to cite a more modern author, demonstrates in her short story “In the Zoo” how prose is made vivid by the use of words that evoke images and sensations: ...Daisy and I in time found asylum in a small menagerie down by the railroad tracks. It belonged to a gentle alcoholic ne’er-do- well, who did nothing all day long but drink bathtub gin in rickeys and play solitaire and smile to himself and talk to his animals. He had a little, stunted red vixen and a deodorized skunk, a parrot from Tahiti that spoke Parisian French, a woebegone coyote, and two capuchin monkeys, so serious and humanized, so small and sad and sweet, and so religious-looking with their tonsured heads that it was impossible not to think their gibberish was really an ordered language with a grammar that someday some philologist would understand.Gran knew about our visits to Mr. Murphy and she did not object, for it gave her keen pleasure to excoriate him when we came home. His vice was not a matter of guesswork; it was an established fact that he was half-seas over from dawn till midnight. “With the black Irish,” said Gran, “the taste for drink is taken in with the mother’s milk and is never mastered. Oh, I know all about those promises to join the temperance movement and not to touch another drop. The way to Hell is paved with good intentions.”(Excerpt from “In the Zoo” from Bad Characters by Jean Stafford.) If the experiences of Walter Mitty, of Molly Bloom, of Rabbit Angstrom have seemed for the moment real to countless readers, if in reading Faulkner we have almost the sense of inhabiting Yoknapatawpha County during the decline of the South, it is because the details used are definite, the terms concrete. It is not that every detail is given — that would be impossible, as well as to no purpose — but that all the significant details are given, and with such accuracy and vigor that readers, in imagination, can project themselves into the scene. In exposition and in argument, the writer must likewise never lose hold of the concrete; and even when dealing with general principles, the writer must furnish particular instances of their application. In his Philosophy of Style, Herbert Spencer gives two sentences to illustrate how the vague and general can be turned into the vivid and particular: In proportion as the manners, customs, and amusements of a nation are cruel and barbarous, the regulations of their penal code will be severe. »»»»» In proportion as men delight in battles, bullfights, and combats of gladiators, will they punish by hanging, burning, and the rack. To show what happens when strong writing is deprived of its vigor, George Orwell once took a passage from the Bible and drained it of its blood. On the left, below, is Orwell’s translation; on the right, the verse from Ecclesiastes (King James Version). Objective consideration of contemporary phenomena compels the conclusion that success or failure in competitive activities exhibits no tendency to be commensurate with innate capacity, but that a considerable element of the unpredictable must inevitably be taken into account. »»»»» I returned, and saw under the sun, that the race is not to the swift, nor the battle to the strong, neither yet bread to the wise, nor yet riches to men of understanding, nor yet favor to men of skill; but time and chance happeneth to them all. 17. Omit needless words. Vigorous writing is concise. A sentence should contain no unnecessary words, a paragraph no unnecessary sentences, for the same reason that a drawing should have no unnecessary lines and a machine no unnecessary parts. This requires not that the writer make all sentences short, or avoid all detail and treat subjects only in outline, but that every word tell. Many expressions in common use violate this principle. the question as to whether »»»»» whether (the question whether)there is no doubt but that »»»»» no doubt (doubtless)used for fuel purposes »»»»» used for fuelhe is a man who »»»»» hein a hasty manner »»»»» hastilythis is a subject that »»»»» this subjectHer story is a strange one. »»»»» Her story is strange.the reason why is that »»»»» because The fact that is an especially debilitating expression. It should be revised out of every sentence in which it occurs. owing to the fact that »»»»» since (because)in spite of the fact that »»»»» though (although)call your attention to the fact that »»»»» remind you (notify you)I was unaware of the fact that »»»»» I was unaware that (did not know)the fact that he had not succeeded »»»»» his failurethe fact that I had arrived »»»»» my arrival See also the words case, character, nature in Chapter IV. Who is, which was, and the like are often superfluous. His cousin, who is a member of the same firm »»»»» His cousin, a member of the same firmTrafalgar, which was Nelson’s last battle »»»»» Trafalgar, Nelson’s last battle As the active voice is more concise than the passive, and a positive statement more concise than a negative one, many of the examples given under Rules 14 and 15 illustrate this rule as well. A common way to fall into wordiness is to present a single complex idea, step by step, in a series of sentences that might to advantage be combined into one. Macbeth was very ambitious. This led him to wish to become king of Scotland. The witches told him that this wish of his would come true. The king of Scotland at this time was Duncan. Encouraged by his wife, Macbeth murdered Duncan. He was thus enabled to succeed Duncan as king. (51 words) »»»»» Encouraged by his wife, Macbeth achieved his ambition and realized the prediction of the witches by murdering Duncan and becoming king of Scotland in his place. (26 words) 18. Avoid a succession of loose sentences. This rule refers especially to loose sentences of a particular type: those consisting of two clauses, the second introduced by a conjunction or relative. A writer may err by making sentences too compact and periodic. An occasional loose sentence prevents the style from becoming too formal and gives the reader a certain relief. Consequently, loose sentences are common in easy, unstudied writing. The danger is that there may be too many of them. An unskilled writer will sometimes construct a whole paragraph of sentences of this kind, using as connectives and, but, and, less frequently, who, which, when, where, and while, these last in nonrestrictive senses. (See Rule 3.) The third concert of the subscription series was given last evening, and a large audience was in attendance. Mr. Edward Appleton was the soloist, and the Boston Symphony Orchestra furnished the instrumental music. The former showed himself to be an artist of the first rank, while the latter proved itself fully deserving of its high reputation. The interest aroused by the series has been very gratifying to the Committee, and it is planned to give a similar series annually hereafter. The fourth concert will be given on Tuesday, May 10, when an equally attractive program will be presented. Apart from its triteness and emptiness, the paragraph above is bad because of the structure of its sentences, with their mechanical symmetry and singsong. Compare these sentences from the chapter “What I Believe” in E. M. Forster’s Two Cheers for Democracy: I believe in aristocracy, though — if that is the right word, and if a democrat may use it. Not an aristocracy of power, based upon rank and influence, but an aristocracy of the sensitive, the considerate and the plucky. Its members are to be found in all nations and classes, and all through the ages, and there is a secret understanding between them when they meet. They represent the true human tradition, the one permanent victory of our queer race over cruelty and chaos. Thousands of them perish in obscurity, a few are great names. They are sensitive for others as well as for themselves, they are considerate without being fussy, their pluck is not swankiness but the power to endure, and they can take a joke. A writer who has written a series of loose sentences should recast enough of them to remove the monotony, replacing them with simple sentences, sentences of two clauses joined by a semicolon, periodic sentences of two clauses, or sentences (loose or periodic) of three clauses — whichever best represent the real relations of the thought. 19. Express coordinate ideas in similar form. This principle, that of parallel construction, requires that expressions similar in content and function be outwardly similar. The likeness of form enables the reader to recognize more readily the likeness of content and function. The familiar Beatitudes exemplify the virtue of parallel construction. Blessed are the poor in spirit: for theirs is the kingdom of heaven.Blessed are they that mourn: for they shall be comforted.Blessed are the meek: for they shall inherit the earth.Blessed are they which do hunger and thirst after righteousness: for they shall be filled. The unskilled writer often violates this principle, mistakenly believing in the value of constantly varying the form of expression. When repeating a statement to emphasize it, the writer may need to vary its form. Otherwise, the writer should follow the principle of parallel construction. Formerly, science was taught by the textbook method, while now the laboratory method is employed. »»»»» Formerly, science was taught by the textbook method; now it is taught by the laboratory method. The lefthand version gives the impression that the writer is undecided or timid, apparently unable or afraid to choose one form of expression and hold to it. The righthand version shows that the writer has at least made a choice and abided by it. By this principle, an article or a preposition applying to all the members of a series must either be used only before the first term or else be repeated before each term. The French, the Italians, Spanish, and Portuguese »»»»» The French, the Italians, the Spanish, and the PortugueseIn spring, summer, or in winter »»»»» In spring, summer, or winter (In spring, in summer, or in winter) Some words require a particular preposition in certain idiomatic uses. When such words are joined in a compound construction, all the appropriate prepositions must be included, unless they are the same. His speech was marked by disagreement and scorn for his opponent’s position. »»»»» His speech was marked by disagreement with and scorn for his opponent’s position. Correlative expressions (both, and; not, but; not only, but also; either, or; first, second, third; and the like) should be followed by the same grammatical construction. Many violations of this rule can be corrected by rearranging the sentence. It was both a long ceremony and very tedious. »»»»» The ceremony was both long and tedious.A time not for words but action. »»»»» A time not for words but for action.Either you must grant his request or incur his ill will. »»»»» You must either grant his request or incur his ill will.My objections are, first, the injustice of the measure; second, that it is unconstitutional. »»»»» My objections are, first, that the measure is unjust; second, that it is unconstitutional. It may be asked, what if you need to express a rather large number of similar ideas — say, twenty? Must you write twenty consecutive sentences of the same pattern? On closer examination, you will probably find that the difficulty is imaginary — that these twenty ideas can be classified in groups, and that you need apply the principle only within each group. Otherwise, it is best to avoid the difficulty by putting statements in the form of a table. 20. Keep related words together. The position of the words in a sentence is the principal means of showing their relationship. Confusion and ambiguity result when words are badly placed. The writer must, therefore, bring together the words and groups of words that are related in thought and keep apart those that are not so related. He noticed a large stain in the rug that was right in the center. »»»»» He noticed a large stain right in the center of the rug.You can call your mother in London and tell her all about George’s taking you out to dinner for just two dollars. »»»»» For just two dollars you can call your mother in London and tell her all about George’s taking you out to dinner.New York’s first commercial human-sperm bank opened Friday with semen samples from eighteen men frozen in a stainless steel tank. »»»»» New York’s first commercial human- sperm bank opened Friday when semen samples were taken from eighteen men. The samples were then frozen and stored in a stainless steel tank. In the lefthand version of the first example, the reader has no way of knowing whether the stain was in the center of the rug or the rug was in the center of the room. In the lefthand version of the second example, the reader may well wonder which cost two dollars — the phone call or the dinner. In the lefthand version of the third example, the reader’s heart goes out to those eighteen poor fellows frozen in a steel tank. The subject of a sentence and the principal verb should not, as a rule, be separated by a phrase or clause that can be transferred to the beginning. Toni Morrison, in Beloved, writes about characters who have escaped from slavery but are haunted by its heritage. »»»»» In Beloved, Toni Morrison writes about characters who have escaped from slavery but are haunted by its heritage.A dog, if you fail to discipline him, becomes a household pest. »»»»» Unless disciplined, a dog becomes a household pest. Interposing a phrase or a clause, as in the lefthand examples above, interrupts the flow of the main clause. This interruption, however, is not usually bothersome when the flow is checked only by a relative clause or by an expression in apposition. Sometimes, in periodic sentences, the interruption is a deliberate device for creating suspense. (See examples under Rule 22.) The relative pronoun should come, in most instances, immediately after its antecedent. There was a stir in the audience that suggested disapproval. »»»»» A stir that suggested disapproval swept the audience.He wrote three articles about his adventures in Spain, which were published in Harper’s Magazine. »»»»» He published three articles in Harper’s Magazine about his adventures in Spain.This is a portrait of Benjamin Harrison, who became President in 1889. He was the grandson of William Henry Harrison. »»»»» This is a portrait of Benjamin Harrison, grandson of William Henry Harrison, who became President in 1889. If the antecedent consists of a group of words, the relative comes at the end of the group, unless this would cause ambiguity. The Superintendent of the Chicago Division, who No ambiguity results from the above. But A proposal to amend the Sherman Act, which has been variously judged leaves the reader wondering whether it is the proposal or the Act that has been variously judged. The relative clause must be moved forward, to read, “A proposal, which has been variously judged, to amend the Sherman Act....” Similarly The grandson of William Henry Harrison, who »»»»» William Henry Harrison’s grandson, Benjamin Harrison, who A noun in apposition may come between antecedent and relative, because in such a combination no real ambiguity can arise. The Duke of York, his brother, who was regarded with hostility by the Whigs Modifiers should come, if possible, next to the words they modify. If several expressions modify the same word, they should be arranged so that no wrong relation is suggested. All the members were not present. »»»»» Not all the members were present.She only found two mistakes. »»»»» She found only two mistakes.The director said he hoped all members would give generously to the Fund at a meeting of the committee yesterday. »»»»» At a meeting of the committee yesterday, the director said he hoped all members would give generously to the Fund.Major R. E. Joyce will give a lecture on Tuesday evening in Bailey Hall, to which the public is invited on “My Experiences in Mesopotamia” at 8:00 P.M. »»»»» On Tuesday evening at eight, Major R. E. Joyce will give a lecture in Bailey Hall on “My Experiences in Mesopotamia.” The public is invited. Note, in the last lefthand example, how swiftly meaning departs when words are wrongly juxtaposed. 21. In summaries, keep to one tense. In summarizing the action of a drama, use the present tense. In summarizing a poem, story, or novel, also use the present, though you may use the past if it seems more natural to do so. If the summary is in the present tense, antecedent action should be expressed by the perfect; if in the past, by the past perfect. Chance prevents Friar John from delivering Friar Lawrence’s letter to Romeo. Meanwhile, owing to her father’s arbitrary change of the day set for her wedding, Juliet has been compelled to drink the potion on Tuesday night, with the result that Balthasar informs Romeo of her supposed death before Friar Lawrence learns of the nondelivery of the letter. But whichever tense is used in the summary, a past tense in indirect discourse or in indirect question remains unchanged. The Friar confesses that it was he who married them. Apart from the exceptions noted, the writer should use the same tense throughout. Shifting from one tense to another gives the appearance of uncertainty and irresolution. In presenting the statements or the thought of someone else, as in summarizing an essay or reporting a speech, do not overwork such expressions as “he said,” “she stated,” “the speaker added,” “the speaker then went on to say,” “the author also thinks.” Indicate clearly at the outset, once for all, that what follows is summary, and then waste no words in repeating the notification. In notebooks, in newspapers, in handbooks of literature, summaries of one kind or another may be indispensable, and for children in primary schools retelling a story in their own words is a useful exercise. But in the criticism or interpretation of literature, be careful to avoid dropping into summary. It may be necessary to devote one or two sentences to indicating the subject, or the opening situation, of the work being discussed, or to cite numerous details to illustrate its qualities. But you should aim at writing an orderly discussion supported by evidence, not a summary with occasional comment. Similarly, if the scope of the discussion includes a number of works, as a rule it is better not to take them up singly in chronological order but to aim from the beginning at establishing general conclusions. 22. Place the emphatic words of a sentence at the end. The proper place in the sentence for the word or group of words that the writer desires to make most prominent is usually the end. Humanity has hardly advanced in fortitude since that time, though it has advanced in many other ways. »»»»» Since that time, humanity has advanced in many ways, but it has hardly advanced in fortitude.This steel is principally used for making razors, because of its hardness. »»»»» Because of its hardness, this steel is used principally for making razors. The word or group of words entitled to this position of prominence is usually the logical predicate — that is, the new element in the sentence, as it is in the second example. The effectiveness of the periodic sentence arises from the prominence it gives to the main statement. Four centuries ago, Christopher Columbus, one of the Italian mariners whom the decline of their own republics had put at the service of the world and of adventure, seeking for Spain a westward passage to the Indies to offset the achievement of Portuguese discoverers, lighted on America.With these hopes and in this belief I would urge you, laying aside all hindrance, thrusting away all private aims, to devote yourself unswervingly and unflinchingly to the vigorous and successful prosecution of this war. The other prominent position in the sentence is the beginning. Any element in the sentence other than the subject becomes emphatic when placed first. Deceit or treachery she could never forgive.Vast and rude, fretted by the action of nearly three thousand years, the fragments of this architecture may often seem, at first sight, like works of nature.Home is the sailor. A subject coming first in its sentence may be emphatic, but hardly by its position alone. In the sentence Great kings worshiped at his shrine the emphasis upon kings arises largely from its meaning and from the context. To receive special emphasis, the subject of a sentence must take the position of the predicate. Through the middle of the valley flowed a winding stream. The principle that the proper place for what is to be made most prominent is the end applies equally to the words of a sentence, to the sentences of a paragraph, and to the paragraphs of a composition.",
    "date": "2024-07-14T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/the-elements-of-style/chapter-1-elementary-rules-of-usage",
    "title": "Chapter 1 — Elementary Rules of Usage",
    "image": "",
    "tags": [
      "book",
      "mba"
    ],
    "description": "Follow this rule whatever the final consonant. Thus write,",
    "content": "Chapter 1 — Elementary Rules of Usage 1. Form the possessive singular of nouns by adding ‘s. Follow this rule whatever the final consonant. Thus write, Charles’s friendBurns’s poemsthe witch’s malice Exceptions are the possessive of ancient proper names in -es and -is, the possessive Jesus’, and such forms as for conscience’ sake, for righteousness’ sake. But such forms as Achilles’ heel, Moses’ laws, Isis’ temple are commonly replaced by the laws of Mosesthe temple of Isis The pronominal possessives hers, its, theirs, yours, and ours have no apostrophe. Indefinite pronouns, however, use the apostrophe to show possession. one’s rightssomebody else’s umbrella A common error is to write it’s for its, or vice versa. The first is a contraction, meaning “it is.” The second is a possessive. It’s a wise dog that scratches its own fleas. 2. In a series of three or more terms with a single conjunction, use a comma after each term except the last. Thus write, red, white, and bluegold, silver, or copperHe opened the letter, read it, and made a note of its contents. This comma is often referred to as the “serial” comma. In the names of business firms the last comma is usually omitted. Follow the usage of the individual firm. Little, Brown and CompanyDonaldson, Lufkin & Jenrette 3. Enclose parenthetic expressions between commas. The best way to see a country, unless you are pressed for time, is to travel on foot. This rule is difficult to apply; it is frequently hard to decide whether a single word, such as however, or a brief phrase is or is not parenthetic. If the interruption to the flow of the sentence is but slight, the commas may be safely omitted. But whether the interruption is slight or considerable, never omit one comma and leave the other. There is no defense for such punctuation as Marjories husband, Colonel Nelson paid us a visit yesterday. or My brother you will be pleased to hear, is now in perfect health. Dates usually contain parenthetic words or figures. Punctuate as follows: February to July, 1992April 6, 1986Wednesday, November 14, 1990 Note that it is customary to omit the comma in 6 April 1988 The last form is an excellent way to write a date; the figures are separated by a word and are, for that reason, quickly grasped. A name or a title in direct address is parenthetic. If, Sir, you refuse, I cannot predict what will happen.Well, Susan, this is a fine mess you are in. The abbreviations etc., i.e., and e.g., the abbreviations for academic degrees, and titles that follow a name are parenthetic and should be punctuated accordingly. Letters, packages, etc., should go here.Horace Fulsome, Ph.D., presided.Rachel Simonds, AttorneyThe Reverend Harry Lang, S.J. No comma, however, should separate a noun from a restrictive term of identification. Billy the KidThe novelist Jane AustenWilliam the ConquerorThe poet Sappho Although Junior, with its abbreviation Jr., has commonly been regarded as parenthetic, logic suggests that it is, in fact, restrictive and therefore not in need of a comma. James Wright Jr. Nonrestrictive relative clauses are parenthetic, as are similar clauses introduced by conjunctions indicating time or place. Commas are therefore needed. A nonrestrictive clause is one that does not serve to identify or define the antecedent noun. The audience, which had at first been indifferent, became more and more interested.In 1769, when Napoleon was born, Corsica had but recently been acquired by France.Nether Stowey, where Coleridge wrote The Rime of the Ancient Mariner, is a few miles from Bridgewater. In these sentences, the clauses introduced by which, when, and where are nonrestrictive; they do not limit or define, they merely add something. In the first example, the clause introduced by which does not serve to tell which of several possible audiences is meant; the reader presumably knows that already. The clause adds, parenthetically, a statement supplementing that in the main clause. Each of the three sentences is a combination of two statements that might have been made independently. The audience was at first indifferent. Later it became more and more interested.Napoleon was born in 1769. At that time Corsica had but recently been acquired by France.Coleridge wrote The Rime of the Ancient Mariner at Nether Stowey. Nether Stowey is a few miles from Bridgewater. Restrictive clauses, by contrast, are not parenthetic and are not set off by commas. Thus, People who live in glass houses shouldn’t throw stones. Here the clause introduced by who does serve to tell which people are meant; the sentence, unlike the sentences above, cannot be split into two independent statements. The same principle of comma use applies to participial phrases and to appositives. People sitting in the rear couldn’t hear, (restrictive)Uncle Bert, being slightly deaf, moved forward, (non-restrictive)My cousin Bob is a talented harpist, (restrictive)Our oldest daughter, Mary, sings, (nonrestrictive) When the main clause of a sentence is preceded by a phrase or a subordinate clause, use a comma to set off these elements. Partly by hard fighting, partly by diplomatic skill, they enlarged their dominions to the east and rose to royal rank with the possession of Sicily. 4. Place a comma before a conjunction introducing an independent clause. The early records of the city have disappeared, and the story of its first years can no longer be reconstructed.The situation is perilous, but there is still one chance of escape. Two-part sentences of which the second member is introduced by as (in the sense of “because”), for, or, nor, or while (in the sense of “and at the same time”) likewise require a comma before the conjunction. If a dependent clause, or an introductory phrase requiring to be set off by a comma, precedes the second independent clause, no comma is needed after the conjunction. The situation is perilous, but if we are prepared to act promptly, there is still one chance of escape. When the subject is the same for both clauses and is expressed only once, a comma is useful if the connective is but. When the connective is and, the comma should be omitted if the relation between the two statements is close or immediate. I have heard the arguments, but am still unconvinced.He has had several years’ experience and is thoroughly competent. 5. Do not join independent clauses with a comma. If two or more clauses grammatically complete and not joined by a conjunction are to form a single compound sentence, the proper mark of punctuation is a semicolon. Mary Shelley’s works are entertaining; they are full of engaging ideas.It is nearly half past five; we cannot reach town before dark. It is, of course, equally correct to write each of these as two sentences, replacing the semicolons with periods. Mary Shelley’s works are entertaining. They are full of engaging ideas.It is nearly half past five. We cannot reach town before dark. If a conjunction is inserted, the proper mark is a comma. (Rule 4.) Mary Shelley’s works are entertaining, for they are full of engaging ideas.It is nearly half past five, and we cannot reach town before dark. A comparison of the three forms given above will show clearly the advantage of the first. It is, at least in the examples given, better than the second form because it suggests the close relationship between the two statements in a way that the second does not attempt, and better than the third because it is briefer and therefore more forcible. Indeed, this simple method of indicating relationship between statements is one of the most useful devices of composition. The relationship, as above, is commonly one of cause and consequence. Note that if the second clause is preceded by an adverb, such as accordingly, besides, then, therefore, or thus, and not by a conjunction, the semicolon is still required. I had never been in the place before; besides, it was dark as a tomb. An exception to the semicolon rule is worth noting here. A comma is preferable when the clauses are very short and alike in form, or when the tone of the sentence is easy and conversational. Man proposes, God disposes.The gates swung apart, the bridge fell, the portcullis was drawn up.I hardly knew him, he was so changed.Here today, gone tomorrow. 6. Do not break sentences in two. In other words, do not use periods for commas. I met them on a Cunard liner many years ago. Coming home from Liverpool to New York.She was an interesting talker. A woman who had traveled all over the world and lived in half a dozen countries. In both these examples, the first period should be replaced by a comma and the following word begun with a small letter. It is permissible to make an emphatic word or expression serve the purpose of a sentence and to punctuate it accordingly: Again and again he called out. No reply. The writer must, however, be certain that the emphasis is warranted, lest a clipped sentence seem merely a blunder in syntax or in punctuation. Generally speaking, the place for broken sentences is in dialogue, when a character happens to speak in a clipped or fragmentary way. Rules 3, 4, 5, and 6 cover the most important principles that govern punctuation. They should be so thoroughly mastered that their application becomes second nature. 7. Use a colon after an independent clause to introduce a list of particulars, an appositive, an amplification, or an illustrative quotation. A colon tells the reader that what follows is closely related to the preceding clause. The colon has more effect than the comma, less power to separate than the semicolon, and more formality than the dash. It usually follows an independent clause and should not separate a verb from its complement or a preposition from its object. The examples in the lefthand column, below, are wrong; they should be rewritten as in the righthand column. Your dedicated whittler requires: a knife, a piece of wood, and a back porch.Understanding is that penetrating quality of knowledge that grows from: theory, practice, conviction, assertion, error, and humiliation.Your dedicated whittler requires three props: a knife, a piece of wood, and a back porch.Understanding is that penetrating quality of knowledge that grows from theory, practice, conviction, assertion, error, and humiliation. Join two independent clauses with a colon if the second interprets or amplifies the first. But even so, there was a directness and dispatch about animal burial: there was no stopover in the undertaker’s foul parlor, no wreath or spray. A colon may introduce a quotation that supports or contributes to the preceding clause. The squalor of the streets reminded her of a line from Oscar Wilde: “We are all in the gutter, but some of us are looking at the stars.” The colon also has certain functions of form: to follow the salutation of a formal letter, to separate hour from minute in a notation of time, and to separate the title of a work from its subtitle or a Bible chapter from a verse. Dear Mr. Montague:departs at 10:48 P.M.Practical Calligraphy: An Introduction to Italic ScriptNehemiah 11:7 8. Use a dash to set off an abrupt break or interruption and to announce a long appositive or summary. A dash is a mark of separation stronger than a comma, less formal than a colon, and more relaxed than parentheses. His first thought on getting out of bed — if he had any thought at all — was to get back in again.The rear axle began to make a noise — a grinding, chattering, teeth-gritting rasp.The increasing reluctance of the sun to rise, the extra nip in the breeze, the patter of shed leaves dropping — all the evidences of fall drifting into winter were clearer each day. Use a dash only when a more common mark of punctuation seems inadequate. Her father’s suspicions proved well-founded — it was not Edward she cared for — it was San Francisco. »»»»» Her father’s suspicions proved well-founded. It was not Edward she cared for, it was San Francisco.Violence — the kind you see on television — is not honestly violent — there lies its harm. »»»»» Violence, the kind you see on television, is not honestly violent. There lies its harm. 9. The number of the subject determines the number of the verb. Words that intervene between subject and verb do not affect the number of the verb. The bittersweet flavor of youth — its trials, its joys, its adventures, its challenges — are not soon forgotten. »»»»» The bittersweet flavor of youth — its trials, its joys, its adventures, its challenges — is not soon forgotten. A common blunder is the use of a singular verb form in a relative clause following “one of...” or a similar expression when the relative is the subject. One of the ablest scientists who has attacked this problema »»»»» One of the ablest scientists who have attacked this problemOne of those people who is never ready on time »»»»» One of those people who are never ready on time Use a singular verb form after each, either, everyone, everybody, neither, nobody, someone. Everybody thinks he has a unique sense of humor.Although both clocks strike cheerfully, neither keeps good time. With none, use the singular verb when the word means “no one” or “not one.” None of us are perfect.None of us is perfect. A plural verb is commonly used when none suggests more than one thing or person. None are so fallible as those who are sure they’re right. A compound subject formed of two or more nouns joined by and almost always requires a plural verb. The walrus and the carpenter were walking close at hand. But certain compounds, often cliches, are so inseparable they are considered a unit and so take a singular verb, as do compound subjects qualified by each or every. The long and the short of it is...Bread and butter was all she served.Give and take is essential to a happy household.Every window, picture, and mirror was smashed. A singular subject remains singular even if other nouns are connected to it by with, as well as, in addition to, except, together with, and no less than. His speech as well as his manner is objectionable. A linking verb agrees with the number of its subject. What is wanted is a few more pairs of hands.The trouble with truth is its many varieties. Some nouns that appear to be plural are usually construed as singular and given a singular verb. Politics is an art, not a science.The Republican Headquarters is on this side of the tracks. But The general’s quarters are across the river. In these cases the writer must simply learn the idioms. The contents of a book is singular. The contents of a jar may be either singular or plural, depending on what’s in the jar — jam or marbles. 10. Use the proper case of pronoun. The personal pronouns, as well as the pronoun who, change form as they function as subject or object. Will Jane or he be hired, do you think?The culprit, it turned out, was he.We heavy eaters would rather walk than ride.Who knocks?Give this work to whoever looks idle. In the last example, whoever is the subject of looks idle; the object of the preposition to is the entire clause whoever looks idle. When who introduces a subordinate clause, its case depends on its function in that clause. Virgil Soames is the candidate whom we think will win. »»»»» Virgil Soames is the candidate who we think will win. [We think he will win.]Virgil Soames is the candidate who we hope to elect. »»»»» Virgil Soames is the candidate whom we hope to elect. [We hope to elect him.] A pronoun in a comparison is nominative if it is the subject of a stated or understood verb. Sandy writes better than I. (Than I write.) In general, avoid “understood” verbs by supplying them. I think Horace admires Jessica more than I. »»»»» I think Horace admires Jessica more than I do.Polly loves cake more than me. »»»»» Polly loves cake more than she loves me. The objective case is correct in the following examples. The ranger offered Shirley and him some advice on campsites.They came to meet the Baldwins and us.Let’s talk it over between us, then, you and me.Whom should I ask? A group of us taxpayers protested. Us in the last example is in apposition to taxpayers, the object of the preposition of. The wording, although grammatically defensible, is rarely apt. “A group of us protested as taxpayers” is better, if not exactly equivalent. Use the simple personal pronoun as a subject. Blake and myself stayed home. »»»»» Blake and I stayed home.Howard and yourself brought the lunch, I thought. »»»»» Howard and you brought the lunch, I thought. The possessive case of pronouns is used to show ownership. It has two forms: the adjectival modifier, your hat, and the noun form, a hat of yours. The dog has buried one of your gloves and one of mine in the flower bed. Gerunds usually require the possessive case. Mother objected to our driving on the icy roads. A present participle as a verbal, on the other hand, takes the objective case. They heard him singing in the shower. The difference between a verbal participle and a gerund is not always obvious, but note what is really said in each of the following. Do you mind me asking a question?Do you mind my asking a question? In the first sentence, the queried objection is to me, as opposed to other members of the group, asking a question. In the second example, the issue is whether a question may be asked at all. 11. A participial phrase at the beginning of a sentence must refer to the grammatical subject. Walking slowly down the road, he saw a woman accompanied by two children. The word walking refers to the subject of the sentence, not to the woman. To make it refer to the woman, the writer must recast the sentence. He saw a woman, accompanied by two children, walking slowly down the road. Participial phrases preceded by a conjunction or by a preposition, nouns in apposition, adjectives, and adjective phrases come under the same rule if they begin the sentence. On arriving in Chicago, his friends met him at the station. »»»»» On arriving in Chicago, he was met at the station by his friends.A soldier of proved valor, they entrusted him with the defense of the city. »»»»» A soldier of proved valor, he was entrusted with the defense of the city.Young and inexperienced, the task seemed easy to me. »»»»» Young and inexperienced, I thought the task easy.Without a friend to counsel him, the temptation proved irresistible. »»»»» Without a friend to counsel him, he found the temptation irresistible. Sentences violating Rule 11 are often ludicrous: Being in a dilapidated condition, I was able to buy the house very cheap.Wondering irresolutely what to do next, the clock struck twelve.",
    "date": "2024-07-13T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/common-pitfalls-for-web3-founders",
    "title": "Common pitfalls for Web3 founders",
    "image": "/_next/static/media/alliance.e472a41c.jpg",
    "tags": [
      "mba"
    ],
    "description": "alliance.xyz",
    "content": "Common pitfalls for Web3 founders This is a great article written by qw from Alliance - A crypto accelerator & founder community. alliance.xyz When founders come to our 1:1s and group office hours at Alliance, they often seek our advice on topics that are very specific to their project. But just as often, their questions are generic enough that they are relevant for many other founders. Let’s address these frequently asked questions. They can be broadly grouped into 4 categories: PR/marketing Hiring Community management Token economics PR/Marketing What PR/marketing firm do you recommend?Should I hire a marketing person in-house?Any advice on our Twitter/podcast strategy? Unhealthy Obsession with Marketing My knee-jerk reaction to most early-stage founders asking about PR/marketing is that “you are being too obsessed about marketing and not obsessed enough about your product.” If an early-stage startup failed 5 years from now, it would not be because they sucked at marketing. It would be because they did not find product-market fit. I’m not sure where this obsession with marketing comes from. Most founders seem to think that they are excellent at product building and that they need help with marketing. In my experience it’s very much the opposite. Most founders simply aren’t obsessed enough with users. They don’t talk to users on a regular basis. They aren’t users of their own product. How could they possibly develop unique product insights if they don’t do these things? There’s a famous platitude “It is not the best product that wins. It is the best marketed product that wins.” This may be true for mature companies, but it’s extremely dangerous for startup founders to think this way. This is because most of them don’t even have a product worth marketing for! Tactical advice on Marketing in Web3 All that being said, here are a few specific pieces of advice on PR and marketing. Don’t use an external PR/marketing agency. I now have a dozen data points from founders who have used one and shared their experience with me. There has not been a single success story. Do marketing in-house. Ask your investors to amplify your message and to connect you with the media. Content marketing is by far the single most scalable way to get your name out there and to build trust with your current and future users. Educate them on your product and industry trends you are seeing. Getting on major podcasts and conferences is difficult. Podcasters and conferences only want big names. One way to become a big name is by building a great product a lot of people use, which by definition is not a viable strategy for early stage founders. The other way, once again, is to write high-quality content. The main point of big, one-off marketing pushes such as fundraising announcements is actually not to attract potential users. It’s to attract potential hires. Your hiring candidates will do due diligence on you and will come across your announcement. But your users will only come and stay if you have a great solution to their problem. For Twitter, build your personal brand (not just your corporate brand). People trust personal brands more than corporate brands. Personal brands feel more approachable. Building a personal brand is not that critical to success. Lots of startups have succeeded without a celebrity CEO. But if you like being a public face, by all means do it. The truly Web3-native marketing strategy is tokens. And it's not just free token airdrops, but the mere fact of users owning your token. It's powerful beyond measure when used correctly. More on this later. Hiring Where do I find Solidity/Rust engineers?I need to hire more people. I’m overwhelmed. Do you have any advice? The Problem with Scaling Too Fast Too Early Hiring is one of the biggest challenges for startups. But before diving into how to hire the best people, I want to point out a common mistake that first-time founders make: they scale the team too fast before any sign of product-market fit. As a result they burn money too fast without making much progress. When your team expands, you feel good. It feeds your ego. But team size is a vanity metric. It’s a useless metric to optimize for. In fact, more often than not a smaller team of A players can achieve more than a team 3 times larger of B players. This is because more people leads to more interpersonal links, more communication burdens, and more difficulty to keep the team focused. Founders have come to me multiple times and said stuff like “I hired this community/marketing/product person. But I feel like they are not creating much value, and I’m spending so much time micro-managing them.” It’s better to not hire at all than to hire someone mediocre just for the sake of filling a role. They are actually net negatives to the organization because of the additional interpersonal links. And as a founder, many of your superpowers simply cannot be replaced by hiring someone. At least not in the early stage. If you feel overwhelmed, the best solution is not to hire more, but to do less. Prioritize, focus, ignore. When you start seeing signs that users love your product, then it's time to scale more aggressively. How to Recruit OK. Let’s dive into the top ways to recruit talents. When founders ask me how to find engineers (or other talents), my first question back to them is always “have you exhausted your personal network?” Tapping into your network is by far the most effective way to recruit talents. Nothing else comes even close. Fundamentally this is in the early days you don’t have a strong brand. So it’s very hard for people to trust you. The only people who trust you are those in your network. Make a list of the best people you know, get on a Zoom with them, pitch your startup, and ask them if they are interested in joining. It may seem awkward to ask a friend to work with you, but you absolutely have to get out of your comfort zone and do this. If they are not interested, ask them to introduce you to three people they know and respect who might be interested. Ask everyone on your team to do this too. At my previous startup I asked one of my best friends to join me. I had known him for 10 years. It was extremely awkward, and it took me a month of convincing. He ended up joining me. He also convinced one of his former colleagues to join, and so on. The network multiplies. The second best way to recruit talents is to go through your community, i.e., people who know you but whom you may not know. If you have a Discord/Telegram community, ask your community if they or their friends are interested in working with you. If you have a Twitter/newsletter, post your jobs there. Ask your allies (eg, investors) to retweet. If one of your investors has a large Twitter/newsletter audience, ask them if they can help post your jobs. In retrospect this should be obvious. You want to tap into your loyal followers instead of people who don’t even know you. Only after you’ve completely exhausted your personal network and your community should you consider using recruiting platforms like Alist, Triplebyte, Stackoverflow, coding schools, etc. One final tactical piece of advice on finding blockchain engineers: it will be far easier for you to hire experienced Web2 engineers and to train them than to find experienced Web3 engineers. Right now, in 2022, we are seeing the highest level of interest from Web2 talents looking to break into Web3. On the other hand, Web3 engineers are too rich, too comfortable, or starting their own startup. Community management How do I engage the community?How do I manage FUD?When should I hire a community lead? There’s an everlasting meme in crypto that goes something like “community is the moat”, “the best community wins”, “we are a community-run project”, and so on. I will take the other side of this for a moment. Not necessarily because I think these statements are wrong, but because I want you to think critically about these statements that people blindly throw around. I want you to reason from first principles whether or not you should have a dedicated community manager and why you even need a Discord or a Telegram in the first place. I will argue that an engaged community is not what leads to a great product. An engaged community is the result of a great product. We’ve seen this over and over again. A community gets excited and actively contributes when “numba go up”. The same community FUDs and fractures in a bear market. And in the long run, price is reasonably correlated with how well your product is doing. As such, you should not try to brute-force engagement and positivity into your community. There’s a far more natural way to engage your community, which is to treat them, first and foremost, as users. Find volunteers to beta-test your product. Ask them for product feedback. Ask your community what pain points they are experiencing. Update them on your progress and roadmap. Educate them on how to use your product because your UX may be confusing. This way, you will constantly engage the community while gaining valuable product insights. And the improved product will further strengthen the community over time. The best community person I’ve ever come across is Kain from Synthetix (who was part of our genesis cohort). And this is exactly what he did. He would constantly talk to his Discord community about the product. He would answer questions within minutes. Another great example of this is Liu Jie from Mcdex (who is also an Alliance alumni). I see him answer product questions on Telegram at 11PM local time again and again. Note that the common theme between these two examples is that the community person is the founder themself. I’m not saying every founder should live in their Discord 24/7, but community management is one of those roles where the founder cannot easily be replaced. Not to mention the fact that what the founder really is doing, via community management, is user research. Which is yet another responsibility of the founder that cannot and should not be replaced. In the early days, the founder should ideally be the de-facto community manager. Token economics Is there a playbook for token design?How should we incentivize users with tokens?What should the vesting schedule look like?How should tokens be split between community, team, and investors?Is there a standard template for token warrants? Unhealthy Obsession with Token Economics Before diving into token economics, I’d like to point out another common mistake that Web3 founders make: they are too obsessed with token economics. I’m not saying tokens aren’t important. After all, tokens as a go to market strategy are one of the key value propositions of building on Web3. With token incentives, it has never been easier for networks to solve the chicken-egg problem and to bootstrap the critical mass. But “go to market strategy” is the key word here. Again, most startups don’t even have a great product to go to the market with! If you use tokens as a user acquisition strategy without a great product, you are essentially wasting your marketing budget. And it’s a very expensive marketing strategy because the supply is limited and mistakes are irreversible. Moreover, the danger with launching token incentives too early is that you will never know whether or not you have real product-market fit. You don’t know if users come for the product or for the monetary incentives. You will have a moment of glory as all your user metrics will go up, but it will be transient. During DeFi summer 2020, many of the best products, such as Uniswap and Curve, found product-market fit before they even had a token. There were also a few great products that had a liquid token before product-market fit. But they did not use token incentives. So it’s far better to try to prove product-market fit without a token. See if you can make 100 users really happy without giving them token incentives. If your product is based on network effects and has a cold-start problem, consider conventional, Web2 growth hacks first. If you arrive at a point where you really need tokens to bootstrap the network effect, don't use them too lavishly. Don't try to engineer a multi-year incentive program (like Satoshi did with Bitcoin, which is an exception rather than the rule). Drop incentives sparingly and intermittently. It's futile to try to engineer a sophisticated algorithmic multi-year incentive program because you will inevitably make mistakes. Heck, even Ethereum is still changing their token economics 8 years after the white paper. When theory meets practice, practice wins. In short, prioritize your product over your token. (The obvious exception to the rule is if the token IS the product itself or is an integral part of the product. For instance, Maker. And to a lesser extent, Axie.) Have a rough plan for how to distribute tokens among the team, investors, community, and treasury. Have some rough ideas for what utilities you want the token to have. But don’t over-engineer it until you have a product that 100 users love. Tactical Advice on Token Economics When you are finally ready to spend time on token design, it will seem like a daunting task. You wonder, “is there a playbook?” The short answer is no, there is no playbook. Tokens should absolutely be designed from first principles, according to the unique needs of your product. Every product is different, so every token should be designed differently. Remember, tokens are a go-to-market strategy, so whether or not a particular go-to-market strategy makes sense depends on the particular product. I will point founders to leaders of their particular category. For instance, I will ask a DeFi founder to study Curve. I will ask a game developer to study Axie. But their models should not be blindly copied. Use them purely for inspiration, because their product is different from yours. When it comes to industry standards, I can tell you, for instance, what the average token distribution between team, investors, and community looks like, and what the average vesting schedule looks like. But the average is not necessarily the optimal. What is popular is not necessarily what is right. For instance, I have long criticized the ridiculously short vesting time (1-2 years) many projects have implemented. It’s a horrible misalignment of incentives. Tactically, Begin the conversation with top exchanges for listing as early as possible. They all have different requirements and their requirements evolve a lot over time. Their requirements often directly impact your token design. On that note, while you should not be obsessed about the price of your token and where it is listed (because once again, your product is more important), getting listed on a top exchange is hugely valuable. It helps widen token distribution and improves liquidity, and as a result is basically free and ongoing marketing. This is a very popular meme, but I don't necessarily buy the idea that the community should be given a far larger allocation than investors and the team. (I don't agree with the opposite either for what it is worth.) Tokens should be distributed to each group according to their current and future level of contribution to the network. Most projects reserve anywhere between 20% and 60% of their tokens to the team and the investor, with 40% being maybe the average. But once again, you should reason from first principles. Don't be too stingy with your early hires. Be ready to pay a lot of tokens for top talents. I would argue that a top early employee owning up to 1/5 of what a founder owns is not too crazy. I have had multiple founders come to me and agonize about this, but you should focus on growing as big of a pie as possible rather than a couple of percentage differences in how much you own of that pie. If you really want to inspire confidence and show that you are in it for the long haul, then your token vesting schedule should reflect it. If you shorten it or give preferential treatments to yourself and/or investors, you will self-select yourself into some of the worst investors. The top investors rarely care that much about vesting, but the worst investors want to dump quickly. One final piece of advice. If you decide to launch a token, securities laws will come into play. (Even if you are not a token project, AML, derivatives, and tax laws may be relevant for you.) Oftentimes, if you talk to 10 different lawyers about a particular topic, you will get 15 different answers. This is because many lawyers are new to this space and don't actually know what they are doing. But also due to regulatory uncertainties, even the best lawyers may have different viewpoints as they have different levels of risk tolerance and different interpretations of the law. Fortunately, we have an experienced internal legal team who also happen to be token experts. They cannot represent you, but they can give you valuable business advice and connect you to the best lawyers in this space who can represent you. Then your job will be to talk to a few of these and to make the best legal decisions by triangulating their views.",
    "date": "2024-07-11T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/account-abstraction-in-nutshell",
    "title": "Account Abstraction in Nutshell",
    "image": "/_next/static/media/scoobbb.66a51351.jpg",
    "tags": [
      "evm"
    ],
    "description": "Importantly, we must be clear that Account Abstraction is not a SOLUTION, it’s a GOAL. The goal is to answer the question “How can I interact with Ethereum without paying fee?”. Based on that primitive desire, there is a wide range of proposals trying to solve and also developing many use-cases. EIP-3074, EIP-2938, and EIP-4337 are three different approaches with their pros and cons. THEY AIN’T INHERIT OR EXTEND EACH OTHER.",
    "content": "Account Abstraction in Nutshell In this article, I will summary the history of AA development. Going through EIP-3074, EIP-2938, and EIP-4337 in simple language will hopefully give you the sense of AA. Importantly, we must be clear that Account Abstraction is not a SOLUTION, it’s a GOAL. The goal is to answer the question “How can I interact with Ethereum without paying fee?”. Based on that primitive desire, there is a wide range of proposals trying to solve and also developing many use-cases. EIP-3074, EIP-2938, and EIP-4337 are three different approaches with their pros and cons. THEY AIN’T INHERIT OR EXTEND EACH OTHER. Reveal Account Abstraction EIP-3074: Contract Delegation Propose AUTH & AUTHCALL Opcodes to the set of EVM instructions. The proposal seems share the same fundamental of the ERC20 approve-then-transfer pattern. You may use it all the time in Uniswap. First, you need to approve the Uniswap smartcontract to transfer your token. Then, you can swap your tokens to others. However, the ERC20-approve-then-transfer have a very limited scope within tokens transfer only. EIP-3074 wants to deploy that pattern to every possible actions on an EOA. The proposal introduce 2 new opcodes AUTH and AUTHCALL so that an EOA wallet can delegate its control to a smartcontract. Let’s image that your boss wallet are managing everything in your company. One day, he wants some day-offs maybe for a trip, and grants you permission to run the company as well. Because everything are under his wallet, he has to share you his private key to access the wallet and co-control the company. The flaw is that once you know the private key, there is no way to revoke it. With Contract Delegation, it seems easier now. Your boss will grant the root permission from his wallet to a smartcontract and set your wallet as an operator. Then, the smartcontract is playing the role of a deputy director. To run an execution, you can ask the smartcontract instead of sending a message to your boss. In fact, EIP-3074’s leading motivation is “sponsored transactions” when another wallet (your wallet) can pay fee instead of the permissioned wallet (your boss’ wallet) EIP-2938: Account Abstraction The first methodical attempt to Account Abstraction. One of radical limitations in smartcontract execution is that smartcontract cannot trigger a transaction by itself. There’s always an EOA sending a transaction to call functions in the smartcontract. For example: Although we approved unlimited tokens for Uniswap smartcontracts from the very beginning, we still need to sign and transfer tokens for every swap transactions. Impossible to setup an automated monthly payroll without an EOA wallet. Smartcontract cannot pay transaction fees. With EIP-2938, smartcontracts now are able to pay fees and act as an EOA wallet. Consequently, everyone can call smartcontract to trigger a transaction without fees or any on-chain interactions. The proposal is not directly solve the problem of automation like “smartcontract will pay salary monthly at a specific timestamp”. Instead, it allows an off-chain server to scheduledly call the smartcontract without fees, because the smartcontract will cover it. Vitalik had a great example how AA could help in Tornado Cash so I will quote it here rather than invent another example. The tornado.cash workflow is as follows: A user sends a transaction to the TC contract, depositing some standard quantity of coins (eg. 1 ETH). A record of their deposit, containing the hash of a secret known by the user, is added to a Merkle tree whose root is stored in the TC contract. When that user later wants to withdraw, they generate and send a ZK-SNARK proving that they know a secret whose hash is in a leaf somewhere in the deposit tree (without revealing where). The TC contract verifies the ZK-SNARK, and also verifies that a nullifier value (also derivable from the secret) has not yet been spent. The contract sends 1 ETH to the user’s desired address, and saves a record that the user’s nullifier has been spent. The privacy provided by TC arises because when a user makes a withdrawal, they can prove that it came from some unique deposit, but no one other than the user knows which deposit it came from. However, implementing TC naively has a fatal flaw: the user usually does not yet have ETH in their withdrawal address, and if the user uses their deposit address to pay for gas, that creates an on-chain link between their deposit address and their withdrawal address. Currently, this is solved via relayers; a third-party relayer verifies the ZK-SNARK and unspent status of the nullifier, publishes the transaction using their own ETH to pay for gas, and collects the fee back from the user from the TC contract. AA allows this without relayers: the user could simply send an AA transaction targeting the TC contract, the ZK-SNARK verification and the nullifier checking can be done in the verification step, and PAYGAS can be called directly after that. This allows the withdrawer to pay for gas directly out of the coins going to their withdrawal address, avoiding the need for relayers or for an on-chain link to their deposit address. A simple flow on AA EIP-3074 & EIP-2938’s drawbacks To apply these 2 EIPs, a consensus-level upgrades in Ethereum protocol is required. That vital requirement created a barrier of tech complexity and needed time for implementation and testing. Plus, they both introduce new transaction system which increase complexity for off-chain protocols to simultaneously support multiple transaction systems. To tackle the challenge, EIP-4337 was introducing AA without adjusting the Ethereum protocol. EIP-4337: Account Abstraction Using Alt Mempool Let’s image that now rather than generated a new EOA wallet for a new user, we deploy a smartcontract and send it as his/her abstract account. Every time a user interacts with the wall contract, they will send the info of the call to a new class named Bundler and this actor will sign, also pay fees for the actual transaction. It’s clear that Bundler sign the actual transaction, users no longer need to pay fees. However, because the bundler have control the wallet contract, EIP-4337 will focus on developing higher security layer further than the pair of private key and public key. That security layer will do to things: Eliminate the bad motivation of bundlers and make sure that they always act right. Only authenticated users are able to interact with his/her wallets. We recognize that EIP-4337 has a similar approach as layer 2 when it introduce a new layer on top of Ethereum consensus. Bundler is similar to Sequencer. Wallet Factory contract is similar to Layer-2’s Rollup contract. Giving a simple example of AA below will help you understand how the AA could work. Account Abstraction’s Orchestration from https://blog.jarrodwatts.com/ Wallet Contract aka. Abstract Account In this wallet, it will implements some data and functions like this: Owner. The account that owns this wallet. It’s usually the a user’s EOA address. Bundler. The address that is granted to directly interact with this contract. User Authentication. To verify signature of the owner address. Calldata Execution. To execute the desired transaction after successful authentication. All the user’s assets will be managed in the abstract account. To execute a transaction from this wallet like swapping tokens on Uniswap for example, the user will do: Compile the swap data the an object name UserOperation. Sign on the data with his/her EOA wallet (Generate a valid signature sig for his/her address addr). Send the info to a bundler. After the bundler receive the info, the bundler will do: Create a transaction to interact with the corresponding wallet contract. Set her/himself as the fee payer and sign on the transaction. Send the transaction the wallet contract. When the transaction arrive the wallet contract, the contract will do: Check the sender whether the Bundler. Verify the sig and addr is from the Owner. If all passed, run the swap transaction defined in UserOperation. Otherwise, revert all the transaction. In the mining node’s perspective, the guy who actually interact with the blockchain are bundlers, so bundlers will pay fees instead of “users”. In the above example, users still need a EOA wallet for authentication, but in the near future, Gmail Token, Phone Verification can be alternatives. Bundler Motivation The financial motivation of the bundler class is fee. These fees actually come from users but in many methods like top-up balances, ERC-20, sponsorship, etc. Conclusion In this articles, I have skipped multiple details and complex concepts like EntryPoint contract, Paymaster , and many others. Most of them were low concepts of implementation, and contributed fewer insight for an intuitive overview in AA. If you are trying to look for a technical implementation of AA, highly recommend to original materials from EIPs.",
    "date": "2023-08-09T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/bai-toan-nha-ty-phu",
    "title": "Bài toán nhà tỷ phú",
    "image": "/_next/static/media/google-quantum-computer.4b65d0b3.jpg",
    "tags": [
      "cryptography",
      "math",
      "🇻🇳"
    ],
    "description": "Bài toán gốc có tên là \"A Promise and Money\" và là một trong những bài toán trong cuộc thi Olympic Mật Mã - NSUCrypto Olympiad 2019.",
    "content": "Bài toán nhà tỷ phú Bài toán gốc có tên là \"A Promise and Money\" và là một trong những bài toán trong cuộc thi Olympic Mật Mã - NSUCrypto Olympiad 2019. Máy tính lượng tử của Google Bài toán Một nhóm $n$ nhà nghiên cứu mật mã học trẻ đang rất hứng thú với máy tính lượng tử và mong muốn được mua một chiếc. Một nhà tỷ phú nọ hứa sẽ cho mỗi người một số tiền $X_i$ nhất định, với $i=1,...,n$. Nhưng nhà tỷ phú còn ràng buộc rằng mọi người trong nhóm không được tiết lộ số tiền của mỗi người. Hỏi làm sao để các nhà nghiên cứu biết được $X=\\sum_{i=1}^n X_i$ đã đủ để mua máy tính chưa? Lời giải Mỗi nhà nghiên cứu $\\mathbb{X}i$ sẽ chọn ngẫu nhiên $n$ giá trị ${s{ij}}{j=1..n}$ sao cho $\\sum{j=1}^n s_{ij} = X_i$. Sau đó, $\\mathbb{X}i$ sẽ gửi $s{ij}$ cho $\\mathbb{X}j$, và giữ lại $s{ij}$ nếu $i=j$. Kết thúc quá trình trao đổi, $\\mathbb{X}j$ sẽ tính toán và công bố $S_j = \\sum{i=0}^n s_{ij}$. Ta thấy điều cần chứng minh: $$ \\sum_{j=0}^n S_j = \\sum_{j=0}^n \\sum_{i=0}^n s_{ij} = \\sum_{i=0}^n \\sum_{j=0}^n s_{ij} = \\sum_{i=0}^n X_i = X $$ Luận bàn Trong bài toán này, ta thấy một mẫu hình rất phổ biến của Multiparty Computation (MPC) khi mà nhiều bên cùng tham gia tính toán một giá trị chung ($X$) mà không để lộ thông tin bí mật của bản thân ($X_i$). Thực vậy, bài toán tỷ phú luôn là một ví dụ dễ hiểu khi giới thiệu về MPC. Tuy nhiên, vì lời giải còn đơn giản nên chúng ta cũng nhận ra một số vấn đề trong đó. 1️⃣ Nếu nhóm chỉ có 2 nhà nghiên cứu, lời giải trên sẽ không đủ an toàn. Cụ thể, nhà nghiên cứu $\\mathbb{X}_1$ sẽ có các thông tin sau toàn bộ giao thức: $$ \\begin{aligned} S_2 &= X - S_1 \\ s_{22} &= S_2 - s_{12} \\ X_2 &= s_{21} + s_{22} \\end{aligned} $$ 2️⃣ Nếu một nhà nghiên cứu có sai sót trong tính toán và gửi kết quả sai thì sẽ dẫn đến kết quả cuối cùng cũng sẽ bị sai. 3️⃣ Nếu nhóm có càng nhiều thành viên thì quá trình trao đổi sẽ càng mất thời gian, nếu một người không thể kết nối thì giao thức cũng không thể hoàn thành. Vì các lý do trên, một giao thức MPC để hoàn chỉnh cần nhiều yếu tố: Tính bảo mật (Privacy) Khả năng chịu lỗi (Fault Tolerance) Ngưỡng chịu lỗi (Threshold) Phát hiện lỗi (Verifiability) Tính xúc tích (Succintness) Độ dài dữ iệu (Message Length) Tính tương tác (Interactivity): Không tương tác là trường hợp tốt nhất (Non-Interactivity)",
    "date": "2023-06-05T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/nho-lam-la-hai",
    "title": "Nhớ lắm La Hai",
    "image": "/_next/static/media/troi-chieu-la-hai.f7856ae7.JPG",
    "tags": [
      "tản văn",
      "🇻🇳"
    ],
    "description": "La Hai, phố núi hiền hòa bình dị đã đi vào nhạc, vào thơ.",
    "content": "Nhớ lắm La Hai La Hai, phố núi hiền hòa bình dị đã đi vào nhạc, vào thơ. La Hai xưa. Không có phố, xóm thôn chỉ có mái tranh. Hoàng hôn buông khói biếc, hàng tre xanh im lìm soi dáng xuống dòng sông. Ôi, con sông Con, sông Cái lững lờ trôi. Sông cũng ồn ào khi lũ trẻ nghịch đùa trong những buổi trưa hè oi ả. Trời La Hai về chiều La Hai xưa: Là vùng tự do của cuộc kháng chiến chín năm lịch sử, là nơi để người lính áo vải si ta, sau những chặng đường hành quân trải bao hiểm nguy, gian lao, vất vả trở về bên các má, các chị, các em. Rồi người lính Cụ Hồ lại đi tiếp chặng đường đánh đuổi giặc cứu dân. Dãy núi La Hiên La Hai xưa: Dưa Lỗ Sấu đỏ hồng, dòn tan, ngọt lịm mát lòng người chiến sĩ, trái bắp sữa đầu mùa no dạ người lính xa quê. Kẹo đậu phụng \"nẫu\" nấu dẻo thơm. Nồi sắn hầm ấm áp bụng đêm mưa gió. Và ai đã đến đây, dầu chỉ một lần, khi xa rồi sẽ nhớ vô cùng. Nhớ miếng dưa hấu \"nẫu\" trao, bắp soi Bầu má nấu, nhớ hương kẹo xứ đường, nhớ nồi sắn hầm đêm ấy hay nhớ tình người và nụ cười của em gái La Hai? Dân gian có câu: \"Nhất gái La Hai – nhì trai Phường Lụa\". Em gái La Hai một lần đã gặp, khi đi xa rồi thì cứ luyến lưu. Ai đó bảo gái La Hai xưa có mái tóc dài, hàng mi đen cong trên đôi mắt đẹp, có nụ cười tươi như hoa buổi sáng... Gái La Hai xưa cũng hay lam, hay làm, cũng hai sương một nắng để mùa về gánh lúa vàng kĩu kịt. Và nếu giặc tới, em cũng biết cầm súng giữ làng. La Hai, La Hai quê hương! Nhiều người đã đến, đã nhớ và đã yêu, đã xem La Hai là một phần máu thịt của mình… Thôn xóm La Hai La Hai nay. Đã có phố, có phường; xóm xóm thôn thôn màu ngói đỏ như khoe cùng màu xanh đất trời, màu xanh của lúa. Hàng tre làng vẫn duyên dáng soi bóng. Dòng sông xanh vẫn lững lờ trôi. Phố núi hôm nay: Ánh điện sáng lung linh trong sương. Vẫn bóng má, bóng em trên đồng. Gặp em gái La Hai, vẫn nụ cười tươi, hai má ửng hồng. Vẫn những con người một nắng hai sương điểm tô cuộc sống... Sưu tầm: Vũ Hoài - Báo Phú Yên Online - 30/07/2007",
    "date": "2022-09-29T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/chuyen-messi-roi-barca",
    "title": "Chuyện Messi rời Barca",
    "image": "/_next/static/media/messi.8bdc2a87.webp",
    "tags": [
      "tản văn",
      "🇻🇳"
    ],
    "description": "Thuở thiếu thời, hắn mắc chứng nan y, người người khinh chê, không ai dung nạp. May có người xứ lạ quan sát hồi lâu, đinh ninh sau này xuất chúng bèn thu về chữa trị. Bịnh tình thuyên giảm, thiên phú bộc phát, thiếu niên đương tuổi không ai sánh bằng.",
    "content": "Chuyện Messi rời Barca Thuở thiếu thời, hắn mắc chứng nan y, người người khinh chê, không ai dung nạp. May có người xứ lạ quan sát hồi lâu, đinh ninh sau này xuất chúng bèn thu về chữa trị. Bịnh tình thuyên giảm, thiên phú bộc phát, thiếu niên đương tuổi không ai sánh bằng. Trường niên rèn luyện, rốt cuộc cũng đến ngày dụng binh. Lần đầu so tài, hắn chẳng màng hãi, tài năng được thể phô trương, người người khâm phục, đoán định hậu vận tất chẳng thể khinh khi. Quả ắt vậy, hắn thi đến đâu, hương danh theo đến ấy. Bảng vàng thường niên, không bao giờ vắng. Ở xứ Bồ Đào Nha cũng có người tài, khởi phát từ Lý Tư Bổn, sau gây danh ở Man Triệt Tư Đặc và Mã Đức Lí. Tài nhân so tài nhân, người xem được lòng thích thú. Tuy vậy, hắn vẫn cao tay, chiếm trọn lục kim cầu, đương định thêm một nay mai. Đến năm Tân Sửu, ngân sách lâm nguy, nội tình rối ren, tướng mới thay vẫn chưa bình ổn. Hắn bớt bổng lộc, một lòng cống hiến. Kì khôi thay, đôi bên đồng tình nhưng quan nha phá bỉnh, đặt luật khắt khe, khiến bao người bất bình nhưng không làm gì được. Chia ly khó tránh, ngày tiễn biệt ai cũng quyến luyến. Tâm muốn ở nhưng thế chẳng đành, bèn suy tính theo hướng tích cực. Gỗ lớn khó dùng, tài nhân cần bậc hiền đức trọng dụng. Messi là tài nhân, ở đâu cũng là tài nhân. Còn được xem Messi thi đấu ắt cũng là lẽ may mắn. Lionel Messi",
    "date": "2021-08-07T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/canh-dieu-thang-6",
    "title": "Cánh diều tháng 6",
    "image": "/_next/static/media/tu-ben-soi-nhin-ve-ben-ba-6.0b574916.jpg",
    "tags": [
      "tản văn",
      "🇻🇳"
    ],
    "description": "Tháng 6 về, những cánh đồng quê tôi đã gặt chỉ còn trơ gốc rạ, lũ chim sẻ ồn ào tranh nhau những hạt lúa còn sót lại dưới đất, cái bóng của đàn bò chầm chậm nhai rơm cứ dài dần theo nắng chiều nghiêng nghiêng.",
    "content": "Cánh diều tháng 6 Tháng 6 về, những cánh đồng quê tôi đã gặt chỉ còn trơ gốc rạ, lũ chim sẻ ồn ào tranh nhau những hạt lúa còn sót lại dưới đất, cái bóng của đàn bò chầm chậm nhai rơm cứ dài dần theo nắng chiều nghiêng nghiêng. Từ bên \"soi\" nhìn về bến Bà Sáu Những ngày này 20 năm về trước, đó là cả một khoảng trời rộng mở đối với lũ trẻ xóm tôi khi chúng vừa kết thúc năm học, khép lại trang vở và bắt đầu những chuỗi ngày mênh mông trên cánh đồng vàng. Mặc dù cánh đồng lúa ôm trọn cả thôn xóm, nhưng đám trẻ dường như thích chơi thả diều và đá bóng ở khu vực phía cuối xóm hơn. Vì nơi đó có cái lò gạch cũ và trạm bơm hợp tác nên thường có chỗ để chúng ngồi lại ăn quả dâu ta, quả chim chim hoặc dú dẻ khi chiều tàn. Cánh đồng xóm dưới cứ kéo mãi đến tận chân cầu sắt, tạo nên một khoảng không trải dài bất tận. Phí xa xa, đường chân trời dài đột nhiên bị cắt ngang bởi cột khói trắng của nhà máy đường. Dưới chân cầu sắt, sông Cái mùa hè hiền hoà cùng triền cát dài là nơi để đám trẻ tắm táp đùa nghịch trước khi về nhà trong tối mịt. Cứ đầu tháng 4 là ve bắt đầu kêu, nhưng râm ran nhất phải là tháng 6, tiếng ve ong ả kết hợp với cái nắng oi bức khiến cho mùa hè trở nên đặc biệt trong ký ức của chúng tôi. Tháng 6, phượng đỏ chót, lá cây xanh mượt, sen súng mọc đầy hồ, cứ như tháng 6 là lúc để mọi vật trở nên thắm đượm nhất trong cuộc đời. Tầm 5h chiều, một nhóm trẻ cầm diều chạy từ đầy xuống cuối xóm, những đứa trẻ khác dường như chỉ chờ có thế, chúng nhanh chóng ùa ra hoà vào tiếng bước chân lộp bộp trên đường cái, bụi tung mù mịt và không khí bắt đầu náo nức như hội hè. Đám thả diều, đám đá bóng, đám chơi u quạ, rượt bắt, ... trẻ con trong xóm ở đâu ra mà nhiều thế, chúng chạy nhảy, đùa nghịch vang một góc trời. Những người lớn đang đánh bò về đôi khi cũng ngoái nhìn chúng nó mà lòng cảm thấy nhẹ nhõm sau một ngày vất vả. Xóm Bầu Trời tối dần, chúng tôi càng nối dài cuộn chỉ để con diều bay thật cao, đến lúc nó chỉ còn là 1 vệt nhỏ trên bầu trời thì chúng tôi quyết định cắt đứt dây, trao tự do cho con diều. Nó bay đi đâu thì chúng tôi cũng không biết, có thể đã bay đến thông Long Hà hay rớt xuống sông Cái để trôi ra biển, chỉ biết rằng cánh diều giống vật chở mơ ước của những đứa trẻ trong xóm nghèo đi đến những nơi mà chúng chưa bao giờ đặt chân đến. Qua thời gian, cánh diều của tháng 6 càng ngày càng mờ nhạt dần khi nhiều thứ cuộc sống cứ chen chúc nhau mà lấp đầy trí nhớ, nhưng dù sao đi nữa thì nó vẫn mãi tồn tại ở đó, trên đầu đám trẻ đang đuổi bắt nhau giữa ánh chiều vàng. Có lẽ là Tí viết, chỉ biết ảnh được lưu lại vào 1/6/2021. Ảnh chụp màn hình bài Cánh diều tháng 6",
    "date": "2021-05-31T17:00:00.000Z",
    "children": []
  },
  {
    "route": "/blog/dai-so-dai-cuong",
    "title": "Đại Số Đại Cương",
    "image": "",
    "tags": [
      "math",
      "🇻🇳"
    ],
    "description": "Nguyễn Viết Đông, Trần Ngọc Hội - Đại học Quốc gia Thành phố Hồ Chí Minh, Trường Đại học Khoa Học Tự Nhiên.",
    "content": "Đại Số Đại Cương Nguyễn Viết Đông, Trần Ngọc Hội - Đại học Quốc gia Thành phố Hồ Chí Minh, Trường Đại học Khoa Học Tự Nhiên. Lời nói đầu Giáo trình Đại số đại cương được viết theo chương trình quy định của học phần cùng tên, 4 tín chỉ, nhằm phục vụ cho sinh viên ngành Toán-Tin học. Với thời lượng hạn hẹp như thế, giáo trình chỉ bao gồm những kiến thức rất cơ bản về các cấu trúc đại số mà theo chúng tôi là cần thiết cho mọi sinh viên Toán-Tin học dù cho họ chọn bất cứ hướng nào ở giai đoạn chuyên ngành. Các cấu trúc đại số cơ bản được trình bày trong giáo trình là: Nhóm, Vành, Trường, Vành đa thức, Môđun và Đại số. Những kết quả sâu hơn về lý thuyết nhóm, lý thuyết vành,... sẽ được trình bày trong một giáo trình khác mang tên Đại số hiện đại. Đại số đại cương là học phần đại số trừu tượng đầu tiên trong chương trình chuyên ngành của sinh viên Toán-Tin học, là học phần cơ sở giúp sinh viên bước đầu tiếp cận với những ký hiệu và tính toán hình thức. Vì thế, với mục đích phục vụ rộng rãi cho mọi đối tượng sinh viên, bên cạnh tính chặt chẽ và logic vốn rất được chú trọng, chúng tôi còn đưa vào giáo trình nhiều ví dụ minh hoạ. Với phương cách như thế, chúng tôi tin rằng sinh viên sẽ dễ tiếp thu hơn và độc giả sẽ tìm thấy đôi điều bổ ích khi đọc giáo trình này. Cuối mỗi chương là hệ thống bài tập khá đầy đủ và phong phú giúp sinh viên rèn luyệ kỹ năng tư duy nhằm tượng tận hơn về những vấn đề trong lý thuyết. Một số kế quả trong lý thuyết cũng được đưa vào dưới dạng bài tập. Những bài tập có đánh dấu * là những bài khó, đồi hỏi bạn đọc phải đầu tư nhiều thời gian và công sức hơn so với các bài tập khác. Chúng tôi xin chân thành cảm ơn Bộ môn Đại số, KHoa Toán-Tin học, Trường Đại học Khoa học Tự nhiên, Đại học Quốc gia Thành phố Hồ Chí Minh và Nhà xuất bản Đại học Quốc gia Thành phố Hồ Chí Minh đã tạo điều kiện thuận lợi để giáo trình này sớm đến tay bạn đọc. Đặc biệt xin cảm ơn Thạc sĩ Trịnh Thanh Đèo và Cử nhân Tống Viết Phi Hùng đã góp sức biên soạn phần bài tập và đã nhiệt tình soạn thảo toàn bộ giáo trình bằng $\\LaTeX$. Mặc dù đã có nhiều cố gắng, giáo trình vẫn có thể còn nhiều khiếm khuyết. Chúng tôi rất mong nhận được sự phê bình, góp ý của quý độc giả. Mọi ý kiến xin vui lòng gửi về Bộ môn Đại số, KHoa Toán-Tin học, Trường Đại học Khoa học Tự nhiên, Đại học Quốc gia Thành phố Hồ Chí Minh, 227 Nguyễn Văn Cừ, Quận 5, Thành phố Hồ Chí Minh. Thành phố Hồ Chí Minh, tháng 6 năm 2005 CÁC TÁC GIẢ Đôi lời riêng Trước hết, tôi không phải là tác giả hay thuộc nhóm tác giả của cuốn sách Đại số đại cương này. Riêng bản thân tôi rất thích cuốn sách này vì sự dễ hiểu và trình bày khoa học. Tuy nhiên, cuốn sách được xuất bản dưới định dạng ảnh (nhúng trong PDF) và không hỗ trợ tìm kiếm văn bản dẫn đến việc tra cứu, tham khảo gặp nhiều khó khăn. Dự án này giúp số hoá lại cuốn sách dưới định dạng văn bản thân thiện để hỗ trợ nghiên cứu tốt hơn cho bản thân và cộng đồng. Cuối cùng, bản điện tử của cuốn sách gốc có thể tìm thấy tại đây. Thành phố Hồ Chí Minh, tháng 8 năm 2020 PHAN SƠN TỰ Mục lục Chương I. NHÓM Phép toán hai ngôi Nửa nhóm Khái niệm về nhóm Nhóm hoán vị Nhóm con Nhóm con cyclic và nhóm cyclic Nhóm con chuẩn tắc và nhóm thương Đồng cấu Chương II. VÀNH VÀ TRƯỜNG Khái niệm về vành Vành con, Ideal và vành thương Đồng cấu Miền nguyên và trường Chương III. VÀNH ĐA THỨC Vành đa thức một ẩn Nghiệm của đa thức Đa thức nội suy Lagrange Đa thức trên trường số thực và phức Đa thức trên trường số hữu tỷ Vành đa thức nhiều ẩn Đa thức đối xứng Kết thức, biệt thức Chương IV. MÔĐUN VÀ ĐẠI SỐ Khái niệm về môđun Đồng cấu môđun Môđun tự do Đại số Tài liệu tham khảo [1] Nguyễn Viết Đông, Trần Huyên, Đại số đồng điều, NXB Đại học Quốc gia Thành phố Hồ Chí Minh, 2002. [2] Lê Thanh Hà, Các cấu trúc đại số cơ bản, NXB Giáo dục, 2000. [3] Đặng Xuân Hồng, Giáo trình Đại số I, Đại học Tổng hợp Thành phố Hồ Chí Minh, 1977. [4] Nguyễn Hữu Việt Hưng, Đại số đại cương, NXB Giáo dục, 1998. [5] Mỵ Vinh Quang, Đại số đại cương, NXB Giáo dục, 1998. [6] Hoàng Xuân Sính, Đại số đại cương, NXB Giáo dục, 1997. [7] M. I. Kargapolov & Ju. I. Merzljakov, Fundamentals of the Theory of Groups, English translation, Springer-Verlag, 1970. [8] A. Kurosh, Giáo trình Đại số cao cấp, Nauka, Moskva, 1975 (Tiếng Nga). [9] Joseph J. Rotman, An Introduction to the Theory of Groups, 4th edition, , Springer-Verlag, 1995.",
    "date": "2020-08-21T17:00:00.000Z",
    "children": [
      "/blog/dai-so-dai-cuong/chuong-i-nhom"
    ]
  },
  {
    "route": "/blog/dai-so-dai-cuong/chuong-i-nhom",
    "title": "Chương I. Nhóm",
    "image": "",
    "tags": [
      "math",
      "🇻🇳"
    ],
    "description": "Phép toán hai ngôi (gọi tắt là phép toán) trên tập hợp $X$ là một ánh xạ",
    "content": "Chương I. Nhóm 1. Phép toán hai ngôi Phép toán hai ngôi (gọi tắt là phép toán) trên tập hợp $X$ là một ánh xạ $$ \\begin{aligned} f: X \\times X &\\rightarrow X\\ (x,y) &\\mapsto f(x,y) \\end{aligned} $$ 1.1. Định nghĩa Ta dùng ký hiệu $xfy$ thay cho $f(x,y)$. Như vậy, ứng với các phép toán $$, $\\circ$, $+$, $\\cdot$,... ta có các ký hiệu $xy$, $x \\circ y$, $x+y$, $x \\cdot y$,... Khi ký hiệu phép toán là $\\cdot$ ta gọi đây là phép toán nhân và thường viết $xy$ thay cho $x \\cdot y$ mà ta gọi là tích của $x$ và $y$. Còn khi ký hiệu phép toán là $+$ ta gọi đây là phép toán cộng và $x+y$ là tổng của $x$ và $y$. 1.2. Ví dụ Phép cộng và phép nhân thông thường trên các tập hợp $\\mathbb{N}$, $\\mathbb{Z}$, $\\mathbb{Q}$, $\\mathbb{R}$, $\\mathbb{C}$ là các phép toán; phép trừ thông thường là phép toán trên các tập hợp $\\mathbb{Z}$, $\\mathbb{Q}$, $\\mathbb{R}$, $\\mathbb{C}$ nhưng không là phép toán trên $\\mathbb{N}$. Phép cộng và phép nhân ma trận là các phép toán trên $M(n, \\mathbb{R})$ gồm các ma trận vuông cấp $n$ với hệ số thực. 1.3. Định nghĩa Cho phép toán $$ trên tập hợp $X$. Ta nói phép toán $$: giao hoán, nếu với mọi $x,y \\in X, xy = yx$; kết hợp, nếu với mọi $x,y,z \\in X, (xy)z = x(yz)$; có phần tử trung hòa trái (tương ứng, phải) là $e$ nếu $e \\in X$ và với mọi $x \\in X, ex=x$ (tuơng ứng, $xe=x$). Nếu $e$ vừa là phần tử trung hòa trái vừa là phần tử trung hòa phải thì ta nói $e$ là phần tử trung hòa của phép toán $*$. 1.4. Mệnh đề Một phép toán có nhiều nhất một phần tử trung hòa. Chứng minh. Giả sử $e'$ và $e''$ là hai phần tử trung hòa của phép toán $*$. Xét phần tử $e'*e''$. Vì $e'$ là phần tử trung hòa trái nên $e' * e'' = e''$. Mặt khác, vì $e''$ là phần tử trung hòa phải nên $e' * e'' = e'$. Suy ra $e'=e''$. $\\quad \\blacksquare$ 1.5. Nhận xét Từ chứng minh của Mệnh đề 1.4 ta thấy nếu $e'$ là phần tử trung hòa trái và $e''$ là phần tử trung hòa phải của phép toán $*$ thì $e'=e''$. Đặc biệt, nếu trong $X$ tồn tại phần tử trung hòa $e$ thì đó là phần tử trung hòa trái duy nhất đồng thời cũng là phần tử trung hòa phải duy nhất. 1.6. Định nghĩa Cho $$ là một phép toán trên tập hợp $X$ có phần tử trung hòa $e$ và $x$ là một phần tử tùy ý của $X$. Ta nói $x$ khả đối xứng trái (tuơng ứng, phải) nếu tồn tại $x' \\in X$ sao cho $x' * X = e$ (tương ứng, $x * x' = e$). Khi đó $x'$ được gọi là phần tử đối xứng trái (tương ứng, phải) của $x$. Trường hợp $x$ vừa khả đối xứng trái, vừa khả đối xứng phải thì ta nói $x$ khả đối xứng và phần tử $x' \\in X$ thỏa $xx' = x'*x = e$ được gọi là phần tử đối xứng của $x$. 1.7. Mệnh đề Nếu phép toán $*$ kết hợp thì một phần tử có nhiều nhất một phần tử đối xứng. Chứng minh. Giả sử $x'$ và $x''$ là hai phần tử đối xứng của $x$. Khi đó $x' * x = e$ và $x * x'' = e$. Do đó $$ \\begin{aligned} x' &= x' * e\\ &= x' * (x * x'')\\ &= [x' * x) * x''\\ &= e * x'' = x'' \\quad \\blacksquare \\end{aligned} $$ 1.8. Nhận xét Từ chứng minh của Mệnh đề 1.7 ta thấy, khi phép toán $*$ kết hợp, nếu $x'$ là phần tử đối xứng trái của $x$ và $x''$ là phần tử đối xứng phải của $x$ thì $x' = x''$. Đặc biệt, nếu $x$ khả đối xứng và $x'$ là phần tử đối xứng của $x$ thì $x'$ là phần tử đối xứng trái duy nhất và cũng là phần tử đối xứng phải duy nhất của $x$. 1.9. Thuật ngữ và ký hiệu Trường hợp phép toán cộng: Phần tử trung hòa được gọi là phần tử không và được ký hiệu là $0$, tính chất khả đối xứng được gọi là khả đối, phần tử đối xứng của $x$ được gọi là phần tử đối của $x$ và ký hiệu là $-x$. Trường hợp phép toán nhân: Phần tử trung hòa được gọi là phần tử đơn vị và được ký hiệu là $e$ hay $1$, tính chất khả đối xứng được gọi là khả nghịch, phần tử đối xứng của $x$ được gọi là phần tử nghịch đảo của $x$ và ký hiệu là $x^{-1}$. Từ đây trở về sau, nếu không có gì gây nhầm lẫn, ta dùng phép toán nhân để chỉ một phép toán tùy ý trên tập hợp đang khảo sát. 2. Nửa nhóm 2.1. Định nghĩa Cho tập hợp $X$ với phép toán nhân. Ta nói $(X,\\cdot)$ (gọi tắt là $X$) là: một nửa nhóm nếu phép toán nhân kết hợp trên $X$; một vị nhóm nếu phép toán nhân kết hợp trên $X$ và có phần tử trung hòa trên $X$. Một nửa nhóm được gọi là giao hoán hay Abel nếu phép toán tương ứng giao hoán. 2.2. Ví dụ Với phép cộng thông thường, các tập hợp $\\mathbb{N}$, $\\mathbb{Z}$, $\\mathbb{Q}$, $\\mathbb{R}$, $\\mathbb{C}$ trở thành các vị nhóm giao hoán. Với phép cộng thông thường, tập hợp $\\mathbb{N}^*$ gồm các số nguyên dương trở thành một nửa nhóm giao hoán nhưng không là vị nhóm. 2.3. Ký hiệu Trong nửa nhóm $(X,\\cdot)$, do phép toán nhân kết hợp nên với mọi $x,y,z$: $$ (xy)z = x(yz) $$ Giá trị chung của hai vế trong đẳng thức trên được ký hiệu là $xyz$ và gọi là tích của các phần tử $x,y,z$ theo thứ tự đó. Bằng quy nạp, ta định nghĩa tích của $n$ phần tử $x_1, ..., x_n$ như sau: $$ x_1 ... x_n = x_1 (x_2 ... x_n) $$ Ta có định lý sau: 2.4. Định lý Cho $x_1, ..., x_n$ là $n$ phần tử tuỳ ý của nửa nhóm $(X, \\cdot)$ với $n \\ge 3$. Khi đó: $$ x_1 ... x_n = (x_1 ... x_i) (x_{i+1} ... x_j) ... (x_{k+1} ... x_j) $$ trong đó $1 \\le i \\lt j ... \\lt k \\lt n$. Chứng minh. Vì $X$ là một nửa nhóm nên định lý đúng với $n=3$. Xét $n \\lt 3$, giả sử định lý dúng cho mọi tích có $m$ phần tử với $3 \\le m \\lt n$. Khi đó sử dụng giả thuyết quy nạp và tính kết hợp ta có $$ \\begin{aligned} &(x_1 ... x_i) (x_{i+1} ... x_j) ... (x_{k+1} ... x_j)\\ = &(x_1 ... x_i) [(x_{i+1} ... x_j) ... (x_{k+1} ... x_j)]\\ = &[x_1(x_2 ... x_i)][(x_{i+1} ... x_n)]\\ = &x_1(x_2 ... x_n) = x_1 ... x_n \\quad \\blacksquare \\end{aligned} $$ 2.5. Ký hiệu Trong nửa nhóm $(X,\\cdot)$ tích của $n$ phần tử, mỗi phần tử đều bằng $x$ được gọi là luỹ thừa bậc $n$ của $x$ và được ký hiệu là $x^n$. Do Định lý 2.4 ta có $$ x^m x^n = x^{m+n}, (x^m)^n = x^{mn}, \\forall m,n \\in \\mathbb{N}^* $$ Trường hợp nửa nhóm cộng $(X,+)$, tổng của $n$ phần tử được gọi là bội $n$ của $x$ và ký hiệu là $nx$. Khi đó các tính chất trên trở thành $$ mx+nx=(m+n)x, m(nx)=(mn)x $$ 2.6. Định lý Trong nửa nhóm giao hoán, tích của $n$ phần tử tuỳ ý không phụ thuộc vào thứ tự của các phần tử. Chứng minh. Vì phép toán giao hoán nên định lý đúng với $n=2$. Xét $n \\gt 2$. Giả sử định lý đúng với mọi tích của $m$ phần tử với $m \\lt n$. Ta chứng minh $x_1 ... x_n = x_{\\sigma(1)} ... x_{\\sigma(n)}$ với mọi phép hoán vị $\\sigma$ của tập hợp ${1,2,...,n}$. Thật vậy, đặt $k=\\sigma(n)$, bằng cách sử dụng giải thuyết quy nạp và các tính chất giao hoán, kết hợp của phép nhân ta có: $$ \\begin{aligned} x_1...x_n &= (x_1...x_{k-1})[x_k(x_{k+1}...x_n)]\\ &= (x_1...x_{k-1})[(x_{k+1}...x_n)x_k]\\ &= (x_1...x_{k-1}x_{k+1}...x_n)x_k\\ &= (x_{\\sigma(1)}...x_{\\sigma(n-1)})x_{\\sigma(n)}\\ &= x_{\\sigma(1)}...x_{\\sigma(n)} \\quad \\blacksquare \\end{aligned} $$ 3. Khái niệm về nhóm 3.1. Định nghĩa Nhóm là một vị nhóm mà mọi phần tử đều khả đối xứng. Nói cách khác, tập hợp $G$ khác rỗng với phép toán nhân được gọi là một nhóm nếu các tính chất sau được thoả: $(G_1)$ Với mọi $x,y,z \\in G, (xy)z=z(yz)$; $(G_2)$ Tồn tại $e \\in G$ sao cho với mọi $x \\in G, ex=xe=x$; $(G_3)$ Với mọi $x \\in G$, tồn tại $x^{-1} \\in G$ sao cho $xx^{-1}=x^{-1}x=e$. Nếu phép toán trên $G$ là phép cộng thì các tính chất trên trở thành: $(G_1)$ Với mọi $x,y,z \\in G, (x+y)+z=z+(y+z)$; $(G_2)$ Tồn tại $0 \\in G$ sao cho với mọi $x \\in G, 0+x=x+0=x$; $(G_3)$ Với mọi $x \\in G$, tồn tại $-x \\in G$ sao cho $x+(-x)=(-x)+x=0$. Trường hợp phép toán trên nhóm $G$ giao hoán thì $G$ là nhóm giao hoán hay là nhóm Abel. Nhóm $G$ được gọi là nhóm hữu hạn khi tập hợp $G$ hữu hạn. Khi đó số phần tử của $G$ được gọi là cấp của nhóm $G$. Nếu nhóm $G$ không hữu hạn thì ta nói $G$ là nhóm vô hạn. 3.2. Ví dụ Tập hợp các số nguyên $\\mathbb{Z}$ cùng với phpes cộng thông thường là một nhóm giao hoán mà ta gọi là nhóm cộng các số nguyên. Tương tự ta có nhóm công các số hữu tỷ $\\mathbb{Q}$, nhóm cộng các số thực $\\mathbb{R}$ và nhóm cộng các số phức $\\mathbb{C}$. Tập hợp các số hữu tỷ khác không $\\mathbb{Q^}$ cùng với phép nhân thông thường là một nhóm giao hoán mà ta gọi là nhóm nhân các số hữu tỷ khác không. Tương tự ta có nhóm nhân các số thực khác không $\\mathbb{R^}$, và nhóm nhân các số phức khác không $\\mathbb{C^*}$. Với $X={1,2,...,n}$, đặt $ S_n = {\\sigma | \\sigma: X \\rightarrow X}$ là một song ánh. Khi đó $S_n$ với phép hợp nối ánh xạ là một nhóm (có phần tử đơn vị là ánh xạ đồng nhất $Id_X$ và phần tử nghịch đảo của $\\sigma \\in S_n$ chính là ánh xạ ngược $\\sigma^{-1}$). Ta gọi $(S_n,\\circ)$ là nhóm hoán vị hay nhóm đối xứng bậc $n$. Đây là một nhóm hữu hạn có cấp $n!$ (xem 4). Tập hợp $GL(n,\\mathbb{R})$ gồm các ma trận vuông cấp $n$, khả nghịch với hệ số thực cùng với phép nhân ma trận là một nhóm không giao hoán với mọi $n \\gt 1$ (với phần tử đơn vị là mà trận đơn vị $I_n$ và phần tử nghịch đảo của $A \\in GL(n,\\mathbb{R})$ chính là ma trận nghịch đảo $A^{-1}$). Ta gọi $GL(n,\\mathbb{R})$ là nhóm tuyến tính đầu đủ bậc $n$ (hay nhóm tuyến tính tổng quát bậc $n$) trên $\\mathbb{R}$. 3.3. Định lý Cho nhóm $(G,\\cdot)$ và $x,y,x_1,...,x_n \\in G$ Khi đó: (i) Phần tử đơn vị $e$ là duy nhất. (ii) Phần từ nghịch đảo $x^{-1}$ của $x$ là duy nhất và $(x^{-1})^{-1}=x$. (iii) $xy=e$ khi và chỉ khi $yx=e$. Hơn nữa khi đó $y=x^{-1}$. (iv) $(x_1...x_n)^{-1} = x_n^{-1}...x_1^{-1}$. Đặc biệt $(x^n)^{-1}=(x^{-1})^n$ với mọi $n$ nguyên dương. (v) Phép toán nhân có tính giản ước, nghĩa là với mọi $x,y,z \\in G$, từ dẳng thức $xy=xz$ hay $yx=zx$ đều dẫn đến $y=z$. Chứng minh. (i) Suy từ Mệnh đề 1.4. (ii) Suy từ Mệnh đề 1.7. (iii) Suy từ Nhận xét 1.8. (iv) Chỉ cần nhận xét rằng $$ \\begin{aligned} &(x_1...x_n)(x_n^{-1}...x_1^{-1})\\ &= (x_1...x_{n-1})(x_nx_n^{-1})(x_{n-1}^{-1}...x_1^{-1})\\ &= (x_1...x_{n-1})(x_{n-1}^{-1}...x_1^{-1})\\ &= ...\\ &= e \\end{aligned} $$ sau đó sử dụng (iii). (v) Từ đẳng thức $xy=xz$ ta suy ra $x^{-1}(xy)=x^{-1}(xz)$ hay $(x^{-1}x)y=(x^{-1}x)z$, nghĩa là $y=z$. Tương tự, từ đẳng thức $yx=zx$ cũng dẫn đến $y=z$. $\\quad \\blacksquare$ 3.4. Ký hiệu Trong nhóm nhân $(G,\\cdot)$ ta dùng ký hiệu $x^{-n}$ để chỉ phần tử $(x^{-1})^n$ với mọi số $n$ nguyên dương và đặt $x^0=e$. Như vậy ta đã định nghĩa luỹ thừa bận $n$ của một phần tử bất kỳ trong một nhóm nhân với $n$ nguyên. Chú ý rằng, do tính chất (iv) trong Định lý 3.3, các công thức $x^mx^n = x^{m+n}$ và $(x^m)^n=x^{mn}$ (hay $mx+nx = (m+n)x$ và $m(nx)=n(mx)$ đối với nhóm cộng) vẫn còn đúng với mọi $m,n$ nguyên. 3.5. Định lý Cho $(G,\\cdot)$ là một nửa nhóm khác rỗng. Các mệnh đề sau tương đương: (i) $(G,\\cdot)$ là một nhóm; (ii) Với mọi $a,b \\in G$, các phương trình $ax=b$ và $ya=b$ đều có nghiệm trong $G$; (iii) Trong $G$ có phần tử đơn vị trái $e$ và với mọi $x \\in G$, tồn tại $x' \\in G$ sao cho $x'x=e$; (iv) Trong $G$ có phần tử đơn vị phải $e'$ và với mọi $x \\in G$, tồn tại $x' \\in G$ sao cho $xx''=e'$. Chứng minh. (i) $\\Rightarrow$ (ii) Ta có $x=a^{-1}b$ và $y=ba^{-1}$ lần lượt là các nghiệm của phương trình $ax=b$ và $ya=b$. (ii) $\\Rightarrow$ (iii) Do $G \\neq \\text{\\O}$ nên tồn tại $a_0 \\in G$. Gọi $e$ là nghiệm của phương trình $ya_0=a_0$. Khi đó $e$ là phần tử đơn vị trái. Thật vậy, với $b$ là một phần tử tuỳ ý của $G$, gọi $c$ là nghiệm của phương trình $a_0x=b$, khi đó $a_0c=b$ nên $$ eb=e(a_0c)=(ea_0)c=a_0c=b $$ Vậy $e$ là phần tử đơn vị trái. Tính chất sai cùng trong (iii) được suy từ giả thuyết mọi phương trình dạng $ya=e$ đều có nghiệm trong $G$. (iii) $\\Rightarrow$ (ii) Giả sử trong $G$ có phần tử đơn vị trái $e$ và với mọi $x \\in G$, tồn tại $x' \\in G$ sao cho $x'x=e$. Ta chứng minh $e$ là phần tử đơn vị và $x'$ là phần tử nghịch đảo của $x$. Theo giả thuyết, với $x'$ như trên tồn tại $x'' \\in G$ sao cho $x''x'=e$. Do đó $$ \\begin{aligned} xx'&=e(xx')=(x''x')(xx')\\ &=x''(x'x)x'=x''ex'=x''x'=e \\end{aligned} $$ Suy ra $$ xe=x(x'x)=(xx')x=ex=x $$ Các kết quả trên chứng tỏ $e$ là phần tử đơn vị và $x'=x^{-1}$. Do đó $(G,\\cdot)$ là một nhóm. Tương tự ta cũng có (i) $\\Rightarrow$ (ii); (ii) $\\Rightarrow$ (iv) và (iv) $\\Rightarrow$ (i). Do đó định lý được chứng minh. $\\quad \\blacksquare$ 4. Nhóm hoán vị 4.1. Định nghĩa Cho tập hợp $X \\neq \\text{\\O}$ gồm $n$ phần tử (ta có thể đồng nhất $X$ với ${1,2,...,n}$). Khi đó tập hợp $S_n$ gồm tất cả các song ánh từ $X$ vào $X$ là một nhóm với phép hợp nối ánh xạ. Tạ gọi $S_n$ là nhóm hoán vị bậc $n$. Nhóm hoán vị $S_n$ là nhóm hữu hạn có cấp $n!$, có phần tử trung hoà là ánh xạ đồng nhất $Id_X$ và phần tử nghịch đảo của $\\sigma \\in S_n$ là ánh xạ ngược $\\sigma^{-1}$. Nhóm này không giao hoán nếu $n \\ge 2$. 4.2. Một số thuật ngữ và ký hiệu Mỗi phần tử $\\sigma \\in S_n$ được gọi là một phép hoán vị hay một phép thế bậc $n$ và có thể được biểu diễn bởi một ma trận loại $2 \\times n$: $$ \\begin{pmatrix} 1 & 2 & \\cdots & n\\ \\sigma(1) & \\sigma(2) & \\cdots & \\sigma(n) \\end{pmatrix} $$ trong đó ở dòng thứ nhất, các phần tử của tập $X$ được sắp xếp theo một thứ tự nào đó (thường là $1,2,...,n$), dòng thứ hai gồm ảnh của các phần tử tương ứng ở dòng thứ nhất qua song ánh $\\sigma$. Phép hoán vị $\\sigma \\in S_n$ được gọi là một $r$-chu trình hay một chu trình có chiều dài $r$ nếu tồn tại các phần tử phân biệt $i_1,i_2,...,i_r \\in X$ sao cho $\\sigma(i_1)=i_2,...,\\sigma(i_{r-1})=i_r,\\sigma(i_r)=i_1$ và $\\sigma(i)=i, \\forall i \\in X \\backslash {i_1,i_2,...i_r}$. Khi đó ta viết $\\sigma=(i_1i_2...i_r)$. Hai chu trình $\\sigma=(i_1i_2...i_r)$, $\\sigma'=(j_1j_2...j_s)$ được gọi là rời nhau hay độc lập nếu ${i_1,i_2,...,i_r} \\cap {j_1,j_2,...,j_s} = \\text{\\O}$. Mỗi 2-chu trình trong $S_n$ được gọi là một chuyển vị. Như vậy mỗi chuyển vị có dạng $(i,j)$ với $1 \\le i \\ne j \\le n$. Ví dụ: a. Trong nhóm hoán vị $S_6$, phép hoá vị $\\sigma$ xác định bởi $\\sigma(1)=2,\\sigma(2)=5,\\sigma(3)=4,\\sigma(4)=1,\\sigma(5)=3,\\sigma(6)=6$ được mô tả như sau: $$ \\sigma = \\begin{pmatrix} 1&2&3&4&5&6\\ 2&5&4&1&3&6 \\end{pmatrix} $$ b. Trong nhóm hoán vị $S_7$, chu trình $\\sigma=(1;3;4;7)$ có chiều dài 4 và là phép hoán vị: $$ \\sigma = \\begin{pmatrix} 1&2&3&4&5&6&7\\ 3&2&4&7&5&6&1 \\end{pmatrix} $$ c. Trong nhóm hoá vị $S_8$, chuyển vị (2 ; 5) là phép hoán vị: $$ \\sigma = \\begin{pmatrix} 1&2&3&4&5&6&7&8\\ 1&5&3&4&2&6&7&8 \\end{pmatrix} $$ d. Trong nhóm hoán vị $S_5$, cho $$ \\begin{aligned} \\sigma&=(1;2;5;3)\\ \\tau&= \\begin{pmatrix} 1&2&3&4&5\\ 4&3&5&1&2 \\end{pmatrix} \\end{aligned} $$ Ta có $$ \\begin{aligned} \\sigma\\tau&= \\begin{pmatrix} 1&2&3&4&5\\ 4&1&3&2&5 \\end{pmatrix}=(1;4;2)\\ \\tau\\sigma&= \\begin{pmatrix} 1&2&3&4&5\\ 3&2&4&1&5 \\end{pmatrix}=(1;3;4)\\ \\sigma^{-1}&=(3;5;2;1)\\ \\tau^{-1}&= \\begin{pmatrix} 1&2&3&4&5\\ 4&5&2&1&3 \\end{pmatrix}\\ \\end{aligned} $$ 4.3. Nhận xét Hai chu trình $\\sigma$ và $\\tau$ rời nhau thì chúng giao hoán lẫn nhau, nghĩa là $\\sigma\\tau=\\tau\\sigma$. 4.4. Định lý Mọi phép hoán vị bậc $n$ khác ánh xạ đồng nhất đều được phân tích thành tích các chu trình rời nhau có chiều dài lớn hơn hay bằng 2. Cách phân tích là duy nhất sai khác một sự đổi chỗ các chu trình. Chứng minh. Sự tồn tại: Gọi $k$ là số các phần tử $i$ sao cho $\\sigma(i) \\ne i$. Chọn $i_1$ sao cho $i_2=\\sigma(i_1) \\ne i_1;i_3=\\sigma(i_2);...;i_{j+1}=\\sigma(i_j);...$ Gọi $r$ là số nhỏ nhất sao cho $\\sigma(i_r) \\in {i_1;...;i_{r-1}}$, khi đó $\\sigma(i_r)=i_1$ (vì nếu $\\sigma(i_r)=i_j \\ne i_1$ thì ta có $\\sigma(i_r)=i_j=\\sigma(i_{j-1})$ nên $\\sigma$ không là song ánh). Đặt $\\sigma_1 = (i_1i_2...i_r)$ và $X_1={i_1,i_2,...,i_r}$. Khi đó, nếu $r=k$ thì $\\sigma_1=\\sigma$ nên $\\sigma$ là một chu trình, nếu $r \\lt k$, ta gọi $i_{r+1} \\notin X_1$ là một phần tử thoả $\\sigma(i_{r+1}) \\ne i_{r+1}$. Thực hiện tương tự quá trình trên cho tập hợp $X_2=X \\backslash X_1$ ta được chu trình $\\sigma_2$ rời nhau với $\\sigma_1$. Tiếp tục thực hiện như vậy, cuối cùng ta nhận được các chu trình $\\sigma_1,\\sigma_2,...,\\sigma_p$ rời nhau từng đôi một và $\\sigma=\\sigma_1\\sigma_2...\\sigma_p$. Sự duy nhất: Giả sử $\\sigma \\ne Id_X$ và $\\sigma$ được phân tích dưới dạng $$ \\sigma = \\sigma_1\\sigma_2...\\sigma_p = \\sigma'_1\\sigma'_2...\\sigma'_p $$ Trong đó $\\sigma_1,\\sigma_2,...,\\sigma_p$ là các chu trình rời nhau và $\\sigma'_1,\\sigma'_2,...,\\sigma'_p$ cũng là các chu trình rời nhau. Đặt $\\sigma_1=(i_1i_2...i_r)$. Khi đó tồn tại $1 \\le k \\le q$ sao cho $$ \\begin{aligned} \\sigma'_k(i_1)=\\sigma(i_1)=\\sigma_1(i_1)=i_2,\\ \\sigma'_k(i_2)=\\sigma(i_2)=\\sigma_1(i_2)=i_3,\\ \\cdots\\ \\sigma'_k(i_r)=\\sigma(i_r)=\\sigma_1(i_r)=i_1,\\ \\end{aligned} $$ Do đó $\\sigma'_k=\\sigma_1$. Không mất tính tổng quát ta có thể giả sử $\\sigma'_1=\\sigma_1$. Khi đó $\\sigma_2...\\sigma_p=\\sigma'_2...\\sigma'_q$. Tiếp tục thực hiện như trên, cuối cùng ta được $p=q$ và $\\sigma'_i=\\sigma_i$ với mọi $1 \\le i \\le p$. Định lý được chứng minh. $\\quad \\blacksquare$ Ví dụ: Trong nhốm hoán vị $S_{10}$ ta có $$ \\begin{aligned} \\sigma &= \\begin{pmatrix} 1&2&3&4&5&6&7&8&9&10\\ 3&2&7&9&1&4&8&5&6&10\\ \\end{pmatrix}\\ &= (1;3;7;8;5)(4;9;6) \\end{aligned} $$ 4.5. Bổ đề Mọi chu trình trong $S_n$ đều được phân tích thành tích của các chuyển vị. Chứng minh. Cho $\\sigma=(i_1i_2...i_r)$ là một chu trình. Ta có $\\sigma=(i_1i_r)(i_1i_{r-1})...(i_1i_2)$. $\\quad \\blacksquare$ 4.6. Định lý Mọi phép hoán vị trong $S_n$ đều được phân tích thành tích của các chuyển vị. Chứng minh. Suy từ Định lý 4.4 và Bổ đề 4.5. $\\quad \\blacksquare$ Ví dụ: Với $\\sigma$ như trong ví dụ trên, ta có $$ \\sigma = (1;5)(1;8)(1;7)(1;3)(4;6)(4;9) $$ Nhận xét rằng sự phân tích thành tích các chuyển vị của một chu trình là không duy nhất. Do đó sự phân tích trong Định lý 4.6 là không duy nhất. Tuy nhiên chúng ta sẽ chứng minh rằng tính chẵn lẻ của số các chuyển vị trong các phân tích là không thay đổi. 4.7. Định nghĩa Cho $\\sigma \\in S_n$. Ta nói rằng ${i,j}$ tạo thành một nghịch thế đối với $\\sigma$ nếu $$ (i-j)[\\sigma(i)-\\sigma(j)] \\lt 0 $$ Nếu số các nghịch thế đối với $\\sigma$ là $k$ thì dấu của $\\sigma$, ký hiệu $sgn(\\sigma)$, là hàm được định nghĩa bởi $$ sgn(\\sigma)=(-1)^k $$ Nếu $sgn(\\sigma)=1$ thì $\\sigma$ được gọi là hoán vị chẵn, nếu $sgn(\\sigma)=-1$ thì $\\sigma$ được gọi là hoán vị lẻ. 4.8. Nhận xét (i) $sgn(Id_X) = 1$. (ii) $sgn(\\sigma) = sgn(\\sigma^{-1})$. (iii) Nếu $\\sigma$ là một chuyển vị thì $sgn(\\sigma) = -1$. 4.9. Định lý Với mọi $\\sigma,\\tau \\in S_n$ thì $$ sgn(\\sigma\\tau)=sgn(\\sigma)sgn(\\tau) $$ Chứng minh. Gọi $k_1,k_2$ và $k$ lần lượt là số nghich thế trong $\\sigma.\\tau$ và $\\sigma\\tau$. Giả sử $1 \\le i \\lt j \\le n$. Hoán vị $\\sigma$ có thể được biểu diễn như sau: $$ \\sigma= \\begin{pmatrix} \\cdots & \\tau(i) \\cdots & \\tau(j) \\cdots\\ \\cdots & \\sigma\\tau(i) \\cdots & \\sigma\\tau(j) \\cdots \\end{pmatrix} $$ Khi đó Nếu $\\tau(i) \\lt \\tau(j)$ và $\\sigma\\tau(i) \\lt \\sigma\\tau(j)$ thì ${i,j}$ không là nghịch thế trong $\\tau$; $(\\tau(i),\\tau(j))$ không là nghịch thế trong $\\sigma$ và ${i,j}$ không là nghịch thế trong $\\sigma\\tau$. Nếu $\\tau(i) \\lt \\tau(j)$ và $\\sigma\\tau(i) \\gt \\sigma\\tau(j)$ thì ${i,j}$ không là nghịch thế trong $\\tau$; $(\\tau(i),\\tau(j))$ là nghịch thế trong $\\sigma$ và ${i,j}$ là nghịch thế trong $\\sigma\\tau$. Nếu $\\tau(i) \\gt \\tau(j)$ và $\\sigma\\tau(i) \\lt \\sigma\\tau(j)$ thì ${i,j}$ là nghịch thế trong $\\tau$; $(\\tau(i),\\tau(j))$ là nghịch thế trong $\\sigma$ và ${i,j}$ không là nghịch thế trong $\\sigma\\tau$. Nếu $\\tau(i) \\gt \\tau(j)$ và $\\sigma\\tau(i) \\gt \\sigma\\tau(j)$ thì ${i,j}$ là nghịch thế trong $\\tau$; $(\\tau(i),\\tau(j))$ không là nghịch thế trong $\\sigma$ và ${i,j}$ là nghịch thế trong $\\sigma\\tau$. Kết hợp 4 trường hợp trên ta được $k+k_1+k_2$ là một số chẵn nên $(-1)^k=(-1)^{k_1}(-1)^{k_2}$, nghĩa là $$ sgn(\\sigma\\tau)=sgn(\\sigma)sgn(\\tau) \\quad \\blacksquare $$ Từ Bổ đề 4.5, Nhận xét 4.8 và Định lý 4.9 ta suy ra: 4.10. Định lý _Với mọi hoán vị $\\sigma \\in S_n$, ta có $$ sgn(\\sigma) = (-1)^l $$ với $l$ là số chuyển vị trong phân tích $\\sigma$ thành tích các chuyển vị. Đặc biệt, tính chẵn lẻ của số các chuyển vị trong Định lý 4.6 là duy nhất. Ví dụ: Xét tính chẵn lẻ của phép hoán vị $\\sigma \\in S_{10}$ sau: $$ \\begin{aligned} \\sigma &= \\begin{pmatrix} 1&2&3&4&5&6&7&8&9&10\\ 3&5&6&4&8&1&7&10&2&9 \\end{pmatrix}\\ &= (1;3;6)(2;5;8;10;9;)\\ &= (1;6)(1;3)(2;9)(2;10)(2;8)(2;5) \\end{aligned} $$ Vì $\\sigma$ được viết dưới dạng tích của 6 chuyển vị nên $sgn(\\sigma)=1$ nghĩa là $\\sigma$ là một hoán vị chẵn. 4.11. Hệ quả Nếu $\\sigma$ là một $r$-chu trình thì (i) $sgn(\\sigma)=(-1)^{r-1}$; (ii) $\\sigma$ chẵn $\\Leftrightarrow$ $r$ lẻ; và $\\sigma$ lẻ $\\Leftrightarrow$ $r$ chẵn. 5. Nhóm con 5.1. Định nghĩa Một tập con $H$ của nhóm $(G,\\cdot)$ được gọi là tập con ổn định của nhóm $G$ nếu với mọi $x,y \\in H, xy \\in H$. Khi đó phép toán nhân thu hẹp trên $H$ xác định một phép toán trên $H$ mà ta gọi là phép toán cảm sing trên $H$ (từ phép toán trên $G$). 5.2. Định nghĩa Nhóm con $H$ của nhóm $G$ là một tập con ổn định của nhóm $G$ sao cho cùng với phép toán cảm sing $H$ là một nhóm. Ký hiệu $H \\le G$ để chỉ $H$ là một nhóm con của $G$. Định lý sau đây cho ta dấu hiệu để nhận biết nhóm con của một nhóm cho trước. 5.3. Định lý Cho $H$ là một tập con khác rỗng của nhóm $(G,\\cdot)$. Các mệnh đề sau tương đương: (i) $H \\le G$; (ii) Với mọi $x,y \\in H,xy \\in H$ và $x{^-1} \\in H$; (iii) Với mọi $x,y \\in H, x^{-1}y \\in H$. Chứng minh. (i) $\\Rightarrow$ (ii) Trước hết ta chứng minh phần tử đơn vị $e'$ của nhóm con $H$ cũng chính là phần tử đơn vị $e$ của $G$. Thật vậy, với mọi $x \\in H$ ta có $e'x=x=ex$ nên do tính giản ước ta suy ra $e'=e$. Bây giờ gọi $x'$ là phần tử nghịch đảo của $x$ trong đó nhóm con $H$, ta có $x'x=e=x^{-1}x$, do đó $x^{-1}=x' \\in H$. Tính chất $xy \\in H$ được suy từ tính chất nhóm con $H$ là tập hợp con ổn định của $G$. (ii) $\\Rightarrow$ (iii) Với mọi $x,y \\in H$, giả thuyết (ii) cho ta $x^{-1} \\in H$ và do đó $x^{-1}y \\in H$. (iii) $\\Rightarrow$ (i) Vì $H \\ne \\text{\\O}$ nên tồn tại $a \\in H$ vả do đó $e=a^{-1}a \\in H$. Bây giờ với mọi $x \\in H, x^{-1} = x^{-1}e \\in H$. Cuối cùng, với mọi $x,y \\in H$, do $x^{-1} \\in H$ nên $xy = (x^{-1})^{-1}y \\in H$. Suy ra $H \\le G$. $\\quad \\blacksquare$ 5.4. Ví dụ Các tập hợp ${e}$ và $G$ đều là các nhóm con của $G$. Ta gọi đậy là các nhóm con tầm thường của $G$. Từ Ví dụ 3.2 ta thấy $\\mathbb{Z} \\le \\mathbb{Q} \\le \\mathbb{R} \\le \\mathbb{C}$ và $\\mathbb{Q}^* \\le \\mathbb{R}^* \\le \\mathbb{C}^*$. Gọi $A_n$ là tập hợp gồm tất cả những hoán vị chẵn trong nhóm hoán vị $S_n$. Khi đó từ Nhận xét 4.8 và các Định lý 4.9, 5.3 ta thấy $A_n \\le S_n$. Ta gọi $A_n$ là nhóm thay phiên bậc $n$. Tập hợp $SL(n,\\mathbb{R})$ gồm các ma trận vuông cấp $n$ với hệ số thực có định thức bằng 1 là một nhóm con của nhóm tuyến tính đầy đủ $GL(n,\\mathbb{R})$. Ta gọi $SL(n,\\mathbb{R})$ là nhóm tuyến tính đặc biệt bậc $n$ trên $\\mathbb{R}$. 5.5. Định lý Giao của một họ không rỗng các nhóm con của một nhóm $G$ cũng là nhóm con của $G$. Chứng minh. Giả sử ${H_i}{i \\in I}$ là một họ không rỗng các nhóm con của nhóm $(G,\\cdot)$. Đặt $H=\\cap{i \\in I} H_i$. Khi đó $H \\ne \\text{\\O}$ vì $e \\in H$. Với mọi $x,y \\in H$ ta có $x,y \\in H_i, \\forall i \\in I$ nên theo Định lý 5.3, $x^{-1}y \\in H_i, \\forall i in I$, nghĩa là $x^{-1}y \\in H$. Suy ra $H \\le G$. $\\quad \\blacksquare$ Bây giờ cho $S$ là một tạp hợp con của nhóm $G$. Ta xét họ tất cả các nhóm con của $G$ chứa $S$. Họ này không rỗng vì chứa $G$. Thẹo Định lý 5.5 giao của họ đó là một nhóm con của $G$. Hiển nhiên đây là một nhóm con nhỏ nhất của $G$ chứa $S$. Ta có định nghĩa sau: 5.6. Định nghĩa Cho $S$ là một tập con của nhóm $G$. Nhóm con sinh bởi $S$ là nhóm con nhỏ nhất của $G$ chứa $S$ và được ký hiệu là $\\left< S \\right>$. Tập hợ $S$ được gọi là tập sinh của nhóm $\\left< S \\right>$. Nếu $S$ hữu hạn: $S={x_1,...,x_n}$ thì ta nói $\\left< S \\right>$ là nhóm hữu hạn sinh với phần tử sinh $x_1,...,x_n$ mà ta thường ký hiệu nhóm này là $\\left< x_1,...,x_n \\right>$. Định lý sau đây mô tả các nhóm con sinh bởi một tập hợp: 5.7. Định lý CHo $S$ là một tập con của $G$. Khi đó: (i) Nếu $S \\ne \\text{\\O}$ thì $\\left< S \\right> = {e}$. (ii) Nếu $S \\ne \\text{\\O}$ thì $$ \\left< S \\right> = { x_1^{\\varepsilon_1}...x_n^{\\varepsilon_n} | n \\in \\mathbb{N}^*, x_i \\in S, \\varepsilon_i=\\pm 1 } $$ Chứng minh. Khẳng định (i) là hiển nhiên. Ta chứng minh (ii). Thật vậy, ký hiệu vế phải của đẳng thức trong (ii) là $H$. Vì nhóm con $\\left< S \\right>$ chứa tất cả các phần tử $x_i$ của $S$ nên $\\left< S \\right>$ chứa $H$. Mặt khác, do cách đặt $H$ ta thấy nếu $x,y \\in H$ thì $xy \\in H$ và $x^{-1} \\in H$ nên $H$ là một nhóm con của $G$. Từ đây, do $H$ chứa $S$ nên ta có $H$ chứa $\\left< S \\right>$. Suy ra $H = \\left< S \\right>$. $\\quad \\blacksquare$ 5.8. Ví dụ Ta có $\\mathbb{Z} = \\left< 1 \\right>$ và $\\mathbb{Q} = \\left< \\frac{1}{n} | n \\in \\mathbb{N}^* \\right>$. Ta có $\\mathbb{Q}^* = \\left< P \\right>$, trong đó $P={{-1} \\cup p }$ với $p$ nguyên tố dương. Xét nhóm hoá vị $S_n$. Vì mỗi phpeps hoán vị dều được phân tích thành tích các chuyển vị nên $S_n$ là nhóm sinh bởi các chuyển vị. 5.9. Chú ý Nếu $H$ và $K$ là hai nhóm con của nhóm $G$ thì $H \\cup K$ không nhất thiết là một nhóm con của $G$ (Xem bài tập 1.20). Ta ké hiệu $H \\vee K$ để chỉ nhóm con sinh bởi $H \\cup K$. 6. Nhóm con cyclic và nhóm cyclic 6.1. Định nghĩa Cho $G$ là một nhóm. Nhóm con $\\left< a \\right>$ của $G$ sinh bởi phần tử $a \\in G$ đuọc gọi là nhóm con cyclic sinh bởi $a$. Nếu tồn tại phần tử $a \\in G$ sao cho $\\left< a \\right> = G$ thì ta nói $G$ là một nhóm cyclic và $a$ là phần tử sinh của $G$. Từ Định lý 5.7 ta suy ra mệnh đề sau: 6.2. Mệnh đề Nhóm con cyclic sinh bởi $a$ là tập hợp gồm tất cả các lũ thừa $a^n$ với $n \\in \\mathbb{Z}$, nghĩa là $\\left< a \\right> = { a^n | n \\in \\mathbb{Z} }$. Cho $(G,\\cdot)$ là một nhóm và $a \\in G$. Xét nhóm con cyclic $\\left< a \\right>$. Khi đó có hai trường hợp có thể xảy ra: Trường hợp 1. Tất cả các luỹ thừa $a^n(n \\in \\mathbb{Z})$ đều khác nhau từng đôi một. Trong trường hợp này $\\left< a \\right>$ là nhóm vô hạn. Trường hợp 2. Tồn tại những luỹ thừa của $a$ bằng nhau, chẳng hạn $a^k = a^l(k > l)$. Khi đó $a^{k-l}=e$ với $k-l > 0$. Do đó tồn tại những số nguyên dương $m$ sao cho $a^m=e$. Gọi $n$ là số nguyên dương nhỏ nhất sao cho $a^n=e$. Khi đó các phần tử $e,a,...,a^{n-1}$ đôi một khác nhau và $\\left< a \\right> ={e,a,...,a^{n-1}}$, Thật vậy, với $0 \\le i < j \\le n-1$, vì $0 < j-i < n$ nên do tính chất nhỏ nhất của $n$ suy ra $a^{j-i} \\ne e$, nghĩa là $a^j \\ne a^i$. Hơn nữa, với $x \\in \\left< a \\right>$, tồn tại $m \\in \\mathbb{Z}$ sao cho $x=a^m$. Chia $m$ cho $n$ ta tìm được $q,r \\in \\mathbb{Z}$ với $0 \\le r \\le n-1$ sao cho $m=qn+r$. Khi đó $$ x=a^m=a^{qn+r}=(a^n)^q a^r=e^qa^r=a^r $$ và khẳng định trên được chứng minh. $\\quad \\blacksquare$ Tóm lại, nếu tất cả các luỹ thừa của $a$ đều khách nhau thì $\\left< a \\right>$ là nhóm vô hạn, còn nếu tồn tại những luý thừa của $a$ bằng nhau thì $\\left< a \\right>$ là nhóm hữu hạn cấp $n: \\left< a \\right> = {e,a,...,a^{n-1}}$, trong đó $n$ là số nguyên dương nhỏ nhất sao cho $a^n=e$. Từ đây ta có định nghĩa sau: 6.3. Định nghĩa Cấp của một phần tử $a$ trong nhóm $G$ là cấp của nhóm con cyclic $\\left< a \\right>$. Ta thường ký hiệu $o(a)$ hay $\\left| a \\right|$ để chỉ cấp của phần tử $a$. Từ Định nghĩa 6.3 và theo lý luận trên ta có hệ quả sau: 6.4. Hệ quả Cho $(G,\\cdot)$ là một nhóm và $a \\in G$. Ta có: (i) $a$ có cấp vô hạn khi và chỉ khi với mọi $k \\in \\mathbb{Z}$, nếu $a^k=e$ thì $k=0$. (ii) $a$ có cấp hữu hạn khi và chỉ khi tông tại $k \\in \\mathbb{Z}^*$ sao cho $a^k=e$. (iii) Nếu $a$ có cấp hữu hạn thì cấp của $a$ là số nguyên dương $n$ nhỏ nhất sao cho $a^n=e$. Hơn nữa, khi đó với mọi $k \\in \\mathbb{Z}, a^k=e$ khi và chỉ khi $k$ là bội số của $n$. 6.5. Ví dụ Nhóm cộng các số nguyên $\\mathbb{Z}$ là nhóm cyclic sing bởi 1. Với mỗi $n$ nguyên dương, quan hệ đồng dư modulo $n$ trên $\\mathbb{Z}$ định bởi $z \\equiv y \\mod n \\Leftrightarrow x-y$ chia hết cho $n$. Đây là một quan hệ tương đương trên $\\mathbb{Z}$ với các lớp tương đương là $\\overline{x} = {x+kn|k \\in \\mathbb{Z}}$. Tập thương của $\\mathbb{Z}$ theo quan hệ đồng dư modulo $n$ định bởi $\\mathbb{Z}_n={\\overline{x}| x \\in \\mathbb{Z}}={\\overline{0},\\overline{1},...,\\overline{n-1}}$. Trên $\\mathbb{Z}_n$ ta định nghĩa phép toán cộng như sau: $\\overline{x}+\\overline{y}=\\overline{x+y}$. Kiểm chứng dễ dàng rằng định ghĩa trên được hoàn toàn xác định và $\\mathbb{Z}_n$ trở thành một nhóm giao hoán, Hơn nữa, $\\mathbb{Z}_n$ là nhóm cyclic hữu hạn cấp $n$ sinh bởi $\\overline{1}$. Ta gọi $\\mathbb{Z}_n$ là nhóm cộng các số nguyên modulo $n$. Trong nhóm hoán vị $S_n$, một $r$-chu trình $\\sigma={i_1 ; i_2 ; ... ; i_r}$ luôn luôn có cấp $r$ vì $\\sigma^r=Id$ và $\\sigma^l \\ne Id$ với mọi $0<l<r$. 6.6. Định lý Mọi nhóm con của nhóm cyclic đều là nhóm cyclic. Hơn nữa, nếu $H \\le \\left< a \\right>$ và $H \\ne {e}$ thì $H=\\left< a^n \\right>$ trong đó $n$ là số nguyên dương nhỏ nhất sao cho $a^n \\in H$. Chứng minh. Giả sử $H \\subset \\left< a \\right>$. Nếu $H={e}$ thì hiển nhiên $H$ là nhóm con cyclic sinh bởi $e$. Xét trường hợp $H \\ne {e}$. Khi đó tồn tại $k \\in \\mathbb{Z}^$ sao cho $a^k \\in H$. Vì $a^k$ và $a^{-k}=(a^k)^{-1}$ đều thuộc $H$ nên có thể khẳng định rằng tồn tại $l \\in \\mathbb{N}^$ sao cho $a^l \\in H$. Gọi $n$ là sô nguyên dương nhỏ nhất sao cho $a^n \\in H$. Ta chứng minh $H = \\left< a^n \\right>$. Thật vậy, hiển nhiên $\\left< a^n \\right> \\subseteq H$. Ngược lại, cho $x=a^m \\in H$. Lấy $m$ chia cho $n$ ta tìm được $q,r \\in \\mathbb{Z}$ sao cho $m=qn+r$ với $0 \\le r < n$. Vì $a^r=a^m(a^n)^{-q} \\in H$ nên theo định nghĩa của $n$ ta phai có $r=0$, nghĩa là $m=qn$ và $x=(a^n)^q \\in \\left< a^n \\right>$. Điều này chứng tỏ $H \\subset \\left< a^n \\right>$. Vậy $H = \\left< a^n \\right>$. $\\quad \\blacksquare$ Từ Định lý 6.6 ta suy ra hệ quả sau: 6.7. Hệ quả $H$ là một nhóm con của nhóm cộng các số nguyên $\\mathbb{Z}$ khi và chỉ khi $H$ có dạng $n \\mathbb{Z}$ với $n \\in \\mathbb{N}$, trong đó $$ n \\mathbb{Z} = { nk | k \\in \\mathbb{Z} } $$ 7. Nhóm con chuẩn tắc và nhóm thương 7.1. Định lý Cho $(G,\\cdot)$ là một nhóm và $H$ là một nhóm con của $G$. Xét quan hệ $\\sim$ trên $G$ như sau: $$ x \\sim y \\Leftrightarrow x^{-1}y \\in H $$ Khi đó (i) $\\sim$ là một quan hệ tương đương trên $G$. (ii) Lớp tương đương chứa $x$ là $\\overline{x} = xH$, trong đó $$ xH = { xh | h \\in H } $$ Ta gọi $xH$ là lớp ghép của $H$ (bởi phần tử $x$). Tập hợp thương của $G$ theo quan hệ $\\sim$, ký hiệu là $G/H$, được gọi là tập thương của $G$ trên $H$ và $\\left| G/H \\right|$ là chỉ số của nhóm con $H$ trong $G$, ký hiệu là $[G:H]$. Chứng minh. (i) Tính phản xạ: Với mọi $x \\in G, x \\sim x$ vì $x^{-1}x = e \\in H$. Tính đối xứng: Với mọi $x,y \\in G$, nếu $x \\sim y$ thì $x^{-1}y \\in H$ nên $y^{-1}x = (x^{-1}y)^{-1} \\in H$, nghĩa là $y \\sim x$. Tính bắc cầu: Với mọi $x,y,z \\in G$, nếu $x \\sim y$ và $y \\sim z$ thì $x^{-1}y \\in H$ và $y^{-1}z \\in H$ nên $x^{-1}z = (x^{-1}y)(y^{-1}z) \\in H$, nghĩa là $x \\sim z$. Vậy $\\sim$ là một quan hệ tương đương trên $G$. (ii) Ta có $$ \\begin{aligned} x \\sim y &\\Leftrightarrow x^{-1}y \\in H\\ &\\Leftrightarrow \\exist h \\in H, x^{-1}y = h\\ &\\Leftrightarrow \\exist h \\in H, y = xh\\ \\end{aligned} $$ Suy ra $\\overline{x} = { y \\in G | x \\sim y } = { xh | h \\in H } = xh$. $\\quad \\blacksquare$ 7.2. Chú ý Hoàn toàn tương tự, ta định nghĩa được quan hệ $\\sim'$ trên $G$ như sau: $$ x \\sim' y \\Leftrightarrow xy^{-1} \\in H $$ Khi đó $\\sim'$ cũng là một quan hệ tương đương trên $G$ và lớp tương đương chứa $x$ là $\\overline{x} = Hx$, trong đó $Hx={ hx|h \\in H }$. Ta gọi $Hx$ là lớp ghép phải của $H$ (bởi phần tử $x$). Định lý sau đây cho ta thông tin về cấp của các nhóm con của các nhóm hữu hạn. 7.3. Định lý Lagrange Cho $G$ là một nhóm hữu hạn và $H$ là một nhóm con của $G$. Khi đó $$ |G| = |H||G:H| $$ Chứng minh. Trước hết nhận xét rằng nếu $xH$ là một lớp ghép trái thì ánh xạ $$ \\begin{aligned} \\varphi: H &\\rightarrow xH\\ h &\\mapsto xh \\end{aligned} $$ là một song ánh. Thật vậy, $\\varphi$ là toàn ánh do định nghĩa của tập hợp $xH$, $\\varphi$ là đơn ánh vì nếu $xh=xk$ thì $h=k$ do tính giản ước của phép toán nhân trong nhóm $G$. Như vậy số phần tử của các lớp ghép trái đều bằng nhau và bằng $|H|$, số lớp ghép là $[G:H]$. Do đó $$ |G|=|H||G:H| \\quad \\blacksquare $$ TỪ Định lý Lagrange ta suy ra ngay hệ quả sau: 7.5. Hệ quả Cho $G$ là một nhóm hữu hạn. Khi đó: (i) Cấp của mỗi nhóm con của $G$ là một ước số của cấp của $G$. (ii) Cấp của mỗi phần tử thuộc $G$ là một ước số của cấp của $G$. (iii) Nếu $G$ có cấp nguyên tố thì $G$ là nhóm cyclic và $G$ được sinh bởi một phần tử bất kỳ khác $e$. Chú ý rằng nếu $H$ là một nhóm con tuỳ ý của $G$ thì tập thương $G/H$ như đã xây dựng trong Định lý 7.1 không nhất thiết là một nhóm. Sau đây chúng ta đề cập đến một loại nhóm con đặc biệt mà ứng với nhóm con loại đó tập hợp thương trở thành một nhóm. 7.5. Định nghĩa Một nhóm con $H$ của nhóm $(G,\\cdot)$ được gọi là chuẩn tắc nếu với mọi $x \\in G$ và $h \\in H, x^{-1}hx \\in H$. Ký hiệu $H \\triangleleft G$ để chỉ $H$ là một nhóm con chuẩn tắc của $G$. 7.6. Mệnh đề Cho $H$ là một nhóm con của nhóm $(G,\\cdot)$. Các mệnh đề sau tương đương: (i) $H \\triangleleft G$; (ii) $\\forall x \\in G, x^{-1}Hx \\subset H$; (iii) $\\forall x \\in G, x^{-1}Hx = H$; (iv) $\\forall x \\in G, xH = Hx$; trong đó $x^{-1}Hx={ x^{-1}hx | h \\in H }$. Chứng minh. (i) $\\Leftarrow$ (ii) Hiển nhiên do định nghĩa. (ii) $\\Leftarrow$ (iii) Với giả thuyết (ii) ta có $x^{-1}Hx \\subset H$. Mặt khác $xHx^{-1} = (x^{-1})^{-1}H(x^{-1}) \\subset H$ nên $H \\subset x^{-1}Hx$. Từ đó $x^{-1}Hx=H$. (iii) $\\Leftarrow$ (iv) Theo giải thuyết (iii), $x^{-1}Hx=H$ nên $xH=x(x^{-1}Hx)=Hx$. (iv) $\\Leftarrow$ (i) Với mọi $x \\in G$ và $h \\in H$ ta có $hx \\in Hx = xH$ nên tồn tại $k \\in H$ sao cho $hx = xk$. Suy ra $x^{-1}hx = k \\in H$. Điều này chứng tỏ $H \\triangleleft G$. $\\quad \\blacksquare$ 7.7. Nhận xét Nếu $G$ giao hoán thì mọi nhóm con của $G$ đều chuẩn tắc. Các nhóm con tầm thường ${e}$ và $G$ đều chuẩn tắc trong $G$. 7.8. Ví dụ Nhóm thay phiên bậc $n$ (Xem Ví dụ 5.4) là nhóm con chuẩn tắc của nhóm hoán vị $S_n$ vì mọt hoán vị chẵn $\\tau$ ta có $\\sigma^{-1}\\tau\\sigma$ cũng là hoán vị chẵn với mọi hoán vị $\\sigma \\in S_n$. Nhóm tuyến tính đặc biệt $SL(n,\\mathbb{R})$ (Xem Ví dụ 5.4) là nhóm on chuẩn tắc của nhóm tuyến tính đầy đủ $GL(n,\\mathbb{R})$ vì với mọi $X \\in GL(n,\\mathbb{R})$ và $A \\in SL(n,\\mathbb{R})$ ta có $$ \\begin{aligned} &\\det(X^-1AX)\\ &= (\\det X)^{-1} (\\det A) (\\det X)\\ &= \\det(A) = 1 \\end{aligned} $$ nghĩa là $X^{-1}AX \\in SL(n,\\mathbb{R})$. Khi $H$ là một nhóm con chuẩn tắc của $G$ thì tập thương $G/H$ trở thành một nhóm như trong định lý sau: 7.9. Định lý Cho $G$ là một nhóm và $H$ là nhóm con chuẩn tắc của $G$. Khi đó: (i) Lớp $xyH$ chỉ phụ thuộc vào các lớp $xH$ và $yH$ mà không phụ thuộc vào sự lựa chọn của các phần tử đại diện $x,y$ của các lớp đó. (ii) Tập thương $G/H$ cùng với phép toán nhân định bởi $(xH)(yH) = xyH$ là một nhóm, gọi là nhóm thương của $G$ trên $H$. Chứng minh. (i) Giả sử $x_iH=xH$ và $y_qH=yH$, nghĩa là $x^{-1}x_1 \\in H$ và $y^{-1}y_1 \\in H$. Ta cần chứng minh $x_1y_1H=xyH$, nghĩa là $(xy)^{-1}(x_1y_1) \\in H$. Thật vậy $$ \\begin{aligned} &(xy)^{-1}(x_1y_1)\\ &= y^{-1}x^{-1}x_1y_1\\ &= y^{-1}x^{-1}x_1y \\end{aligned} $$ Phần tử sau cùng thuộc $H$ do $x^{-1}x_1$ và $y^{-1}y_1$ đều thuộc $H$ và $H \\triangleleft G$. (ii) Do (i) phép toán nhân được định nghĩa như trong (ii) được hoàn toàn xác định. Tính kết hợp của phép toán nhân trên $G/H$ được suy từ tính kết hợp của phép toán nhân trên $G$. Phần tử đơn vị trong $G/H$ chính là lớp $eH=H$, trong đó $e$ là phần tử đơn vị của $G$, còn phần tử nghịch đảo của lớp $xH$ chính là $x^{-1}H$. 7.10. Nhận xét Nếu $G$ là một nhóm giao doán thì nhóm thương $G/H$ cũng giao hoán. Chiều đảo không đúng. Với $H \\le G$, nếu tập thương $G/H$ là một nhóm với phép toán được định nghĩa như trên $((xH)(yH)=xyH)$ thì $H \\triangleleft G$. Thật vậy, với mọt $x \\in G$ và $h \\in H$ ta có $x^{-1}hxH = (x^{-1}H)(hH)(xH) = (x^{-1}H)H(xH) = (x^{-1}H)(xH) = x^{-1}xH = H$ nên $x^{-1}hx \\in H$. 7.11. Ví dụ Vì nhóm cộng các số nguyên $\\mathbb{Z}$ giao hoán nên với mỗi $n$ nguyên dương nhóm con $n\\mathbb{Z}$ chuẩn tắc trong $\\mathbb{Z}$. Ứng với nhóm con $H=n\\mathbb{Z}$, quan hệ $\\sim$ trong Định lý 7.1 định bởi $x \\sim y \\Leftrightarrow x-y \\in n\\mathbb{Z} \\Leftrightarrow x-y$ chia hết cho $n$. Như vậy, $\\sim$ chính là quan hệ đồng dư $\\mod n$ trên $\\mathbb{Z}$ và nhóm thương $\\mathbb{Z}/n\\mathbb{Z}$ chính là nhóm cộng $\\mathbb{Z}_n$ các số nguyên $\\mod n$ trong Ví dụ 6.5, Theo Ví dụ 7.8, $A_n \\triangleleft S_n$. Nếu $\\sigma$ và $\\tau$ là hai hoán vị lẻ thì $\\sigma^{-1}\\tau$ là hoán vị chẵn nên $\\sigma^{-1}\\tau \\in A_n$, từ đó $\\sigma A_n = \\tau A_n$. Điều này chứng tỏ nhóm thương $S_n/A_n$ có đúng hai phần tử: $S_n/A_n = {A_n, \\overline{A_n}}$, trong đó $\\overline{A_n} = S_n \\backslash A_n$. 8. Đồng cấu",
    "date": "2020-08-21T17:00:00.000Z",
    "children": [
      "/blog/dai-so-dai-cuong/chuong-i-nhom/bai-tap"
    ]
  },
  {
    "route": "/blog/dai-so-dai-cuong/chuong-i-nhom/bai-tap",
    "title": "Bài tập",
    "image": "",
    "tags": [
      "math",
      "🇻🇳"
    ],
    "description": "Cho $H,K$ là các nhóm con của $G$. Chứng minh rằng $H \\cup K$ là nhóm con của $G$ khi và chỉ khi $H \\subset K$ hay $K \\subset H$.",
    "content": "Bài tập Bài 1.20 Cho $H,K$ là các nhóm con của $G$. Chứng minh rằng $H \\cup K$ là nhóm con của $G$ khi và chỉ khi $H \\subset K$ hay $K \\subset H$.",
    "date": "2020-08-21T17:00:00.000Z",
    "children": []
  }
]
